Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/sys_action/*.locallang.xlf
Languages: de

# sys_action
source: Action
de: Aktion

# description
source: An 'Action' is a configuration of a specific task which may be performed by assigned usergroups via the Task Center.
de: Eine 'Aktion' ist eine Konfiguration einer speziellen Aufgabe, die von zugeordneten Benutzergruppen im Aufgabenzentrum ausgeführt werden kann.

# new-sys_action
source: Create a new action
de: Neue Aktion erstellen

# edit-sys_action
source: Edit record
de: Datensatz bearbeiten

# action_error-not-found
source: The action doesn't exist
de: Die Aktion existiert nicht

# action_not-found
source: No actions found
de: Keine Aktionen gefunden

# action_not-found-description
source: Currently there are no actions yet defined!
de: Momentan sind noch keine Aktionen festgelegt worden!

# action_error-access
source: You don't have sufficient rights to see the records. Please ask the administrator to set those for you.
de: Sie haben keine ausreichenden Rechte, um diesen Datensatz anzuzeigen. Bitte fragen Sie Ihren Administrator, diese für Sie zu setzen.

# error-wrong-email
source: The E-mail address is wrong.
de: Die E-Mail-Adresse ist falsch.

# error-username-empty
source: The username is empty.
de: Das Feld 'Benutzername' ist leer.

# error-password-empty
source: The password is empty.
de: Das Feld 'Passwort' ist leer.

# error-wrong-user
source: You are not allowed to edit this user.
de: Sie dürfen diesen Benutzer nicht bearbeiten.

source: Success
de: Erfolg

# success-user-created
source: The user has been created.
de: Der Benutzer wurde erstellt.

# success-user-updated
source: The user has been updated.
de: Der Benutzer wurde aktualisiert.

# action_noType
source: Error: The action had no type defined.
de: Fehler: Für die Aktion wurde kein Typ definiert.

# action_notReady
source: Error: The action configuration is not finished.
de: Fehler: Die Konfiguration der Aktion ist nicht abgeschlossen.

# action_download_file
source: Click here to download the exported data in a file
de: Klicken Sie hier, um die exportierten Daten als Datei herunterzuladen.

# action_editQuery
source: Edit Query
de: Abfrage bearbeiten

# action_createQuery
source: Create Query
de: Abfrage erstellen

# action_emptyQuery
source: Query is empty, create one first!
de: Abfrage ist leer, erstellen Sie zunächst eine!

source: Action error!
de: Befehlsfehler!

# action_lowlevelMissing
source: The extension "lowlevel" must be installed in order to create a query.
de: Um eine Abfrage erstellen zu können, muss die Erweiterung "lowlevel" installiert sein.

# action_BEu_hidden
source: Disable user
de: Benutzer deaktivieren

# action_BEu_username
source: Login name
de: Benutzername

# action_BEu_password
source: Password
de: Passwort

# action_BEu_realName
source: Real name
de: Richtiger Name

# action_BEu_usergroups
source: Member of groups
de: Mitglied der Gruppen

# action_t2_result
source: Result of query
de: Ergebnis der Anfrage

# action_Create
source: Create Backend User
de: Backend-Benutzer anlegen

# action_Update
source: Update Backend User
de: Backend-Benutzer aktualisieren

# action_t1_listOfUsers
source: List of backend users
de: Liste der Backend-Benutzer

# action_BEu_db_mount
source: Pagetree starting points
de: Seitenbaumstartpunkte

# action_t4_edit
source: Select record to edit:
de: Zu bearbeitenden Datensatz auswählen:

# action_toolbaritem
source: Open System Actions
de: Systemaktionen öffnen
