Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/sys_action/*.locallang_tca.xlf
Languages: de

# sys_action
source: Action
de: Befehl

# tx_sys_action
source: Actions
de: Befehle

# sys_action.hidden
source: Deactivated:
de: Deaktiviert:

# sys_action.assign_to_groups
source: Assign action to groups:
de: Aktion Gruppen zuweisen:

# sys_action.t1_userprefix
source: User prefix:
de: Benutzerpräfix:

# sys_action.t1_allowed_groups
source: Groups which may be assigned through the action:
de: Gruppen, die mit dieser Aktion zugewiesen werden können:

# sys_action.t1_create_user_dir
source: Create User Home Directory:
de: Heimverzeichnis des Benutzers erstellen:

# sys_action.t1_copy_of_user
source: Template user:
de: Vorlage für Benutzer:

# sys_action.t3_listPid
source: List pid:
de: PID auflisten:

# sys_action.t3_tables
source: List only table:
de: Nur Tabelle auflisten:

# sys_action.t4_recordsToEdit
source: Records to edit:
de: Zu bearbeitende Datensätze:

# sys_action.type.1
source: Create Backend User
de: Backend-Benutzer erstellen

# sys_action.type.2
source: SQL query
de: SQL-Anfrage

# sys_action.type.3
source: Record list
de: Datensätze auflisten

# sys_action.type.4
source: Edit records
de: Datensätze bearbeiten

# sys_action.type.5
source: New Record
de: Neuer Datensatz
