Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/impexp/app/*.locallang.xlf
Languages: de

# import
source: Import from .t3d
de: Importieren aus .t3d

# export
source: Export to .t3d
de: Exportieren in .t3d

# moduleFunction.tx_impexp_modfunc1
source: Export Presets
de: Voreinstellungen für Export

# tableselec_configuration
source: Configuration
de: Konfiguration

# exportdata_savedFile
source: SAVED FILE
de: DATEI GESPEICHERT

# exportdata_savedInSBytes
source: Saved in "%s", bytes %s
de: Gespeichert in "%s" (%s Bytes)

# exportdata_problemsSavingFile
source: Problems saving file
de: Fehler beim Speichern

# exportdata_badPathS
source: Bad path: "%s"
de: Fehlerhafter Pfad: "%s"

# exportdata_filePreset
source: File & Preset
de: Datei & Voreinstellungen

# exportdata_advancedOptions
source: Advanced Options
de: Erweiterte Einstellungen

# exportdata_messages
source: Messages
de: Meldungen

# execlistqu_structureToBeExported
source: Structure to be exported:
de: Zu exportierende Struktur:

# execlistqu_maxNumberLimit
source: Max number limit!
de: Höchstwert erreicht!

# makeconfig_anSqlQueryReturned
source: An SQL query returned exactly the amount of records specified by the limit value (%s) - that could indicate an incomplete selection of records! Make sure this is on purpose.
de: Eine SQL-Abfrage erbrachte genau den voreingestellten Höchstwert (LIMIT %s) - das könnte bedeuten, dass nicht alle Datensätze vollständig selektiert wurden! Vergewissern Sie sich, dass das absichtlich geschah.

# makeconfig_exportPagetreeConfiguration
source: Export pagetree configuration:
de: Exporteinstellungen für Seitenbaum:

# makeconfig_pageId
source: Page ID:
de: Seiten-ID:

# makeconfig_tree
source: Tree:
de: Baum:

# makeconfig_noTreeExportedOnly
source: No tree exported - only tables on the page.
de: Kein Baum exportiert - nur Tabellen auf dieser Seite.

# makeconfig_tablesOnThisPage
source: Tables on this page
de: Tabellen auf dieser Seite

# makeconfig_expandedTree
source: Expanded tree
de: Erweiterter Baum

# makeconfig_onlyThisPage
source: Only this page
de: Nur diese Seite

# makeconfig_1Level
source: 1 level
de: 1 Ebene

# makeconfig_2Levels
source: 2 levels
de: 2 Ebenen

# makeconfig_3Levels
source: 3 levels
de: 3 Ebenen

# makeconfig_4Levels
source: 4 levels
de: 4 Ebenen

# makeconfig_infinite
source: Infinite
de: Unendlich

# makeconfig_levels
source: Levels:
de: Ebenen:

# makeconfig_includeTables
source: Include tables:
de: Einzuschließende Tabellen:

# makeconfig_maxNumberOfRecords
source: Max number of records:
de: Höchstwert für Datensätze:

# makeconfig_exportSingleRecord
source: Export single record:
de: Einzelnen Datensatz exportieren:

# makeconfig_record
source: Record:
de: Datensatz:

# makeconfig_exportTablesFromPages
source: Export tables from pages:
de: Tabellen von Seiten exportieren:

# makeconfig_tablePids
source: Table/Pids:
de: Tabellen/PIDs:

# makeconfig_relationsAndExclusions
source: Relations and Exclusions:
de: Relationen und Ausschlüsse:

# makeconfig_includeRelationsToTables
source: Include relations to tables:
de: Relationen zu Tabellen einschließen:

# makeconfig_useStaticRelationsFor
source: Use static relations for tables:
de: Statische Relationen von Tabellen verwenden:

# makeconfig_showStaticRelations
source: Show static relations:
de: Statische Relationen anzeigen:

# makeconfig_excludeElements
source: Exclude elements:
de: Elemente ausschließen:

# makeconfig_clearAllExclusions
source: Clear all exclusions:
de: Alle Ausschlüsse zurücksetzen:

# makeconfig_noExcludedElementsYet
source: No excluded elements yet. Exclude by setting checkboxes below in the element display.
de: Bis jetzt noch keine Ausschlüsse. Markieren Sie auszuschließende in der folgenden Übersicht.

# makeadvanc_update
source: Update
de: Aktualisieren

# makeadvanc_excludeHtmlCssFile
source: Exclude HTML/CSS file resources:
de: HTML/CSS-Dateien ausschließen:

# makeadvanc_extensionDependencies
source: Extension dependencies:
de: Abhängigkeiten von Erweiterungen:

# makeadvanc_selectExtensionsThatThe
source: Select extensions that the exported content depends on:
de: Erweiterungen auswählen, von denen der exportierte Inhalt abhängig ist:

# makesavefo_update
source: Update
de: Aktualisieren

# makesavefo_presets
source: Presets:
de: Voreinstellungen:

# makesavefo_selectPreset
source: Select preset:
de: Voreinstellung laden:

# makesavefo_load
source: Load
de: Laden

# makesavefo_save
source: Save
de: Speichern

# makesavefo_areYouSure
source: Are you sure?
de: Vorgang tatsächlich fortführen?

# makesavefo_delete
source: Delete
de: Löschen

# makesavefo_merge
source: Merge
de: Zusammenführen

# makesavefo_titleOfNewPreset
source: Title of new preset:
de: Name der neuen Voreinstellung:

# makesavefo_public
source: Public:
de: Öffentlich:

# makesavefo_outputOptions
source: Output options:
de: Ausgabeoptionen:

# makesavefo_metaData
source: Meta data:
de: Metadaten:

# makesavefo_title
source: Title:
de: Titel:

# makesavefo_description
source: Description:
de: Beschreibung:

# makesavefo_notes
source: Notes:
de: Anmerkungen:

# makesavefo_thumbnail
source: Thumbnail:
de: Vorschaubild:

# makesavefo_uploadThumbnail
source: Upload thumbnail:
de: Vorschaubild hochladen:

# makesavefo_t3dFileCompressed
source: T3D file / compressed
de: T3D-Datei/komprimiert

# makesavefo_t3dFile
source: T3D file
de: T3D-Datei

# makesavefo_fileFormat
source: File format:
de: Dateiformat:

# makesavefo_maxSizeOfFiles
source: Max size of files to include (kb):
de: Größenbeschränkung (kB) für Dateien:

# makesavefo_filenameSavedInS
source: Filename (saved in "%s"):
de: Dateiname (gespeichert in "%s"):

# makesavefo_downloadExport
source: Download export
de: Exportdatei herunterladen

# importdata_saveToFilename
source: Save to filename
de: Speichern unter

# importdata_selectFileToImport
source: Select file to import:
de: Importdatei auswählen:

# importdata_file
source: File:
de: Datei:

# importdata_fromPathS
source: (From path: %s)
de: (Aus Pfad: %s)

# importdata_noteNoDecompressorAvailable
source: NOTE: No decompressor available for compressed files!
de: ACHTUNG: Kein Entpackprogramm für komprimierte Dateien vorhanden!

# importdata_importOptions
source: Import Options:
de: Importeinstellungen:

# importdata_update
source: Update:
de: Aktualisierung:

# importdata_updateRecords
source: Update records
de: Datensätze aktualisieren

# importdata_thisOptionRequiresThat
source: This option requires that the structure you import already exists on this server and only needs to be updated with new content!
de: Diese Option verlangt, dass die zu importierende Struktur bereits auf dem Server existiert und nur mit dem neuen Inhalt aktualisiert werden soll!

# importdata_ignorePidDifferencesGlobally
source: Ignore PID differences globally
de: PID-Unterschiede generell ignorieren

# importdata_ifYouSetThis
source: If you set this option, the position of updated elements will not be updated to match the structure of the input file.
de: Mit dieser Option wird die Position aktualisierter Inhalte nicht mit der Struktur aus der Importdatei überschrieben.

# importdata_force_all_UIDS
source: Force ALL UIDs values
de: ALLE UID-Werte erzwingen

# importdata_force_all_UIDS_descr
source: With this option the original UID value of all imported records are forced to be the same. BE VERY CAREFUL WITH THIS! (Admin Only).
de: Mit dieser Option werden alle ursprünglichen UID-Werte der importierten Datensätze beim Import erzwungen. VERWENDEN SIE DIESE OPTION MIT VORSICHT! (Nur für Admins)

# importdata_options
source: Options:
de: Optionen:

# importdata_doNotShowDifferences
source: Do not show differences in records
de: Unterschiede in Datensätzen nicht anzeigen

# importdata_greenValuesAreFrom
source: Green values are from the import file, red values from the current database record and black values are similar in both versions.
de: Grüne Werte stammen aus der Importdatei, rote Werte aus dem aktuellen Datensatz und schwarze Werte sind in beiden gleich.

# importdata_allowToWriteBanned
source: Allow to write banned file extensions (eg. PHP scripts), if any
de: Verbotene Dateierweiterungen dennoch erlauben (z.B. PHP-Skripte)

# importdata_action
source: Action:
de: Aktion:

# importdata_preview
source: Preview
de: Vorschau

# importdata_update_299e
source: Update
de: Aktualisierung

# importdata_areYouSure
source: Are you sure?
de: Vorgang tatsächlich fortführen?

# importdata_newImport
source: New import
de: Neuer Import

# importdata_enableLogging
source: Enable logging:
de: Protokollierung einschalten:

# importdata_writeIndividualDbActions
source: Write individual DB actions during import to the log
de: Alle während des Importvorgangs auftretenden Datenbankaktionen aufzeichnen

# importdata_thisIsDisabledBy
source: This is disabled by default since there may be hundred of entries generated.
de: Diese Option ist standardmäßig deaktiviert, weil unter Umständen hunderte Einträge erzeugt werden.

# importdata_uploadFileFromLocal
source: Upload file from local computer:
de: Importdatei übertragen:

# importdata_browse
source: Browse:
de: Durchsuchen:

# importdata_uploadStatus
source: Upload status:
de: Status Hochladen:

# importdata_success
source: Success:
de: Erfolg:

# importdata_failureNoFileUploaded
source: Failure: No file uploaded - was it too big? Check system log.
de: Fehler: Es wurde keine Datei übertragen! (Datei zu groß?) Weitere Angaben in Systemprotokoll.

# importdata_upload
source: Upload
de: Hochladen

# importdata_metaData
source: Meta data:
de: Metadaten:

# importdata_title
source: Title:
de: Titel:

# importdata_description
source: Description:
de: Beschreibung:

# importdata_notes
source: Notes:
de: Anmerkungen:

# importdata_packager
source: Packager:
de: Packprogramm:

# importdata_icon
source: Icon:
de: Symbol:

# importdata_metaData_1387
source: Meta data
de: Metadaten

# importdata_messages
source: Messages
de: Meldungen

# importdata_structureHasBeenImported
source: Structure has been imported, here is the result:
de: Folgende Struktur wurde importiert:

# filterpage_structureToBeImported
source: Structure to be imported:
de: Zu importierende Struktur:

source: ALL tables
de: ALLE Tabellen

# impexpcore_displaycon_controls
source: Controls:
de: Steuerung:

# impexpcore_displaycon_title
source: Title:
de: Titel:

# impexpcore_displaycon_size
source: Size:
de: Größe:

# impexpcore_displaycon_message
source: Message:
de: Meldungen:

# impexpcore_displaycon_updateMode
source: Update Mode:
de: Aktualisierungsmodus:

# impexpcore_displaycon_currentPath
source: Current Path:
de: Derzeitiger Pfad:

# impexpcore_displaycon_result
source: Result:
de: Ergebnis:

# impexpcore_displaycon_insidePagetree
source: Inside pagetree:
de: Innerhalb des Seitenbaumes:

# impexpcore_singlereco_outsidePagetree
source: Outside pagetree:
de: Außerhalb des Seitenbaumes:

# impexpcore_singlereco_softReferencesFiles
source: Soft References Files:
de: Soft References - Dateien:

# impexpcore_singlereco_update
source: Update
de: Aktualisieren

# impexpcore_singlereco_insert
source: Insert
de: Einfügen

# impexpcore_singlereco_importAsNew
source: Import as new
de: Als neu importieren

# impexpcore_singlereco_ignorePid
source: Ignore PID
de: PID ignorieren

# impexpcore_singlereco_respectPid
source: Respect PID
de: PID beachten

# impexpcore_singlereco_forceUidSAdmin
source: Force UID [%s] (Admin)
de: UID [%s] erzwingen (Admin)

# impexpcore_singlereco_exclude
source: Exclude
de: Ausschließen

# impexpcore_singlereco_title
source: Title:
de: Titel:

# impexpcore_singlereco_descr
source: Descr:
de: Beschreibung:

# impexpcore_singlereco_filename
source: Filename:
de: Dateiname:

# impexpcore_singlereco_value
source: Value:
de: Wert:

# impexpcore_softrefsel_record
source: Record:
de: Datensatz:

# impexpcore_softrefsel_editable
source: Editable
de: Editierbar

# impexpcore_softrefsel_exclude
source: Exclude
de: Ausschließen

# impexpcore_printerror_description
source: Description:
de: Beschreibung:
