Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/setup/*.locallang_csh_mod.xlf
Languages: de

# simuser.description
source: This option allows "admin"-users to change settings for another backend user in the system.
de: Mit dieser Option können Admin-Benutzer einen bestimmten Backend-Benutzer simulieren. Das Backend wird mit den Einstellungen des ausgewählten Benutzers neugeladen und der Administrator kann Systemeinstellungen des Benutzers überprüfen.

# option_enableInstallTool.alttitle
source: Admin control for re-enabling Install Tool access
de: Administratorwerkzeug zum Reaktivieren des Zugriffs auf das Installationsprogramm.

# option_enableInstallTool.description
source: By clicking this button, a file typo3conf/ENABLE_INSTALL_TOOL is created (or removed if it already exists). It unlocks the access to the Install Tool (password is still needed!) and will be removed automatically after 1 hour.
de: Durch Anklicken dieser Schaltfläche wird eine Datei typo3conf/ENABLE_INSTALL_TOOL erstellt (oder entfernt, wenn sie bereits vorhanden ist). Dadurch wird die Sperre für den Zugriff auf das Installationsprogramm aufgehoben (Passwort ist nach wie vor erforderlich). Die Datei wird nach 1 Stunde automatisch wieder entfernt.
