Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/setup/*.locallang_csh_mod.xlf
Languages: de

# .alttitle
source: User > Setup module
de: Benutzer > Einstellungen

# .description
source: The Setup module allows the backend user to customize TYPO3 for his own login sessions. This includes the backend language and various other interface features.
de: Dieses Modul dient der Konfiguration Ihres TYPO3-Backend-Benutzerprofils. Hier können Sie Ihren Namen, Ihre E-Mail-Adresse, die benutzte Backend-Sprache und einige andere allgemeine Eigenschaften des Systems einstellen.

# .details
source: <b>Notice [For Admins]:</b> These settings can all be overridden or have their default values changed by "User TSconfig". To read more about this concept, see the link below!
de: <b>Anmerkung [für Administratoren]:</b> All diese Einstellungen können durch "Seiten-TSconfig"-Werte überschrieben oder durch Standardwerte vorbelegt werden. Klicken Sie auf untenstehenden Verweis, um mehr über dieses Konzept zu erfahren!

# .image_descr
source: The Setup module is selected in the left menu. This is how the Setup module interface looks like - a list of options to configure.
de: Das Menü Einstellungen befindet sich im Backend-Hauptmenü. Und so sieht das Menü aus - zahlreiche benutzerspezifische Einstellungen können hier vorgenommen werden.

# language.alttitle
source: Backend Language selection
de: Backend-Sprache

# language.description
source: Select the backend language you prefer. Most parts of TYPO3s backend (for regular users) are translated into other languages.
de: Wählen Sie hier Ihre bevorzugte Sprache.

# language.details
source: <b>Warning [technical]:</b> If TYPO3 is not configured to use a single character set (through $TYPO3_CONF_VARS[BE][forceCharset]) then all data entered in the backend is submitted in the character set of the selected backend language. This leads to inconsistent data storage if some users are using the backend in Russian and others in English which uses different character sets. The solution clearly is to set the configuration option mentioned above to a value like "utf-8". This must be done by the developers responsible for the whole system configuration.
de: <b>Warnung [Technik]:</b> Falls TYPO3 nicht durch die Option $TYPO3_CONF_VARS['BE']['forceCharset'] dahingehend konfiguriert wurde, nur einen einzigen Zeichensatz zu verwenden, werden alle BE-Benutzereingaben in der hier gewählten Backend-Sprache gespeichert. Das kann zu Dateninkonsistenz führen, wenn einige Benutzer zum Beispiel Russisch und andere Englisch benutzen (diese Sprachen benutzen unterschiedliche Zeichensätze). Die Lösung für dieses Problem liegt darin, mittels $TYPO3_CONF_VARS['BE']['forceCharset'] einen Wert wie z.B. "utf-8" (also einen Unicode Zeichensatz) einzustellen. Diese Einstellung muss durch den verantwortlichen TYPO3-Administrator vorgenommen werden.

# language.image_descr
source: TYPO3 is translated into around 40 languages. English is the default language and all labels must be available in English first and foremost. This screenshot shows translations for Hebrew, Arabic, Russian and Chinese.
de: TYPO3 wurde mittlerweile in mehr als 40 Sprachen übersetzt. Englisch ist aber die Standardsprache und <u>alle</u> Bezeichnungen müssen zuerst in Englisch verfügbar sein. Hier sehen Sie die hebräische, arabische, russische und chinesische Übersetzung.

# option_condensedMode.alttitle
source: Condensed Mode
de: Schmale Ansicht im Backend verwenden

# option_condensedMode.description
source: If set, the backend will not load the Web-submodules and File-submodules in a frameset but allow the page and folder trees to load the submodule in the main content frame. This allows for a better display on small screens.
de: Normalerweise werden Web- und Dateiuntermenüs im mittleren Frame dargestellt. Mit dieser Option können Sie dieses Verhalten ausschalten - die Untermenüs erscheinen dann im Haupt-Frame. Das sorgt für eine übersichtlichere Darstellung speziell bei niedrigen Bildschirmauflösungen.

# option_condensedMode.image_descr
source: In this example Condensed Mode is enabled. The page tree is <em>not</em> shown in the normal navigation frame but rather in the full content frame to the right of the menu. When a page title is clicked in the page tree the module page (here the Web > List module) will be loaded in the <u>same</u> frame of the backend. In this way Condensed Mode saves horizontal screen space since the navigation frame is removed - but it takes an extra click if you need to go to another page.
de: In diesem Beispiel ist die schmale Ansicht aktiviert. Der Seitenbaum wird nicht im mittleren Frame, sondern im Haupt-Frame dargestellt. Wenn Sie in der Seitenbaumansicht einen Seitentitel anklicken (hier im Modul Web > Liste) erscheint die gewählte Seite anschließend im gleichen Frame. Mit der schmalen Ansicht wird dadurch die Breite des Bildschirms besser ausgenutzt, indem das mittlere Navigationsmenü ausgeblendet wird - Sie brauchen allerdings auch einen Mausklick mehr, um zu anderen Seiten zu gelangen.

# option_noMenuMode.alttitle
source: Navigation Mode
de: TYPO3-Navigationsmenü

# option_noMenuMode.description
source: Setting alternative backend menu modes
de: Bestimmt die Darstellung des TYPO3-Navigationsmenüs

# option_noMenuMode.details
source: By default you navigate between backend modules with the menu in the left frame. By this option you can select alternative navigation modes: <b>Selectorbox in top frame:</b> If set, the backend will not load the left menu frame but rather put a selector-box menu in the topframe. This saves a lot of space on small screens. <b>Icons in top frame</b> This option shows all menu items in the top frame as a horizontal list of icons. This is for experienced users only who knows the order of modules and can recognize them based on their icon.
de: Normalerweise wird das TYPO3-Navigationsmenü (das Hauptmenü) am linken Fensterrand angezeigt. Es existieren aber noch zwei weitere Darstellungsarten, welche Sie hier auswählen können: <b>Auswahlbox im oberen Frame:</b> Alle Funktionen des TYPO3-Navigationsmenüs werden in einer Auswahlbox im oberen Frame dargestellt. Dadurch wird bei niedrigen Bildschirmauflösungen viel Platz gespart. <b>Symbole im oberen Frame:</b> Alle Funktionen des TYPO3-Navigationsmenüs werden durch ihre jeweiligen Symbole im oberen Frame dargestellt. Diese Art der Darstellung ist eigentlich nur erfahrenen Benutzern, welche die Reihenfolge der Funktionen und die Bedeutung der Symbole kennen, zu empfehlen.

# option_noMenuMode.image_descr
source: The "Selectorbox" menu. Selecting an item makes the backend jump to that module. The "Icons" menu. As you can see you will need to know the icons by heart. You can also position the mouse over the icon and the tool-tip text will reveal the module name.
de: Das "Auswahlfeld"-Menü. Wählen Sie einfach eine Funktion aus der Liste. Das "Symbol"-Menü. Wie Sie sehen: Sie müssen sich schon sehr gut mit TYPO3 auskennen, um die Funktionen anhand dieser Symbole zu erkennen. Wenn Sie mit der Maus über eines der Symbole fahren, erhalten Sie eine Kurzbeschreibung der entsprechenden Funktion eingeblendet.

# option_startModule.alttitle
source: Start module
de: Startmodul

# option_startModule.description
source: Let you select the module that is called when you login in the Backend The default module is "About Modules".
de: Legt das Modul fest, das beim Anmelden am Backend aufgerufen wird. Standard ist "Über Module".

# option_showThumbs.alttitle
source: Show Thumbnails by default
de: Vorschaubilder standardmäßig anzeigen

# option_showThumbs.description
source: In modules like the "Web > List" and "File > Filelist" you can enable the display of thumbnails of files (images/fonts) and records (if images are attached) with a checkbox. Setting this option will enable the display by default.
de: Innerhalb von Modulen wie "Web > Liste" oder "Datei > Dateiliste" können Sie sich kleine Vorschaubilder (Thumbnails) für Bilder, Schriftarten oder Datensätze mit angehängten Bildern anzeigen lassen. Diese Option aktiviert die Anzeige von Vorschaubildern standardmäßig.

# option_showThumbs.image_descr
source: When thumbnails display is enabled, files attached to records will be shown in the "Web > List" module like this.
de: Vorschaubildansicht innerhalb des Moduls "Web > Liste".

# option_helpText.alttitle
source: Show help text when applicable
de: Vorhandene Hilfetexte anzeigen

# option_helpText.description
source: If set, some help texts will appear by default. Applies to the "Legend" text in the Web>Access module for instance.
de: Wenn diese Option gewählt wurde, werden zu den einzelnen Eingabefeldern oder Schaltern Hilfetexte eingeblendet.

# option_maxTitleLen.alttitle
source: Maximum title length
de: Maximale Titellänge

# option_maxTitleLen.description
source: TYPO3 will often crop long titles of records etc. so only the first X characters are shown. Often the number of shown characters depends on this variable. For instance the length of page titles in the page tree is determined by this value.
de: TYPO3 kürzt innerhalb des Backends oftmals überlange Seitenüberschriften oder Datensatztitel, so dass nur die ersten Zeichen angezeigt werden. Die Anzahl der angezeigten Zeichen hängt dann von diesem Wert ab. So wird hiermit z.B. die Länge der Seitentitel im Seitenbaum festgelegt.

# option_maxTitleLen.image_descr
source: In this case the Maximum Title lenght is set to 10 - and the result is that titles in the page tree - as well as other places in the backend - will be cropped after 10 characters, then suffixed by "...". The default value is "30".
de: In diesem Fall wurde die "Maximale Titellänge" auf 10 Zeichen gesetzt. Dementsprechend werden Seitentitel im Seitenbaum und an anderen Stellen im Backend nach 10 Zeichen abgeschnitten und "..." angehängt. Der Standardwert liegt bei 30.

# option_copyLevels.alttitle
source: Recursive Copy
de: Rekursives Kopieren

# option_copyLevels.description
source: When you copy a page, subpages can also be copied along if you set this option. The number you set here defines the number of levels under a page to include in a copy operation.
de: Mit Hilfe dieser Option können Sie festlegen, dass beim Kopieren von Seiten deren Unterseiten ebenfalls einbezogen werden. Der hier festgelegte Wert bestimmt die Anzahl der Ebenen unterhalb der ausgewählten Seite, die beim Kopieren mit eingeschlossen werden sollen.

# option_recursiveDelete.alttitle
source: Recursive Delete
de: Rekursives Löschen

# option_recursiveDelete.description
source: You cannot delete a page with subpages unless this flag is set. Be careful - setting this option means that TYPO3 will allow a whole tree of pages to be deleted in one go!
de: Im Backend können Sie normalerweise keine Seiten löschen, zu denen noch Unterseiten existieren. Mit dieser Option können Sie dieses Verhalten deaktivieren. VORSICHT: Mit dieser Option können Sie - auch aus Versehen - eine ganze Website mit nur einem Mausklick löschen! Sie sollten daher genau überlegen, ob Sie diese Sicherheitsmaßnahme deaktivieren.

# option_recursiveDelete.details
source: You should also consider the performance issues involved when deleting a large page tree. It might take a considerable amount of time to do that and if PHP times out before the operation is finished the results might be unpredictable.
de: Wenn Sie vorhaben, einen großen Seitenbaum mit vielen Seiten zu löschen, sollten Sie sich über die Auswirkungen auf die Systemleistung im Klaren sein. Aufgrund der vielen benötigten Datenbankoperationen in so einem Fall könnte es durchaus sein, dass es in PHP noch vor Beendigung der Operation zu einem Timeout kommt. Dadurch kann es zu unvorhersehbaren Auswirkungen auf das System kommen!

# option_edit_wideDocument.alttitle
source: Wide document background
de: Breiten Hintergrund anzeigen

# option_edit_wideDocument.description
source: Setting this option will enlarge the default width of record editing forms in TYPO3 by around 50%
de: Mit dieser Option können Sie die TYPO3-Eingabeformulare um rund 50% verbreitern.

# option_edit_RTE.alttitle
source: Enable Rich Text Editor
de: Rich-Text-Editor (RTE) verwenden (falls verfügbar)

# option_edit_RTE.description
source: If set, the Rich Text Editor in TYPO3 will be enabled for you. Normally you wouldn't want to disable this option.
de: Aktiviert für Ihre Benutzersitzungen den TYPO3-Rich-Text-Editor. Diese Option sollten Sie aktivieren.

# option_edit_RTE.details
source: A Rich Text Editor (RTE) means that a text editing field has buttons for making selected text bold, italic etc. Whether a RTE is available also depends on factors like the browser you are using and which extensions are installed. Finally RTEs are applied to only a few record fields. The most wellknown example would be the Text field of a Content Element.
de: Rich-Text-Editoren (RTE) ermöglichen es Ihnen, innerhalb von Eingabefeldern Textattribute (fett, kursiv, unterstrichen etc.) per Knopfdruck zu setzen - in etwa so, wie Sie es von Textverarbeitungsprogrammen gewohnt sind. Ob Sie einen RTE überhaupt benutzen können, hängt u.a. davon ab, ob innerhalb von TYPO3 eine RTE-Erweiterung installiert wurde und ob Ihr Browser diese darstellen kann. Der RTE wird nur bei einigen Eingabefeldern verwendet - das prominenteste Beispiel ist natürlich das Textfeld innerhalb eines Inhaltelements.

# option_edit_docModuleUpload.alttitle
source: Enable File Uploads in editing forms
de: Erlaube das Hochladen von Dateien in Eingabefeldern

# option_edit_docModuleUpload.description
source: This option will enable an "Upload" box for each field in TYPO3 records where you can attach a file or image. Most likely you don't want to disable this since it is usually just a nice thing to have.
de: Mit dieser Option aktivieren Sie das direkte Hochladen von Dateien für alle Backend-Eingabefelder, die Dateianhänge (Bilder, Dokumente etc.) als Eingabe erlauben. Normalerweise sollten Sie diese Option nicht deaktivieren, weil Sie eine sehr bequeme Möglichkeit bietet, Inhalte in TYPO3 einzupflegen.

# option_edit_docModuleUpload.details
source: If you disable the Upload box there is still the TYPO3 Element Browser left for attaching files and images.
de: Sie können immer noch den TYPO3-Dateibrowser dazu verwenden, Dateien oder Bilder anzuhängen, sollte diese Option deaktiviert sein.

# option_enableFlashUploader.alttitle
source: Enable Flash Uploader
de: Flash-Schnittstelle zum Hochladen aktivieren

# option_enableFlashUploader.description
source: This option will enable a flash-based uploader that allows you to select multiple files at once when uploading files. If you enable this option, make sure that your browser has the latest Flash plugin (Flash 9 or higher) installed in order to make this feature work.
de: Mit dieser Option lässt sich eine Flash-basierte Schnittstelle aktivieren, mit der mehrere Dateien auf einmal für das Hochladen ausgewählt werden können. Achten Sie darauf, dass Ihr Browser mit einem aktuellen Flash-Plug-In ausgerüstet ist (Flash 9 oder höher), damit die Funktion ordnungsgemäß funktioniert.

# option_edit_showFieldHelp.alttitle
source: Context Sensitive Help mode
de: Kontextabhängige Hilfe aktivieren

# option_resizeTextareas.alttitle
source: Make Textareas Resizable
de: Größe mehrzeiliger Textfelder anpassbar machen

# option_resizeTextareas.description
source: This option will make textareas resizable. You will see the resize mouse cursor if you move mouse to the outer border of textarea.
de: Mit dieser Option ist es möglich, mehrzeilige Textfelder in der Größe zu ändern. Wenn Sie den Mauszeiger auf den äußeren Rand eines solchen Feldes bewegen, wird ein Größenänderungs-Cursor angezeigt.

# option_resizeTextareas_MaxHeight.alttitle
source: Maximal Height of Textarea
de: Maximale Höhe für mehrzeilige Textfelder

# option_flexibleTextareas_MaxHeight.alttitle
source: Maximal Height of flexible textareas
de: Maximale Höhe für flexible Textfelder

# option_resizeTextareas_MaxHeight.description
source: Define the maximal height of textarea (in Pixel).
de: Legt die maximale Höhe mehrzeiliger Textfelder in Pixel fest.

# option_flexibleTextareas_MaxHeight.description
source: Define the maximal height of flexible textareas (in Pixel).
de: Legt die maximale Höhe mehrzeiliger Textfelder in Pixel fest.

# option_resizeTextareas_Flexible.alttitle
source: Make Textareas Flexible
de: Mehrzeilige Textfelder flexibel machen

# option_resizeTextareas_Flexible.description
source: This option will make textareas flexible. The height will grow automatically while typing. Limit is the maximal height set (default 600).
de: Mit dieser werden mehrzeilige Textfelder flexibel. Die Höhe passt sich automatisch bei der Eingabe an. Obergrenze ist die anderweitig festgelegte maximale Höhe (Standard 600 Pixel).

# option_edit_showFieldHelp.description
source: Defines the mode of Context Sensitive Help (CSH) in TYPO3. The default is that small help icons are shown everywhere a help item is available. You can click the icon and help will appear in a window for you.
de: Legt die Art der Darstellung der kontextabhängigen Hilfe innerhalb von TYPO3 fest. Normalerweise werden Hilfesymbole (in Form kleiner Fragezeichen) neben denjenigen Optionen angezeigt, zu denen Hilfetexte verfügbar sind. Sobald Sie auf eines dieser Symbole klicken, öffnet sich ein Hilfefenster.

# option_edit_showFieldHelp.details
source: Alternatively you can select that descriptions are shown inline. This is useful for people who are still learning how TYPO3 works and want to browse the backend with descriptions shown directly. Finally experienced users will want to totally disable the help icons if they seem to just bloat the backend interface. Context Sensitive Help is also available as a full user manual in the Help>Manual module.
de: Sie können mit dieser Option festlegen, dass anstelle der Hilfesymbole die Kurzform der zugehörigen Hilfetexte direkt auf allen Seiten angezeigt werden. Für TYPO3-Neulinge kann es sehr hilfreich sein, wenn Sie jederzeit eine Beschreibung der Funktionen vor sich haben. Erfahrene Benutzer hingegen schalten häufig die kontextabhängige Hilfe völlig aus. Die kontextabhängige Hilfe ist außerdem in Form eines vollständigen Benutzerhandbuchs innerhalb des Moduls Hilfe > Handbuch verfügbar.

# option_edit_showFieldHelp.image_descr
source: The default mode, "Display help icon only", will show the help icons with no additional text. When "Display full text message" is selected you will see a short description shown together with the help icon and framed into a box. Clicking the help icon always links to the full description of the element shown in a pop-up window.
de: Standardmäßig ist die Option "Nur Hilfesymbole anzeigen" gesetzt; Sie erhalten die zugehörigen Hilfetexte dann durch einen Klick auf das Hilfesymbol. Mit der Option "Kompletten Text anzeigen" erscheinen die Kurzformen der jeweiligen Hilfetexte in eingerahmten Kästchen. Auch hier öffnet sich ein Hilfefenster mit der Langform des Hilfetextes, sobald sie das Hilfesymbol anklicken.

# option_disableCMlayers.alttitle
source: Disable Popup Context Menus
de: Deaktiviere Popup-Kontextmenüs

# option_disableCMlayers.description
source: When an icon for a file or database record is shown inside the TYPO3 backend you can often click on the icon and a contextual menu will appear over the icon with options related to it. You can disable this behaviour by this option. However you probably don't want to do that.
de: Durch Anklicken der Symbole, die oft innerhalb des Backends neben einem Dateinamen oder Datensatz angezeigt werden, lässt sich ein Kontextmenü (Klickmenü) öffnen. Dieses Verhalten lässt sich mit dieser Option abschalten (nicht empfohlen).

# option_disableCMlayers.image_descr
source: This is the context menu (or "Clickmenu") of a page in the page tree. Notice that it is activated by a regular "left-click" opposite to the normal "right-click" activation known from most Operating Systems.
de: Das ist das Kontextmenü (oder "Klickmenü") eines Datensatzes innerhalb des Seitenbaumes. Bitte beachten Sie, dass TYPO3 eine Web-Anwendung ist, welche innerhalb eines Browsers dargestellt wird. Das bedeutet, dass der normale Rechtsklick, wie Sie ihn von anderen Betriebssystemen und Programmen her kennen, hier nicht funktioniert (ein Rechtsklick öffnet vielmehr das Kontextmenü des Browsers). Stattdessen müssen Sie das Symbol mit der linken Maustaste anklicken, um das Menü zu aktivieren.

# option_beUser_realName.alttitle
source: Your real name
de: Ihr Name

# option_beUser_realName.description
source: Enter your real name here.
de: Geben Sie hier Ihren Namen ein.

# option_beUser_email.alttitle
source: Your email address
de: Ihre E-Mail-Adresse

# option_beUser_email.description
source: Make sure this is a valid email address for you. This is the contact address that the backend administrator will use if he needs to contact you. Also, the TYPO3 system might need to send you messages at various times and this will be the recipient address.
de: Stellen Sie sicher, dass die hier angegebene E-Mail-Adresse gültig ist. Ihr Administrator kann diese Adresse benutzen, um mit Ihnen Kontakt aufzunehmen. Außerdem nutzt TYPO3 sie, wenn das System Ihnen Nachrichten schicken soll.

# option_emailMeAtLogin.alttitle
source: Notify by login
de: Unterrichte mich per E-Mail, wenn sich jemand mit meinem Benutzernamen anmeldet

# option_emailMeAtLogin.description
source: If you set this option you will receive an email from TYPO3 each time you (or "someone") logs in using your username. You might like to receive such a "warning" as a security measure so you will know if someone else picks up your password and uses your account.
de: Mit dieser Option können Sie festlegen, dass jede Anmeldung unter Ihrem Benutzernamen per E-Mail an Sie gemeldet wird. Mit dieser Sicherheitsmaßnahme können Sie überprüfen, ob jemand anderes in Besitz Ihres Passworts gelangt ist und Ihren Benutzernamen missbraucht.

# option_newPassword.alttitle
source: Change password
de: Neues Passwort

# option_newPassword.description
source: Enter a new password for your backend account:
de: Geben Sie ein neues Passwort für Ihren Backend-Benutzer ein.

# option_newPassword.details
source: The passwords are encrypted to an MD5 hash when you leave the field so no plain text password is sent over the wire.
de: Passwörter werden verschlüsselt (als MD5-Hash), sobald Sie dieses Eingabefeld verlassen. Damit wird sichergestellt, dass keinerlei Klartextpasswörter über das Internet gesendet werden.

# option_newPasswordAgain.alttitle
source: Change password, confirm
de: Neues Passwort (Wiederholung)

# option_newPasswordAgain.description
source: Confirm the new password by entering it again, exactly like above. If the two new passwords do not match, the password will not be changed.
de: Wiederholen Sie Ihr neues Passwort. Sollten die beiden Passwörter nicht übereinstimmen, so wird Ihr Passwort nicht geändert.

# reset.alttitle
source: Reset all Values to default
de: Alle Angaben auf den Standardwert zurücksetzen

# reset.description
source: If you select this option all settings in this module will be reset to the default settings of the system.
de: Mit dieser Option können Sie alle Werte innerhalb dieses Moduls auf ihre Standardwerte zurücksetzen.

# reset.details
source: This does not apply to user name, email and password settings of course.
de: Nicht verändert werden Ihr Benutzername, Ihre E-Mail-Adresse und Ihr Passwort.

# simuser.alttitle
source: Simulate backend user
de: Simuliere Backend-Benutzer
