Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/felogin/pi1/*.locallang.xlf
Languages: de

# ll_welcome_header
source: User login
de: Benutzeranmeldung

# ll_welcome_message
source: Enter your username and password here in order to log in on the website:
de: Geben Sie Ihren Benutzernamen und Ihr Passwort ein, um sich an der Website anzumelden:

# ll_logout_header
source: You have logged out.
de: Sie haben sich abgemeldet.

# ll_logout_message
source: You just logged out from your user session on this website. You can login again or as another user by the form below.
de: Sie haben sich von dieser Website abgemeldet. Sie können sich erneut, auch als ein anderer Benutzer, mit dem unten angezeigten Formular anmelden.

# ll_error_header
source: Login failure
de: Anmeldefehler

# ll_error_message
source: An error occurred during login. Most likely you didn't enter the username or password correctly. Be certain that you enter them precisely as they are, including upper/lower case. Another possibility is that cookies might be disabled in your web browser.
de: Während der Anmeldung ist ein Fehler aufgetreten. Wahrscheinlich haben Sie Ihren Benutzernamen oder das Passwort falsch eingegeben. Vergewissern Sie sich, dass Sie beide Angaben korrekt eingegeben haben - Groß-/Kleinschreibung wird unterschieden. Eine andere Möglichkeit ist, dass Sie eventuell die Cookies in Ihrem Web-Browser deaktiviert haben.

# ll_success_header
source: Login successful
de: Anmeldung erfolgreich

# ll_success_message
source: You are now logged in as '###USER###'
de: Sie sind nun angemeldet als '###USER###'.

# ll_status_header
source: Current status
de: Aktueller Status

# ll_status_message
source: This is your current status:
de: Das ist Ihr aktueller Status:

# cookie_warning
source: Warning: There is a possibility that cookies are not enabled in your web browser! If your login disappears on your next click that is the case and you should enable cookies (or accept cookies from this website) immediately!
de: Warnung: Es besteht die Möglichkeit, dass in Ihrem Browser Cookies deaktiviert sind! Sollte trotz erfolgreicher Anmeldung beim nächsten Klick wieder die Anmeldeseite erscheinen, so sind Cookies deaktiviert. Sie sollten daher umgehend Cookies akzeptieren, entweder generell für alle Websites oder nur für diese spezielle.

source: Username:
de: Benutzername:

source: Password:
de: Passwort:

source: Login
de: Anmelden

# permalogin
source: Stay logged in:
de: Angemeldet bleiben:

source: Logout
de: Abmelden

source: Send password
de: Passwort senden

source: Reset Password
de: Passwort zurücksetzen

# ll_change_password_header
source: Change your password
de: Passwort ändern

# ll_change_password_message
source: Please enter your new password twice. Password needs a minimum length of %s chars.
de: Das neue Passwort bitte zweimal eingeben. Es ist eine Mindestlänge von %s Zeichen erforderlich.

# ll_change_password_nolinkprefix_message
source: Error: there is no prefix for the link. Please set one of the following in your typoscript template: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRelPrefix = http://yourdomain/
de: Fehler: Kein Präfix für Link. Bitte eine der folgenden Eigenschaften im TypoScript-Template definieren: plugin.tx_felogin_pi1.feloginBaseURL = http://ihredomaene/, config.baseURL = http://ihredomaene/, config.absRelPrefix = http://ihredomaene/

# ll_change_password_notvalid_message
source: The link you clicked is not valid. Please repeat the forgot message procedure.
de: Der angeklickte Link ist ungültig. Den Vorgang für vergessene Passwörter bitte erneut durchführen.

# ll_change_password_notequal_message
source: The passwords are not equal, please enter your new password twice. Password needs a minimum length of %s chars.
de: Die Passwörter stimmen nicht überein. Das neue Passwort bitte zweimal eingeben. Es ist eine Mindestlänge von %s Zeichen erforderlich.

# ll_change_password_tooshort_message
source: The password length is too short. Please enter your new password twice. Password needs a minimum length of %s chars.
de: Das Passwort ist zu kurz. Das neue Passwort bitte zweimal eingeben. Es ist eine Mindestlänge von %s Zeichen erforderlich.

# ll_change_password_done_message
source: Your password has been saved. You can now login with your new password.
de: Das Passwort wurde gespeichert. Sie können sich nun mit dem neuen Passwort anmelden.

# change_password
source: Change your password
de: Passwort ändern

# newpassword_label1
source: Enter new password
de: Neues Passwort eingeben

# newpassword_label2
source: Repeat new password
de: Neues Passwort wiederholen

source: Your email:
de: Ihre E-Mail-Adresse:

# ll_forgot_header
source: Forgot your password?
de: Kennwort vergessen?

# ll_forgot_email_password
source: Your password Hi %s Your username is "%s" Your password is "%s"
de: Ihr Passwort Hallo %s, Ihr Benutzername lautet "%s". Ihr Passwort ist "%s".

# ll_forgot_email_nopassword
source: Your password Hi %s We couldn't find a username for this email address and so cannot send the password to you. Probably you misspelled the email address (upper/lower case makes a difference) or maybe you even didn't register yet?
de: Ihr Passwort Hallo %s, wir konnten keinen Benutzernamen für diese E-Mail-Adresse in unserer Datenbank finden. Aus diesem Grund können wir Ihnen kein Passwort zusenden. Vielleicht haben Sie Ihre E-Mail-Adresse fehlerhaft eingegeben (Groß-/Kleinschreibung wird unterschieden!) oder haben Sie sich noch nicht registriert?

# ll_forgot_validate_reset_password
source: Your new password Dear %s, This email was sent in response to your request to reset your password. Please click on the link below. %s For security reasons, this link is only active until %s. If you do not visit the link before then, you will need to repeat the password reset steps.
de: Ihr neues Passwort Hallo %s, Sie erhalten diese Nachricht, da Sie Ihr Passwort zurücksetzen lassen wollen. Zur Bestätigung bitte nachstehenden Link aufrufen: %s Aus Sicherheitsgründen ist dieser Link nur bis %s aktiv. Falls Sie den Link nicht bis dahin aufgerufen haben, müssen Sie die Schritte zum Zurücksetzen des Passworts wiederholen.

# ll_forgot_message
source: Please enter the email address by which you registered your user account. Then press "Send password" and your password will immediately be emailed to you. Make sure to spell your email address correctly.
de: Bitte geben Sie die E-Mail-Adresse ein, mit der Sie sich registriert haben. Anschließend klicken Sie auf "Passwort senden" und Ihr Passwort wird Ihnen umgehend zugesandt. Achten Sie auf die korrekte Schreibweise Ihrer E-Mail-Adresse.

# ll_forgot_message_emailSent
source: Your password has now been sent to the email address %s
de: Ihr Passwort wurde an die E-Mail-Adresse %s versandt.

# ll_forgot_reset_message
source: Please enter your username or email address. Instructions for resetting the password will be immediately emailed to you.
de: Bitte den Benutzernamen oder die E-Mail-Adresse eingeben. Sie erhalten dann umgehend Anweisungen zum Zurücksetzen des Passworts zugesandt.

# ll_forgot_reset_message_emailSent
source: An email has been sent to the address stored in your account and contains a link to reset your password. If you do not receive an email, your account or email address was not found.
de: Es wurde eine E-Mail mit einem Link zum Zurücksetzen des Passworts an die in Ihrem Benutzerkonto gespeicherte E-Mail-Adresse geschickt. Sollten Sie keine E-Mail erhalten, wurde Ihr Konto oder die E-Mail-Adresse nicht gefunden.

# ll_forgot_header_backToLogin
source: Return to login form
de: Zurück zum Anmeldeformular

# ll_enter_your_data
source: Username or email address:
de: Benutzername oder E-Mail-Adresse:

# noValidRedirectUrl
source: Url "%s" for redirect was not accepted!
de: Die URL "%s" wurde nicht als Weiterleitung akzeptiert!

# xssAttackDetected
source: Url "%s" contained an XSS attack and was cleaned!
de: Die URL "%s" enthielt einen XSS-Angriff und wurde bereinigt!
