Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/*.locallang_msg.xlf
Languages: de

source: Path
de: Pfad

# TEXT_MODE
source: You are in TEXT MODE. Use the [<>] button to switch back to WYSIWYG.
de: Sie befinden sich im TEXT-MODUS. Benutzen Sie die Schaltfläche [<>], um zurück in den WYSIWYG-Modus zu wechseln.

# ActiveX-required
source: Loading the editor in Internet Explorer requires the execution of ActiveX controls to be enabled.
de: Wenn Sie den Editor innerhalb des Internet Explorers verwenden wollen, müssen Sie ActiveX-Controls zulassen.

# HTML-document-not-well-formed
source: The HTML document is not well-formed.
de: Das HTML-Dokument ist nicht wohlgeformt.

# Moz-Clipboard
source: Unprivileged scripts cannot access Cut/Copy/Paste programatically for security reasons. Click YES to see a technical note at mozilla.org which shows you how to allow a script to access the clipboard.
de: Unprivilegierte Skripte können aus Sicherheitsgründen Ausschneiden/Kopieren/Einfügen nicht nutzen. Klicken Sie auf Ja, um einen technischen Hinweis von mozilla.org (auf englisch) zu lesen, der Ihnen zeigt, wie Sie Skripten den Zugriff auf die Zwischenablage ermöglichen.

# Moz-Extension
source: For security reasons, unprivileged applications cannot access the clipboard. Click YES to install a component that will enable applications from this site to access the clipboard and perform copy, cut and paste operations.
de: Aus Sicherheitsgründen dürfen unprivilegierte Applikationen nicht auf die Zwischenablage zugreifen. Klicken Sie auf Ja, um eine Komponente zu installieren, die Programmen dieser TYPO3-Site erlaubt, auf die Zwischenablage zuzugreifen und Kopieren, Ausschneiden und Einfügen zu verwenden.

# Moz-Extension-Success
source: The installation was successful. You need to exit and restart your browser for the change to take effect.
de: Die Installation war erfolgreich. Sie müssen Ihren Browser verlassen und erneut starten, damit die Änderungen wirksam werden.

# Moz-Extension-Failure
source: Sorry, Firefox Add-on AllowClipboard Helper could not be installed.
de: Das Firefox Add-on "AllowClipboard Helper" konnte nicht installiert werden.

# Moz-Extension-Install-Not-Enabled
source: The installation cannot be performed. Please change your browser preferences in order to allow installation of sofware from this site.
de: Die Installation kann nicht durchgeführt werden. Bitte ändern Sie Ihre Browser-Einstellungen so, dass eine Software-Installation von dieser TYPO3-Site zugelassen wird.

# Allow-Clipboard-Helper-Extension
source: For security reasons, unprivileged applications cannot access the clipboard. Click YES to install a component that will enable you to specify the sites or pages that will be allowed to access the clipboard and perform copy, cut and paste operations.
de: Aus Sicherheitsgründen dürfen unprivilegierte Applikationen nicht auf die Zwischenablage zugreifen. Klicken Sie auf OK, um eine Komponente zu installieren, mit der Sie die Websites angeben können, die Zugriff auf die Zwischenablage erhalten sollen und Inhalte kopieren, ausschneiden und einfügen dürfen.

# Mozilla-Org-Install-Not-Enabled
source: The installation cannot be performed. Please change your browser preferences in order to allow installation of sofware from https://addons.mozilla.org.
de: Die Installation kann nicht durchgeführt werden. Bitte ändern Sie Ihre Browser-Einstellungen so, dass eine Software-Installation von der Site https://addons.mozilla.org zugelassen wird.

# Allow-Clipboard-Helper-Extension-Success
source: The installation was successful. You need to exit and restart your browser for the change to take effect. Afterwards, use the AllowClipboard Helper from the tools menu to allow specific sites to use the clipboard.
de: Die Installation war erfolgreich. Sie müssen Ihren Browser verlassen und erneut starten, damit die Änderungen wirksam werden. Wählen Sie dann in Ihrem Browser unter [Extras | AllowClipboard Helper] diejenigen Sites aus, denen der Zugriff auf die Zwischenablage gewährt werden soll.
