Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/tstemplate/ts/*.locallang.xlf
Languages: de

# moduleTitle
source: Template tools
de: Template-Werkzeuge

source: Template Analyzer
de: Template-Analyse

source: Constant Editor
de: Konstanten-Editor

source: Info/Modify
de: Info/Bearbeiten

# objectBrowser
source: TypoScript Object Browser
de: TypoScript-Objekt-Browser

# viewTemplates
source: Viewing templates of
de: Anzeige der Templates von

source: Page name
de: Seitenname

source: # Templates
de: Anzahl Templates

source: Is Root?
de: Ist Anfang der Website

source: Is Ext?
de: Ist Erweiterung

# overview
source: This is an overview of the pages in the database containing one or more template records. Click a page title to go to the page.
de: Dies ist ein Überblick über die Seiten in der Datenbank, die ein oder mehrere Templates enthalten. Klicken Sie auf einen Seitentitel, um zu der Seite zu gehen.

# areYouSure
source: Are you sure you want to do this?
de: Vorgang tatsächlich durchführen?

source: No template
de: Kein Template

# noTemplateDescription
source: There was no template on this page!
de: Es gibt kein Template auf dieser Seite!

# createTemplate
source: Create a template record first in order to edit constants!
de: Erstellen Sie zuerst ein Template, um die Konstanten zu bearbeiten!

# createTemplateToEditConfiguration
source: You need to create a template record below in order to edit your configuration.
de: Sie müssen unten ein Template erstellen, um Ihre Konfiguration zu bearbeiten.

# newWebsite
source: Create new website
de: Neue Website erstellen

# newWebsiteDescription
source: If you want this page to be the root of a new website, optionally based on one of the standard templates, then press the button below:
de: Wenn diese Seite die Wurzel einer neuen Website sein soll, klicken Sie auf die Schaltfläche unten. Sie können optional ein Standard-Template als Grundlage auswählen:

# newWebsiteAction
source: Create template for a new site
de: Template für neue Website erstellen

# extTemplate
source: Create extension template
de: Erweiterungs-Template erstellen

# extTemplateDescription
source: An extension template allows you to enter TypoScript values that will affect only this page and subpages.
de: Ein Erweiterungs-Template erlaubt Ihnen, TypoScript-Werte anzugeben, die nur diese Seite und deren Unterseiten betreffen.

# extTemplateAction
source: Click here to create an extension template.
de: Klicken Sie hier, um ein Erweiterungs-Template zu erstellen.

# goToClosest
source: Go to closest page with template
de: Zur nächsten Seite mit Template gehen

# goToClosestDescription
source: Closest template is on page '%s' (uid %s).
de: Das nächste Template ist auf der Seite '%s' (UID %s).

# goToClosestAction
source: Click here to go.
de: Klicken Sie hier, um dieses Template anzuzeigen.

# titleNewSiteStandard
source: NEW SITE, based on standard
de: NEUE WEBSITE, basierend auf Standard

# titleNewSite
source: NEW SITE
de: NEUE WEBSITE
