Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/info_pagetsconfig/*.locallang.xlf
Languages: de

# tsconf_title
source: Page TSconfig
de: Seiten-TSconfig

# tsconf_parts_0
source: All
de: Alles

# tsconf_parts_1
source: Module key ('mod') with overruling user settings
de: Modulschlüssel ("mod") mit Überschreibungen der Benutzereinstellungen

# tsconf_parts_1a
source: Module: Web>Page
de: Modul: Web > Seite

# tsconf_parts_1b
source: Module: Web>View
de: Modul: Web > Anzeigen

# tsconf_parts_1c
source: Module: Web>Modules
de: Modul: Web > Module

# tsconf_parts_1d
source: Module: Web>List
de: Modul: Web > Liste

# tsconf_parts_1e
source: Module: Web>Info
de: Modul: Web > Info

# tsconf_parts_1f
source: Module: Web>Func
de: Modul: Web > Funktionen

# tsconf_parts_1g
source: Module: Web>Template
de: Modul: Web > Vorlage

# tsconf_configFields
source: View TSconfig fields content
de: Inhalt des TSconfig-Felds anzeigen

# editThisColumn
source: Edit the field '%s' for all listed pages
de: Feld "%s" für alle aufgelisteten Seiten bearbeiten

# editTSconfig
source: Edit TSconfig for this page
de: Inhalt des TSconfig-Felds dieser Seite bearbeiten

# editTSconfig_all
source: Edit TSconfig for all shown pages
de: Inhalt des TSconfig-Felds aller angezeigter Seiten bearbeiten

# editTSconfig_default
source: Default Configuration from TYPO3_CONF_VARS
de: Standardkonfiguration aus TYPO3_CONF_VARS

# mod_pagetsconfig
source: Page TSconfig
de: Seiten-TSconfig

# sort_alphabetic
source: Sort alphabetically:
de: Alphabetisch sortieren:
