Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/InlineElements/*.locallang.xlf
Languages: de

# No markup
source: No text format
de: Kein Textformat

# Remove markup
source: Remove text format
de: Textformat entfernen

# FormatText-Tooltip
source: Apply format to selected text
de: Format auf markierten Text anwenden

# BiDiOverride-Tooltip
source: Bidirectionality override
de: Bidirektionalität übersteuern

# Big-Tooltip
source: Large text
de: Großer Text

# Bold-Tooltip
source: Bold
de: Fett

# Citation-Tooltip
source: Citation
de: Zitatquelle

# Code-Tooltip
source: Computer code fragment
de: Ausschnitt aus Computer-Code

# Code-contextMenuTitle
source: Code fragment
de: Codeausschnitt

# DeletedText-Tooltip
source: Deleted text
de: Gelöschter Text

# Emphasis-Tooltip
source: Emphasis
de: Betonung

# Keyboard-Tooltip
source: Text to be entered by the user
de: Vom Benutzer einzugebender Text

# Keyboard-contextMenuTitle
source: Text to enter
de: Einzugebender Text

# InsertedText-Tooltip
source: Inserted text
de: Eingefügter Text

# Italic-Tooltip
source: Italic
de: Kursiv

# MonoSpaced-Tooltip
source: Monospaced text
de: Text in dicktengleicher Schrift

# Quotation-Tooltip
source: Short inline quotation
de: Kurzes Zitat

# Quotation-contextMenuTitle
source: Short quotation
de: Kurzes Zitat

# Sample-Tooltip
source: Sample program output or script
de: Beispielausgabe eines Programms oder Skript

# Sample-contextMenuTitle
source: Sample output
de: Beispielausgabe

# Small-Tooltip
source: Small text
de: Kleiner Text

# Span-Tooltip
source: Style container
de: Stilbehälter

# StrikeThrough-Tooltip
source: Strike-through text
de: Durchgestrichener Text

# Strong-Tooltip
source: Strong emphasis
de: Starke Betonung

# Subscript-Tooltip
source: Subscript
de: Tiefgestellt

# Superscript-Tooltip
source: Superscript
de: Hochgestellt

# Underline-Tooltip
source: Underline
de: Unterstrichen

# Variable-Tooltip
source: Variable or program argument
de: Variable oder Programmparameter
