Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/RemoveFormat/*.locallang.xlf
Languages: de

# RemoveFormatTooltip
source: Remove format
de: Formatierung entfernen

source: Cleaning Area
de: Bereich

# Selection
source: Selected text
de: Ausgewählter Text

source: All
de: Gesamt

# Remove formatting
source: Remove format
de: Formatierung entfernen

# Cleaning options
source: Type(s) of format to remove
de: Art der Formatierung(en), die entfernt werden soll(en)

# Formatting:
source: HTML Format:
de: HTML-Formatierung:

# MS Word Formatting:
source: MS Word Format:
de: MS-Word-Formatierung:

source: Typographical punctuation:
de: Typographische Zeichen:

# Spaces
source: Non-breaking spaces:
de: Geschützte Leerzeichen:

source: Images:
de: Bilder:

# All HTML:
source: All HTML tags:
de: Alle HTML-Tags:

# Select the type of formatting you wish to remove.
source: Select the type(s) of format to remove.
de: Wählen Sie die Art der Formatierung(en), die entfernt werden soll(en).

source: Cancel
de: Abbrechen
