Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/res/accessibilityicons/*.locallang.xlf
Languages: de

# external_link_altText
source: Opens external link in current window
de: Öffnet externen Link im aktuellen Fenster

# external_link_titleText
source: Opens external link in current window
de: Öffnet externen Link im aktuellen Fenster

# external_link_new_window_altText
source: Opens external link in new window
de: Öffnet externen Link in neuem Fenster

# external_link_new_window_titleText
source: Opens external link in new window
de: Öffnet externen Link in neuem Fenster

# internal_link_altText
source: Opens internal link in current window
de: Öffnet internen Link im aktuellen Fenster

# internal_link_titleText
source: Opens internal link in current window
de: Öffnet internen Link im aktuellen Fenster

# internal_link_new_window_altText
source: Opens internal link in new window
de: Öffnet internen Link in neuem Fenster

# internal_link_new_window_titleText
source: Opens internal link in new window
de: Öffnet internen Link in neuem Fenster

# download_altText
source: Initiates file download
de: Leitet Herunterladen der Datei ein

# download_titleText
source: Initiates file download
de: Leitet Herunterladen der Datei ein

# mail_altText
source: Opens window for sending email
de: Öffnet ein Fenster zum Versenden der E-Mail

# mail_titleText
source: Opens window for sending email
de: Öffnet ein Fenster zum Versenden der E-Mail
