Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/extensions/Language/*.locallang_csh.xlf
Languages: de

# .alttitle
source: htmlArea RTE > Language
de: htmlArea RTE > Sprache

# .description
source: The Language feature allows to edit the language and text direction attributes of an element in the RTE editing area.
de: Die Sprachfunktion erlaubt es, die Attribute für Sprache und Textrichtung eines Elements im RTE zu bearbeiten.

# .details
source: The following items may appear in the RTE toolbar: - a selector box that allows to assign the language of contents of an element; - two buttons that allow to set the direction of text; - another button that allows to make the language marks visible wittin the RTE editing area. The language selector box may also appear in some dialogues along with a text direction selector box.
de: Die folgenden Elemente können in der RTE-Werkzeugleiste erscheinen: - ein Auswahlfeld zum Zuweisen der Sprache zu Inhalten eines Elements; - zwei Schaltflächen zum Setzen der Textrichtung; - eine weitere Schaltfläche, um Sprachmarkierungen innerhalb der RTE-Arbeitsfläche sichtbar zu machen. Das Feld zur Auswahl der Sprache kann auch in anderen Dialogen zusammen mit der Auswahl der Textrichtung angezeigt werden.

# .image_descr
source: "Left to right" icon in the editor tool bar. "Right to left" icon in the editor tool bar. "Show language marks" icon in the editor tool bar.
de: "Links nach rechts"-Symbol in der Werkzeugleiste. "Rechts nach links"-Symbol in der Werkzeugleiste. "Zeige Sprachhinweise"-Symbol in der Werkzeugleiste.

# languageCombo.alttitle
source: Language of contents
de: Sprache des Inhalts

# languageCombo.description
source: Select the language of the contents of the element.
de: Wählen Sie die Sprache der Inhalte dieses Elements.

# languageCombo.details
source: The language selector box may appear in the RTE toolbar and in some dialogues. The selector shows the language currently assigned to the current element, if any. Selecting a language assigns it to the element. If a language was already assigned to the element, it is replaced by the newly selected language. Any currently assigned language may be removed by selecting the "Remove language mark" item at the top of the list of the selector box.
de: Das Feld zur Sprachauswahl kann in der RTE-Werkzeugleiste und in manchen Dialogen erscheinen. Die Auswahl zeigt die Sprache, die aktuell dem ausgewählten Element zugewiesen ist. Das Wählen einer Sprache weist diese dem Element zu. War bereits eine Sprache zugewiesen, wird diese durch die neu gewählte ersetzt. Eine zugewiesene Sprache kann durch Auswählen von "Sprachhinweis entfernen" am Beginn der Liste im Auswahlfeld entfernt werden.

# directionCombo.alttitle
source: Direction of text
de: Textrichtung

# directionCombo.description
source: Select the direction of text within the contents of the element.
de: Wählen Sie die Textrichtung im Inhalt dieses Elements aus.

# directionCombo.details
source: The text direction selector box may appear in some dialogues. The selector shows the direction of text currently set on the current element, if any. Selecting a direction sets it on the element. If a direction was already set on the element, it is replaced by the newly selected direction. Any currently set direction may be removed by selecting the "Not set" item at the top of the list of the selector box.
de: Das Feld zur Auswahl der Textrichtung kann in einigen Dialogen erscheinen. Die Auswahl zeigt die Textrichtung, die aktuell dem ausgewählten Element zugewiesen ist. Das Wählen einer Richtung weist diese dem Element zu. War bereits eine Richtung zugewiesen, wird diese durch die neu gewählte ersetzt. Eine zugewiesene Richtung kann durch Auswählen von "Nicht gesetzt" am Beginn der Liste im Auswahlfeld entfernt werden.
