Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/form/Resources/Private/Language/*.locallang_controller.xlf
Languages: de

# tx_form_domain_model_element_button.value
source: Push this button
de: Drücken Sie die Schaltfläche

# tx_form_domain_model_element_submit.value
source: Submit form
de: Formular absenden

# tx_form_domain_model_element_reset.value
source: Clear form
de: Formular leeren

# tx_form_system_validate_alphabetic.message
source: Use alphabetic characters
de: Verwenden Sie alphabetische Zeichen

# tx_form_system_validate_alphabetic.message2
source: whitespace allowed
de: Leerzeichen erlaubt

# tx_form_system_validate_alphabetic.error
source: The value contains not only alphabetic characters
de: Dieser Wert enthält nicht nur alphabetische Zeichen

# tx_form_system_validate_alphanumeric.message
source: Use alphanumeric characters
de: Verwenden Sie alphanumerische Zeichen

# tx_form_system_validate_alphanumeric.message2
source: whitespace allowed
de: Leerzeichen erlaubt

# tx_form_system_validate_alphanumeric.error
source: The value contains not only alphanumeric characters
de: Dieser Wert enthält nicht nur alphanumerische Zeichen

# tx_form_system_validate_between.message
source: The value must be between %minimum and %maximum
de: Der Wert muss zwischen %minimum und %maximum liegen

# tx_form_system_validate_between.message2
source: inclusively
de: einschließlich

# tx_form_system_validate_between.error
source: The value is not between %minimum and %maximum
de: Der Wert darf nicht zwischen %minimum und %maximum liegen

# tx_form_system_validate_between.error2
source: inclusively
de: einschließlich

# tx_form_system_validate_date.error
source: The value does not appear to be a valid date
de: Der Wert ist kein gültiges Datum

# tx_form_system_validate_digit.message
source: Use digit characters
de: Verwenden Sie Ziffern

# tx_form_system_validate_digit.error
source: The value contains not only digit characters
de: Der Wert enthält nicht nur Ziffern

# tx_form_system_validate_email.message
source: (john.doe@domain.com)
de: (max.muster@domain.com)

# tx_form_system_validate_email.error
source: This is not a valid email address
de: Dies ist keine gültige E-Mail-Adresse

# tx_form_system_validate_equals.message
source: This field must be equal to '%field'
de: Dieses Feld muss mit '%field' übereinstimmen

# tx_form_system_validate_equals.error
source: The value does not equal the value in field '%field'
de: Der Wert stimmt nicht mit dem Wert des Feldes "%field" überein

# tx_form_system_validate_fileallowedtypes.error
source: The file type is not allowed
de: Dieser Dateityp ist nicht erlaubt

# tx_form_system_validate_filemaximumsize.message
source: The filesize must be smaller than %maximum
de: Die Dateigröße muss kleiner als %maximum sein

# tx_form_system_validate_filemaximumsize.error
source: The filesize is too big
de: Die Datei ist zu groß

# tx_form_system_validate_fileminimumsize.message
source: The filesize must be bigger than %minimum
de: Die Datei muss größer als %minimum sein

# tx_form_system_validate_fileminimumsize.error
source: The filesize is too small
de: Die Datei ist zu klein

# tx_form_system_validate_float.message
source: Enter a float
de: Geben Sie eine Fließkommazahl ein

# tx_form_system_validate_float.error
source: The value does not appear to be a float
de: Der Wert ist keine Fließkommazahl

# tx_form_system_validate_greaterthan.message
source: The value must be greater than %minimum
de: Der Wert muss größer als %minimum sein

# tx_form_system_validate_greaterthan.error
source: The value does not appear to be greater than %minimum
de: Der Wert scheint nicht größer als %minimum zu sein

# tx_form_system_validate_inarray.message
source: Only a few values are possible
de: Nur einige Werte sind möglich

# tx_form_system_validate_inarray.error
source: The value does not appear to be valid
de: Der Wert scheint nicht gültig zu sein

# tx_form_system_validate_integer.message
source: Use a integer
de: Verwenden Sie eine ganze Zahl

# tx_form_system_validate_integer.error
source: The value does not appear to be an integer
de: Der Wert scheint keine ganze Zahl zu sein

# tx_form_system_validate_ip.error
source: The value does not appear to be a valid IP address
de: Der Wert scheint keine gültige IP-Adresse zu sein

# tx_form_system_validate_length.message
source: The length of the value must have a minimum of %minimum characters
de: Der Wert muss eine Länge von mindestens %minimum Zeichen haben

# tx_form_system_validate_length.message2
source: and a maximum of %maximum
de: und eine Länge von maximal %maximum Zeichen

# tx_form_system_validate_length.error
source: The value is less than %minimum characters long
de: Der Wert ist kürzer als %minimum Zeichen

# tx_form_system_validate_length.error2
source: or longer than %maximum
de: oder länger als %maximum Zeichen

# tx_form_system_validate_lessthan.message
source: The value must be less than %maximum
de: Der Wert muss kleiner als %maximum sein

# tx_form_system_validate_lessthan.error
source: The value does not appear to be less than %maximum
de: Der Wert scheint nicht kleiner als %maximum zu sein

# tx_form_system_validate_regexp.message
source: Use the right pattern
de: Verwenden Sie das richtige Muster

# tx_form_system_validate_regexp.error
source: The value does not match against pattern
de: Der Wert stimmt nicht mit dem Muster überein

# tx_form_system_validate_required.message
source: Required
de: Benötigt

# tx_form_system_validate_required.error
source: This field is required
de: Dies ist ein Pflichtfeld

# tx_form_system_validate_uri.message
source: The value must be a URI
de: Der Wert muss eine URI sein

# tx_form_system_validate_uri.error
source: The value does not appear to be a URI
de: Der Wert schein keine URI zu sein

# tx_form_view_confirmation.message
source: Please check your input and confirm by using the appropriate button
de: Bitte überprüfen Sie Ihre Eingabe und bestätigen Sie sie mit der passenden Schaltfläche

# tx_form_view_confirmation.confirm
source: Confirm
de: Bestätigen

# tx_form_view_confirmation.donotconfirm
source: Go back to the form
de: Zurück zum Formular

# tx_form_view_mail.success
source: The form has been sent successfully by mail
de: Das Formular wurde erfolgreich versandt

# tx_form_view_mail.error
source: There was an error when sending the form by mail
de: Beim Versenden des Formulars per E-Mail ist ein Fehler aufgetreten
