Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/cms/layout/*.locallang_db_new_content_*.xlf
Languages: de

# sel1
source: Please select the type of page content you wish to create:
de: Wählen Sie bitte den Seiteninhaltstyp aus, den Sie erstellen wollen:

# sel2
source: Now, click the position where you wish to place the element on the page:
de: Wählen Sie nun die Position aus, an der das Element auf der Seite positioniert werden soll:

# common
source: Typical page content
de: Typischer Seiteninhalt

# common_headerOnly_title
source: Header Only
de: Nur Überschrift

# common_headerOnly_description
source: Adds a header only.
de: Eine Überschrift.

# common_regularText_title
source: Regular Text Element
de: Text

# common_regularText_description
source: A regular text element with header and bodytext fields.
de: Ein normales Textelement mit Überschrift und Fließtext.

# common_textImage_title
source: Text & Images
de: Text und Bilder

# common_textImage_description
source: Any number of images wrapped right around a regular text element.
de: Eine beliebige Anzahl von Bildern mit umfließendem Text.

# common_imagesOnly_title
source: Images Only
de: Nur Bilder

# common_imagesOnly_description
source: Any number of images aligned in columns and rows with a caption.
de: Eine beliebige Anzahl von in Zeilen und Spalten angeordneten Bildern mit Beschriftung.

# common_bulletList_title
source: Bullet List
de: Aufzählung

# common_bulletList_description
source: A single bullet list.
de: Eine einzelne Aufzählung.

# common_table_title
source: Table
de: Tabelle

# common_table_description
source: A simple table.
de: Eine einfache Tabelle.

# special
source: Special elements
de: Spezielle Elemente

# special_filelinks_title
source: File Links
de: Dateilinks

# special_filelinks_description
source: Makes a list of files for download.
de: Erzeugt eine Liste mit Dateien zum Herunterladen.

# special_multimedia_description
source: Inserts a media element like a Flash animation, audio file or video clip.
de: Fügt ein Medienelement ein (z.B. Flash-Animation, Audiodatei, Video).

# special_media_title
source: Media
de: Medien

# special_media_description
source: Inserts a media element like a Flash animation, audio file or video clip.
de: Fügt ein Medienelement wie eine Flash-Animation, eine Audiodatei oder einen Video-Clip hinzu.

# special_swfobject_title
source: Inserts a Flash media element.
de: Fügt ein Flash-Medienelement hinzu.

# special_swfobject_description
source: Inserts Flash media element, audio file or video clip.
de: Fügt ein Flash-Medienelement, eine Audiodatei oder einen Video-Clip hinzu.

# special_qtobject_title
source: Inserts a Quicktime element.
de: Fügt ein QuickTime-Element hinzu.

# special_qtobject_description
source: Inserts a Quicktime element like a Quicktime audio file or video clip (*.mov).
de: Fügt ein QuickTime-Element wie eine QuickTime-Audiodatei oder einen -Video-Clip (*.mov) hinzu.

# special_menus_title
source: Special Menus
de: Spezial-Menüs

# special_menus_description
source: Creates a menu of pages, sitemap or other special menus.
de: Erstellt ein Seitenmenü, eine Sitemap oder andere Spezial-Menüs.

# special_plainHTML_title
source: Plain HTML
de: Reines HTML

# special_plainHTML_description
source: With this element you can insert raw HTML code on the page.
de: Mit diesem Element kann reiner HTML-Quelltext auf der Seite eingefügt werden.

# special_divider_title
source: Divider
de: Trenner

# special_divider_description
source: This element inserts a visual divider, which is by default a horizontal line.
de: Mit diesem Element wird ein sichtbarer Trenner eingefügt, standardmäßig eine horizontale Linie.

# special_shortcut_title
source: Insert records
de: Datensätze einfügen

# special_shortcut_description
source: With this element you can embed other content elements.
de: Mit diesem Element werden andere Inhaltselemente eingebunden.

# forms
source: Form elements
de: Formulare

# forms_mail_title
source: Mail Form
de: Mail-Formular

# forms_mail_description
source: A mail form allowing website users to submit responses.
de: Ein E-Mail-Formular, mit dem Besucher mit Ihnen Kontakt aufnehmen können.

# forms_search_title
source: Search Form
de: Suchformular

# forms_search_description
source: Draws a search form and the searchresult if a search is performed.
de: Zeigt ein Suchformular und die Suchergebnisse, wenn eine Suche durchgeführt wurde.

# forms_login_title
source: Login Form
de: Anmeldeformular

# forms_login_description
source: Login/logout form used to password protect pages allowing only authorised website users and groups access.
de: Ein An-/Abmeldeformular, um passwortgeschützte Seiten nur für authorisierte Benutzer und Gruppen zugänglich zu machen.

# plugins_general_title
source: General Plugin
de: Allgemeines Plug-In

# plugins_general_description
source: Select this element type to insert a plugin which cannot be found amongst the options below.
de: Wählen Sie diesen Elementtyp, um ein Plug-In einzufügen, das nicht bei den Optionen oben aufgeführt ist.
