Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/extensions/EditElement/*.locallang_csh.xlf
Languages: de

# .alttitle
source: htmlArea RTE > Edit Element
de: htmlArea RTE > Element bearbeiten

# .description
source: The "Edit element" dialogue allows to edit the general attributes of an element in the RTE editing area.
de: Der Dialog "Element bearbeiten" erlaubt es, die allgemeinen Attribute eines Elements im RTE zu bearbeiten.

# .details
source: Clicking the "Edit element" icon in the RTE tool bar opens a dialogue that allows to edit the general attributes of an element. The dialogue allows to edit the id, title, class, lang and dir attributes, as well as the microdata attributes of the element. It also allows to specify handlers for keyboard and mouse events.
de: Ein Klick auf das Symbol "Element bearbeiten" in der Menüleiste des RTE öffnet einen Dialog, mit dessen Hilfe Sie die allgemeinen Attribute eines Elements im RTE bearbeiten können. Der Dialog ermöglicht es, die Attribute id, title, class, lang und dir des Elements zu bearbeiten. Außerdem können Sie JavaScript-Handler für Tastatur- und Mausevents festlegen.

# .image_descr
source: "Edit element" icon in the editor tool bar.
de: "Element bearbeiten"-Symbol in der Menüleiste.

# .seeAlso
source: xEXT_rtehtmlarea_EditElement:id, xEXT_rtehtmlarea_EditElement:title, xEXT_rtehtmlarea_EditElement:className, xEXT_rtehtmlarea_Language:languageCombo, xEXT_rtehtmlarea_Language:directionCombo, xEXT_rtehtmlarea_MicrodataSchema, xEXT_rtehtmlarea_EditElement:events
de: xEXT_rtehtmlarea_EditElement:id, xEXT_rtehtmlarea_EditElement:title, xEXT_rtehtmlarea_EditElement:className, xEXT_rtehtmlarea_Language:languageCombo, xEXT_rtehtmlarea_Language:directionCombo, xEXT_rtehtmlarea_EditElement:events

# id.alttitle
source: Id attribute
de: ID-Attribut

# id.description
source: Enter or edit the value of the id attribute of the element.
de: Geben Sie den Wert des ID-Attribut des Elements an oder bearbeiten Sie ihn.

# title.alttitle
source: Title attribute
de: Title-Attribut

# title.description
source: Enter or edit the value of the title attribute of the element.
de: Geben Sie den Wert des Title-Attribut des Elements an oder bearbeiten Sie ihn.

# className.alttitle
source: Class attribute
de: Class-Attribut

# className.description
source: Choose a CSS class selector to be assigned to the element.
de: Wählen Sie eine CSS-Klasse, die dem Elements zugeordnet werden soll.

# events.alttitle
source: Event handlers
de: Eventhandler

# events.description
source: Using this fieldset, edit handlers for keyboard and mouse events.
de: Mit diesem Fieldset können Sie JavaScript-Handler für Tastatur- und Mausevents festlegen.

# onkeydown.alttitle
source: Onkeydown event handler
de: Eventhandler Onkeydown

# onkeydown.description
source: Enter or edit the script to be run when a key is pressed.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn eine Taste gedrückt wird.

# onkeypress.alttitle
source: Onkeypress event handler
de: Eventhandler Onkeypress

# onkeypress.description
source: Enter or edit the script to be run when a key is pressed and released.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn eine Taste gedrückt und losgelassen wird.

# onkeyup.alttitle
source: Onkeyup event handler
de: Eventhandler Onkeyup

# onkeyup.description
source: Enter or edit the script to be run when a key is pressed and released.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn eine Taste gedrückt wird.

# onclick.alttitle
source: Onclick event handler
de: Eventhandler Onclick

# onclick.description
source: Enter or edit the script to be run on a mouse click.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn mit der Maus geklickt wird.

# ondblclick.alttitle
source: Ondblclick event handler
de: Eventhandler Ondblclick

# ondblclick.description
source: Enter or edit the script to be run on a mouse double-click.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn mit der Maus doppelt geklickt wird.

# onmousedown.alttitle
source: Onmousedown event handler
de: Eventhandler Onmousedown

# onmousedown.description
source: Enter or edit the script to be run when a mouse button is pressed.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn eine Maustaste gedrückt wird.

# onmousemove.alttitle
source: Onmousemove event handler
de: Eventhandler Onmousemove

# onmousemove.description
source: Enter or edit the script to be run when the mouse pointer moves.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn der Mauszeiger sich bewegt.

# onmouseout.alttitle
source: Onmouseout event handler
de: Eventhandler Onmouseout

# onmouseout.description
source: Enter or edit the script to be run when mouse pointer moves out of the element.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn der Mauszeiger sich aus dem Element bewegt.

# onmouseover.alttitle
source: Onmouseover event handler
de: Eventhandler Onmouseover

# onmouseover.description
source: Enter or edit the script to be run when mouse pointer moves over the element.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn der Mauszeiger sich über das Element bewegt.

# onmouseup.alttitle
source: Onmouseup event handler
de: Eventhandler Onmouseup

# onmouseup.description
source: Enter or edit the script to be run when a mouse button is released.
de: Geben Sie das Skript an oder bearbeiten Sie das Skript, das ausgeführt werden soll, wenn eine Maustaste losgelassen wird.
