Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/indexed_search/*.locallang_csh_indexcfg.xlf
Languages: de

# .description
source: The Indexed Search configuration allows you to set up indexing of resources which are external to the TYPO3 page tree. This could be a library of records (like news), a directory structure of files (like PDFs) or an external URL to be crawled to some depth - or third-party content provided from other extensions via hooks.
de: Mit Hilfe der Indexsuchenkonfiguration ist es möglich, eine Indexierung von Quellen einzurichten, die sich außerhalb des TYPO3-Seitenbaums befinden. Dabei kann es sich um Bibliotheken von Datensätzen (wie News) handeln, eine Verzeichnisstruktur mit Dateien (wie PDFs) oder externe URLs, die bis zu einer bestimmten Tiefe verarbeitet werden sollen - oder weitere Drittinhalte, die aus anderen Erweiterungen über Hooks geliefert werden.

# .details
source: The Indexing Configuration records are used to set up how the indexing occurs, at which time and related to which part of the page tree. An important requirement to keep in mind is that the "crawler" extension must be installed since the indexing engine uses the "crawler" extensions queue as a timing device - and using the "crawler" extension means using a cron-job to activate it from the shell.
de: Die Datensätze der Indexierungskonfiguration dienen zur Festlegung der Art und Weise und des Zeitpunktes der Indexierung sowie des Teilastes des Seitenbaums, auf den sie sich bezieht. Eine wichtige Voraussetzung ist die Installation der Erweiterung "crawler", denn die Indexsuche benutzt die Warteschlange dieser Erweiterung als Zeitplaner - und dies wiederum bedingt die Verwendung eines Cron-Jobs, der "crawler" von der Shell aus aktiviert.

# title.description
source: Provide a title for the configuration.
de: Geben Sie einen Titel für die Konfiguration an.

# description.description
source: If needed, give it a description or put other important notes in this field.
de: Geben Sie, falls notwendig, eine Beschreibung oder wichtige Hinweise ein.

# hidden.description
source: Disable the configuration by this checkbox. If disabled, the configuration will be bypassed by the crawlers cron job.
de: Deaktiviert die Konfiguration. Bei Deaktivierung wird die Konfiguration vom Cron-Job der Erweiterung "crawler" übersprungen.

# hidden.details
source: Notice; Disabling the indexing process will not hide already indexed content in search results!
de: Hinweis: Die Deaktivierung des Indexierungsvorgangs hat keinen Einfluss auf die Anzeige bereits indexierter Inhalte in Suchergebnissen!

# starttime.description
source: Set a start time for the configuration. If set, the configuration will be bypassed by the crawlers cron job until this time is reached.
de: Legt eine Startzeit für die Konfiguration fest. Wird hier ein Wert eingetragen, so wird die Konfiguration vom Crawler-Cron-Job so lange übersprungen, bis der angegebene Zeitpunkt erreicht ist.

# timer_frequency.description
source: Use this setting to adjust how often you would like a re-indexing process to run for the configuration.
de: Mit Hilfe dieser Einstellung lässt sich festlegen, wie oft für diese Konfiguration eine Neuindexierung erfolgen soll.

# timer_offset.description
source: The offset adjusts at what time of day you want the indexing process to run.
de: Der Zeitversatz gibt an, zu welcher Tageszeit der Indexierungsvorgang durchgeführt werden soll.

# timer_next_indexing.description
source: This field contains the date and time of the next occuring indexing session. If left blank the next indexing will occur as soon as the cron-script is run again (typically within the next minute) and afterwards set to the next time according to frequency and offset.
de: Dieses Feld beinhaltet Datum und Zeit des nächsten Indexierungsvorgangs. Ist kein Wert eingetragen, erfolgt die nächste Indexierung beim nächsten Aufruf des Cron-Skripts (normalerweise innerhalb einer Minute) und anschließend jeweils zu der Zeit, die durch Häufigkeit und Versatz festgelegt wurde.

# type.description
source: Select the type of Indexing Configuration here.
de: Den Typ der Indexierungskonfiguration festlegen.

# type.details
source: <b>Records</b> - You will be able to index records on a specified page from a specified database table. You can determine which fields from that record you want to index and how additional GET parameters should look like when linking to the search result. <b>Files</b> - Allows you to index a whole directory of files from the fileadmin/ folder. You can optionally specify how many levels of recursion you want. <b>External URL</b> - Allows you to index an external site and search it from your TYPO3 installation! You can specify how deep the crawler should go on that external URL. <b>Page tree</b> - Allows you to index the page tree using the cron script. This type will not be useful as a category for searching like the other types. <b>Meta configuration</b> - Points to a collection of other indexing configurations in which the search will be done. Cannot be used for cron-job based indexing. <b>Custom</b> - Other extensions might register custom types of configurations.
de: <strong>Datensätze</strong> - Hiermit können Datensätze auf einer bestimmten Seite und aus einer bestimmten Tabelle indexiert werden. Es kann festgelegt werden, welche Felder des Datensatzes indexiert werden und wie zusätzliche GET-Parameter benutzt werden sollen, wenn zum Suchergebnis verlinkt wird. <strong>Dateien</strong> - Erlaubt die Indexierung eines ganzen Verzeichnisses unterhalb des Ordners fileadmin/. Optional kann die gewünschte Tiefe der Rekursion angegeben werden. <strong>Externe URL</strong> - Erlaubt die Indexierung einer externen Site und die Suche darin von innerhalb der TYP3-Installation! Optional kann die gewünschte Tiefe angegeben werden, bis zu der crawler Links folgen soll. <strong>Seitenbaum</strong> - Erlaubt die Indexierung des Seitenbaums über das Cron-Skript. Dieser Typ kann bei der Suche nicht wie die anderen als Kategorie eingesetzt werden. <strong>Metakonfiguration</strong> - Zeigt auf eine Sammlung anderer Indexierungskonfigurationen, über welche die Suche durchgeführt wird. Kann nicht für Cron-Job-basierte Indexierung verwendet werden. <strong>Benutzerdefiniert</strong> - Andere Erweiterungen können benutzerdefinierte Typen der Konfiguration registrieren.

# table2index.description
source: Specify the database table to index records from.
de: Die Datenbanktabelle angeben, deren Datensätze indexiert werden sollen.

# alternative_source_pid.description
source: By default the indexer will select records from the page id where the Indexing Configuration is stored. If you want an alternative page as the source of your records you can enter it here.
de: Standardmäßig wählt der Indexierungsvorgang Datensätze der Seite aus, in der die Indexierungskonfiguration gespeichert ist. Soll eine andere Seite als Quelle der Datensätze dienen, kann dies hier festgelegt werden.

# get_params.description
source: Enter the GET parameters necessary to display the search results. You can use ###UID### as a marker in the parameter template.
de: Die zur Anzeige der Suchergebnisse erforderlichen GET-Parameter eingeben. In der Parametervorlage kann ###UID### als Markierung verwendet werden.

# get_params.details
source: Notice: The GET parameters are appended to the URL of the page where the Indexing Configuration is stored (which must be the page where a plugin exists that can display the records with the given parameters!). Example value: "&showUid=###UID###"
de: Hinweis: Die GET-Parameter werden der URL der Seite hinzugefügt, auf der die Indexierungskonfiguration gespeichert ist. Dabei muss es sich um eine Seite handeln, auf der sich ein Plug-In befindet, das in der Lage ist, mit Hilfe der Parameter die Datensätze anzuzeigen! Beispielwert: "&showUid=###UID###"

# fieldlist.description
source: Enter a comma-list of fields to be indexed. The first field name will be used for the search result title.
de: Eine kommagetrennte Liste der zu indexierenden Felder eingeben. Der Name des ersten Feldes wird für den Titel des Suchergebnisses benutzt.

# fieldlist.details
source: <b>Example:</b> "header,bodytext,image_caption" would index the Header, Bodytext and Image Caption fields from "tt_content". Notice that you must use the real database field names, don't spell them wrong!
de: <strong>Beispiel:</strong> "header,bodytext,image_caption" würde die Felder Header, Bodytext und Bildunterschrift aus tt_content indexieren. Beachten Sie, dass hier die echten Namen der Datenbankfelder verwendet werden müssen, achten Sie also auf die korrekte Schreibweise!

# chashcalc.description
source: If checked, the URL in the search result for records will be encoded with a "&cHash" parameter to make it cachable. Use only if supported by the plugin!
de: Ist die Option aktiviert, wird die URL im Suchergebnisse für Datensätze über einen "&cHash"-Parameter kodiert, damit sie gecacht werden kann. Nur verwenden, wenn es vom entsprechenden Plug-In auch unterstützt wird!

# recordsbatch.description
source: Enter how many records to index for each instance of the indexing process (how many per minute). Default is 100 records.
de: Die Anzahl der pro Instanz des Indexierungsprozesses zu indexierenden Datensätze angeben (wie viele pro Minute). Voreinstellung sind 100 Datensätze.

# records_indexonchange.description
source: If set, new and changed records from this table will be indexed through a hook in the core (TCEmain) meaning that they will be searchable immediately after addition to the system.
de: Ist die Option aktiviert, werden neue und geänderte Datensätze dieser Tabelle über einen Hook im Kern (TCEmain) indexiert. D.h. es kann sofort nach dem Hinzufügen zum System nach ihnen gesucht werden.

# externalUrl.description
source: Enter the URL of the external website you want to index.
de: Die URL einer externen, zu indexierenden Website eingeben.

# url_deny.description
source: Enter a URL on each line inside of which the crawler should not decend.
de: Pro Zeile eine URL eingeben, die der Crawler aussparen soll.

# url_deny.details
source: Example: If you wish to index "http://typo3.org/" but not "http://typo3.org/extensions/" and "http://typo3.org/downloads/" then you simply enter those two URLs into the box like this: http://typo3.org/downloads/ http://typo3.org/extensions/
de: Beispiel: Soll "http://typo3.org/" indexiert werden, aber nicht "http://typo3.org/extensions" und "http://typo3.org/downloads/", einfach folgende URLs so in das Feld eingeben: http://typo3.org/downloads/ http://typo3.org/extensions/

# filepath.description
source: Enter a filepath inside fileadmin/ where you want the files to be indexed.
de: Einen Dateipfad unterhalb von fileadmin/ angeben, in dem die Dateien indexiert werden sollen.

# filepath.details
source: Example: "fileadmin/newsletters/"
de: Beispiel: "fileadmin/newsletters/"

# extensions.description
source: If you want to index only specific files in the directory, enter a list of file extensions here. For example: "html,pdf,doc"
de: Sollen in einem Verzeichnis nur bestimmte Dateitypen indexiert werden, hier eine Liste der Dateiendungen eingeben. Beispiel: "html,pdf,doc"

# depth.description
source: Levels of recursion.
de: Rekursionsebenen.

# depth.details
source: For file indexing it is the level of directories to decend. For External URLs it's the depth to which the crawler will go with links.
de: Bei der Indexierung von Dateien gibt der Wert die Tiefe der Verzeichnisebenen an, bis zu der indexiert werden soll. Bei externen URLs entspricht er der Tiefe, bis zu der crawler Links folgt.

# indexcfgs.description
source: When a search is conducted in this indexing configuration the actual search will take place in the indexed content from the configurations listed here. You can also enter pages and if you do so the search will take place in indexing configurations found on those pages.
de: Wird eine Suche über diese Indexierungskonfiguration durchgeführt, so findet die tatsächliche Suche im indexierten Inhalt der hier aufgeführten Konfigurationen statt. Zusätzlich können Seiten angegeben werden. In diesem Fall wird die Suche über die auf diesen Seiten gefundenen Indexierungskonfigurationen durchgeführt.
