Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/indexed_search/*.locallang_db.xlf
Languages: de

# index_config
source: Indexing Configuration
de: Indexierungseinstellungen

# index_config.title
source: Title:
de: Titel:

# index_config.description
source: Description:
de: Beschreibung:

# index_config.type.I.1
source: Database Records
de: Datensätze

# index_config.type.I.2
source: Filepath on server
de: Dateipfad auf dem Server

# index_config.type.I.3
source: External URL
de: Externe URL

# index_config.type.I.4
source: Page tree
de: Seitenbaum

# index_config.type.I.5
source: Meta configuration
de: Metakonfiguration

# index_config.type
source: Type:
de: Typ:

# index_config.depth.I.0
source: Single page
de: Einzelne Seite

# index_config.depth.I.1
source: 1 Level
de: 1 Ebene

# index_config.depth.I.2
source: 2 Levels
de: 2 Ebenen

# index_config.depth.I.3
source: 3 Levels
de: 3 Ebenen

# index_config.depth
source: Depth:
de: Tiefe:

# index_config.table2index
source: Table to index:
de: Zu indexierende Tabelle:

# index_config.alternative_source_pid
source: Alternative Source Page:
de: Alternative Quellseite:

# index_config.get_params
source: GET parameter string (with ###UID### substitution):
de: GET-Parameter-String (mit ###UID###-Ersetzung):

# index_config.fields
source: Fields (first is title):
de: Felder (erstes ist Titel):

# index_config.externalUrl
source: External URL (eg. "http://www.domain.org/"):
de: Externe URL (z.B.: "http://www.domain.org/"):

# index_config.chashcalc
source: Calculate cHash (force caching)?
de: cHash-Wert berechnen (Caching erzwingen)?

# index_config.filepath
source: Filepath:
de: Dateipfad:

# index_config.extensions
source: Limit to extensions (commalist):
de: Beschränken auf folgende Erweiterungen (kommagetrennte Liste):

# index_config.url_deny
source: Enter sub-URLs in which not to decend:
de: In diese Sub-URLs nicht weiter absteigen:

# index_config.records_indexonchange
source: Index Records immediately when saved?:
de: Datensätze direkt beim Speichern indexieren:

# index_config.timer_next_indexing
source: Next indexing is scheduled (if empty, then immediately):
de: Nächste Indexierung ist geplant (wenn leer, dann sofort):

# index_config.timer_offset
source: Timing offset from midnight:
de: Zeitversatz nach Mitternacht:

# index_config.timer_frequency
source: How often would you like a re-index?:
de: Wie häufig soll eine Reindexierung vorgenommen werden?

# index_config.timer_frequency.I.0
source: Every hour
de: stündlich

# index_config.timer_frequency.I.1
source: Every day (24 hours)
de: täglich (24 Stunden)

# index_config.timer_frequency.I.2
source: Every week
de: wöchentlich

# index_config.recordsbatch
source: How many records to index a minute (default is 100):
de: Wie viele Datensätze sollen pro Minute indexiert werden (Standard ist 100):

# index_config.set_id
source: Session ID (if > zero, then indexing job is running):
de: Sitzungs-ID (wenn > Null läuft Indexierungsprozess)

# index_config.indexcfgs
source: Indexing configurations:
de: Indexierungseinstellungen:

# index_config.parameterCfgs
source: Parameter combination configuration ([tablename]:&[param]=###UID###):
de: Konfiguration Parameterkombination ([tablename]:&[param]=###UID###):

# index_config.rootpage
source: Root page:
de: Wurzelseite:
