Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/CharacterMap/*.locallang.xlf
Languages: de

# CharacterMapTooltip
source: Insert special character
de: Einfügen von Sonderzeichen

# InsertCharacter-Tooltip
source: Insert special character
de: Einfügen von Sonderzeichen

source: Insert special character
de: Sonderzeichen einfügen

source: General
de: Allgemein

source: Mathematical
de: Mathematisch

# graphical
source: Shapes and arrows
de: Formen und Farben

source: HTML value:
de: HTML-Wert:

source: Close
de: Schließen

# nbsp
source: Non-breaking space
de: Geschütztes Leerzeichen

# Agrave
source: Capital a with grave accent
de: Großes a mit Gravis

# agrave
source: Small a with grave accent
de: Kleines a mit Gravis

# Aacute
source: Capital a with acute accent
de: Großes a mit Akut

# aacute
source: Small a with acute accent
de: Kleines a mit Akut

# Acirc
source: Capital a with circumflex accent
de: Großes a mit Zirkumflex

# acirc
source: Small a with circumflex accent
de: Kleines a mit Zirkumflex

# Atilde
source: Capital a with tilde
de: Großes a mit Tilde

# atilde
source: Small a with tilde
de: Kleines a mit Tilde

# Auml
source: Capital a with umlaut/diaeresis
de: Großes a mit Umlaut/Trema

# auml
source: Small a with umlaut/diaeresis
de: Kleines a mit Umlaut/Trema

# Aring
source: Capital a with ring
de: Großes a mit Ring

# aring
source: Small a with ring
de: Kleines a mit Ring

# AElig
source: Capital ligature ae
de: Große ae-Ligatur

# aelig
source: Small ligature ae
de: Kleine ae-Ligatur

# ordf
source: Feminine ordinal indicator
de: Feminines Ordinalzeichen

# Ccedil
source: Capital c with cedilla
de: Großes c mit Cédille

# ccedil
source: Small c with cedilla
de: Kleines c mit Cédille

# ETH
source: Capital eth, Icelandic
de: Großes Eth, isländisch

# eth
source: Small eth, Icelandic
de: Kleines Eth, isländisch

# Egrave
source: Capital e with grave accent
de: Großes e mit Gravis

# egrave
source: Small e with grave accent
de: Kleines e mit Gravis

# Eacute
source: Capital e with acute accent
de: Großes e mit Akut

# eacute
source: Small e with acute accent
de: Kleines e mit Akut

# Ecirc
source: Capital e with circumflex accent
de: Großes e mit Zirkumflex

# ecirc
source: Small e with circumflex accent
de: Kleines e mit Zirkumflex

# Euml
source: Capital e with umlaut/diaeresis
de: Großes e mit Umlaut/Trema

# euml
source: Small e with umlaut/diaeresis
de: Kleines e mit Umlaut/Trema

# Igrave
source: Capital i with grave accent
de: Großes i mit Gravis

# igrave
source: Small i with grave accent
de: Kleines i mit Gravis

# Iacute
source: Capital i with acute accent
de: Großes i mit Akut

# iacute
source: Small i with acute accent
de: Kleines i mit Akut

# Icirc
source: Capital i with circumflex accent
de: Großes i mit Zirkumflex

# icirc
source: Small i with circumflex accent
de: Kleines i mit Zirkumflex

# Iuml
source: Capital i with umlaut/diaeresis
de: Großes i mit Umlaut/Trema

# iuml
source: Small i with umlaut/diaeresis
de: Kleines i mit Umlaut/Trema

# Ntilde
source: Capital n with tilde
de: Großes n mit Tilde

# ntilde
source: Small n with tilde
de: Kleines n mit Tilde

# Ograve
source: Capital o with grave accent
de: Großes o mit Gravis

# ograve
source: Small o with grave accent
de: Kleines o mit Gravis

# Oacute
source: Capital o with acute accent
de: Großes o mit Akut

# oacute
source: Small o with acute accent
de: Kleines o mit Akut

# Ocirc
source: Capital o with circumflex accent
de: Großes o mit Zirkumflex

# ocirc
source: Small o with circumflex accent
de: Kleines o mit Zirkumflex

# Otilde
source: Capital o with tilde
de: Großes o mit Tilde

# otilde
source: Small o with tilde
de: Kleines o mit Tilde

# Ouml
source: Capital o with umlaut/diaeresis
de: Großes o mit Umlaut/Trema

# ouml
source: Small o with umlaut/diaeresis
de: Kleines o mit Umlaut/Trema

# Oslash
source: Capital o with slash
de: Großes o mit Schrägstrich

# oslash
source: Small o with slash
de: Kleines o mit Schrägstrich

# OElig
source: Capital ligature OE
de: Große oe-Ligatur

# oelig
source: Small ligature OE
de: Kleine oe-Ligatur

# ordm
source: Masculine ordinal indicator
de: Maskulines Ordinalzeichen

# Scaron
source: Capital s with caron
de: Großes s mit Caron

# scaron
source: Small s with caron
de: Kleines s mit Caron

# szlig
source: Small sharp s, German
de: Scharfes s, deutsch

# THORN
source: Capital THORN, Icelandic
de: Großes Thorn, isländisch

# thorn
source: Small thorn, Icelandic
de: Kleines Thorn, isländisch

# Ugrave
source: Capital u with grave accent
de: Großes u mit Gravis

# ugrave
source: Small u with grave accent
de: Kleines u mit Gravis

# Uacute
source: Capital u with acute accent
de: Großes u mit Akut

# uacute
source: Small u with acute accent
de: Kleines u mit Akut

# Ucirc
source: Capital u with circumflex accent
de: Großes u mit Zirkumflex

# ucirc
source: Small u with circumflex accent
de: Kleines u mit Zirkumflex

# Uuml
source: Capital u with umlaut/diaeresis
de: Großes u mit Umlaut/Trema

# uuml
source: Small u with umlaut/diaeresis
de: Kleines u mit Umlaut/Trema

# Yacute
source: Capital y with acute accent
de: Großes y mit Akut

# yacute
source: Small y with acute accent
de: Kleines y mit Akut

# Yuml
source: Capital y with umlaut/diaeresis
de: Großes y mit Umlaut/Trema

# yuml
source: Small y with umlaut/diaeresis
de: Kleines y mit Umlaut/Trema

# acute
source: Spacing acute
de: Abstand mit Akut

# tilde
source: Small tilde
de: Kleine Tilde

# uml
source: Spacing diaeresis
de: Abstand mit Trema

# cedil
source: Spacing cedilla
de: Abstand mit Cédille

# shy
source: Soft hyphen
de: Weiches Trennzeichen

# ndash
source: En dash
de: Halbgeviertstrich

# mdash
source: Em dash
de: Geviertstrich

# lsquo
source: Left single quotation mark
de: Einfaches linkes Anführungszeichen

# rsquo
source: Right single quotation mark
de: Einfaches rechtes Anführungszeichen

# sbquo
source: Single low-9 quotation mark
de: Einfaches Anführungszeichen unten

# ldquo
source: Left double quotation mark
de: Doppeltes linkes Anführungszeichen

# rdquo
source: Right double quotation mark
de: Doppeltes rechtes Anführungszeichen

# bdquo
source: Double low-9 quotation mark
de: Deutsches Anführungszeichen unten

# lsaquo
source: Single left angle quotation
de: Einfaches linkes Guillemet

# rsaquo
source: Single right angle quotation
de: Einfaches rechtes Guillemet

# laquo
source: Left angle quotation mark
de: Linkes Guillemet

# raquo
source: Right angle quotation mark
de: Rechtes Guillemet

# quot
source: Quotation mark
de: Anführungszeichen

# hellip
source: Horizontal ellipsis
de: Auslassungspunkte

# iquest
source: Inverted question mark
de: Umgekehrtes Fragezeichen

# iexcl
source: Inverted exclamation mark
de: Umgekehrtes Ausrufezeichen

# bull
source: Bullet
de: Aufzählungszeichen

source: Dagger
de: Kreuz

# Dagger
source: Double dagger
de: Doppelkreuz

# brvbar
source: Broken vertical bar
de: Unterbrochener senkrechter Strich

# para
source: Paragraph
de: Absatzzeichen

# sect
source: Section
de: Paragraphenzeichen

# loz
source: Lozenge
de: Raute

# #064
source: At
de: At-Zeichen

# curren
source: Currency
de: Währung

source: Pound
de: Pfund

# emsp
source: Em space
de: Geviert-Leerzeichen

# ensp
source: En space
de: Halbgeviert-Leerzeichen

# thinsp
source: Thin space
de: Schmales Leerzeichen

# minus
source: Minus sign
de: Minus

# plusmn
source: Plus-or-minus sign
de: Plus-/Minuszeichen

# times
source: Multiplication
de: Multiplikationszeichen

# divide
source: Division
de: Divisionszeichen

# radic
source: Square root
de: Wurzel

# sdot
source: Dot operator
de: Multiplikationspunkt

# ne
source: Not equal to
de: Ungleichheitszeichen

# deg
source: Degree
de: Grad

source: Micro
de: Mikro-Zeichen

# permil
source: Per mille
de: Promille

# frasl
source: Fraction slash
de: Bruchstrich

# frac14
source: Fraction 1/4
de: Bruch 1/4

# frac12
source: Fraction 1/2
de: Bruch 1/2

# frac34
source: Fraction 3/4
de: Bruch 3/4

# and
source: Logical and
de: Logisches Und

# or
source: Logical or
de: Logisches Oder

# equiv
source: Equivalent
de: Äquivalent

source: Sum
de: Summe

# prod
source: Product
de: Produkt

# fnof
source: Function
de: Funktion

# Alpha
source: Greek capital letter alpha
de: Großes griechisches alpha

# alpha
source: Greek small letter alpha
de: Kleines griechisches alpha

# Beta
source: Greek capital letter beta
de: Großes griechisches beta

# beta
source: Greek small letter beta
de: Kleines griechisches beta

# Gamma
source: Greek capital letter gamma
de: Großes griechisches gamma

# gamma
source: Greek small letter gamma
de: Kleines griechisches gamma

# Delta
source: Greek capital letter delta
de: Großes griechisches delta

# delta
source: Greek small letter delta
de: Kleines griechisches delta

# Epsilon
source: Greek capital letter epsilon
de: Großes griechisches epsilon

# epsilon
source: Greek small letter epsilon
de: Kleines griechisches epsilon

# Zeta
source: Greek capital letter zeta
de: Großes griechisches zeta

# zeta
source: Greek small letter zeta
de: Kleines griechisches zeta

# Eta
source: Greek capital letter eta
de: Großes griechisches eta

# eta
source: Greek small letter eta
de: Kleines griechisches eta

# Theta
source: Greek capital letter theta
de: Großes griechisches theta

# theta
source: Greek small letter theta
de: Kleines griechisches theta

# Iota
source: Greek capital letter iota
de: Großes griechisches iota

# iota
source: Greek small letter iota
de: Kleines griechisches iota

# Kappa
source: Greek capital letter kappa
de: Großes griechisches kappa

# kappa
source: Greek small letter kappa
de: Kleines griechisches kappa

# Lambda
source: Greek capital letter lambda
de: Großes griechisches lambda

# lambda
source: Greek small letter lambda
de: Kleines griechisches lambda

# Mu
source: Greek capital letter mu
de: Großes griechisches mu

# mu
source: Greek small letter mu
de: Kleines griechisches mu

# Nu
source: Greek capital letter nu
de: Großes griechisches nu

# nu
source: Greek small letter nu
de: Kleines griechisches nu

# Xi
source: Greek capital letter xi
de: Großes griechisches xi

# xi
source: Greek small letter xi
de: Kleines griechisches xi

# Omicron
source: Greek capital letter omicron
de: Großes griechisches omicron

# omicron
source: Greek small letter omicron
de: Kleines griechisches omicron

# Pi
source: Greek capital letter pi
de: Großes griechisches pi

# pi
source: Greek small letter pi
de: Kleines griechisches pi

# Rho
source: Greek capital letter rho
de: Großes griechisches rho

# rho
source: Greek small letter rho
de: Kleines griechisches rho

# Sigma
source: Greek capital letter sigma
de: Großes griechisches sigma

# sigma
source: Greek small letter sigma
de: Kleines griechisches sigma

# Tau
source: Greek capital letter tau
de: Großes griechisches tau

# tau
source: Greek small letter tau
de: Kleines griechisches tau

# Upsilon
source: Greek capital letter upsilon
de: Großes griechisches upsilon

# upsilon
source: Greek small letter upsilon
de: Kleines griechisches upsilon

# Phi
source: Greek capital letter phi
de: Großes griechisches phi

# phi
source: Greek small letter phi
de: Kleines griechisches phi

# Chi
source: Greek capital letter chi
de: Großes griechisches chi

# chi
source: Greek small letter chi
de: Kleines griechisches chi

# Psi
source: Greek capital letter psi
de: Großes griechisches psi

# psi
source: Greek small letter psi
de: Kleines griechisches psi

# Omega
source: Greek capital letter omega
de: Großes griechisches omega

# omega
source: Greek small letter omega
de: Kleines griechisches omega

# clubs
source: Club
de: Kreuz

# diams
source: Diamond
de: Karo

# hearts
source: Heart
de: Herz

# spades
source: Spade
de: Pik
