Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/beuser/mod/*.locallang.xlf
Languages: de

source: Page title:
de: Seitentitel:

source: Path:
de: Pfad:

source: User:
de: Benutzer:

source: Group:
de: Gruppe:

source: Everybody:
de: Alle:

source: This user:
de: Dieser Benutzer:

source: Main group:
de: Hauptgruppe:

# editLock
source: Edit lock prevents all editing
de: Bearbeitungssperre verhindert Bearbeitung komplett

# noReadAccess
source: The user has no read-access to these DB-mounts!
de: Der Benutzer hat keinen Lesezugriff auf diese Datenbankfreigaben!

source: [Default Draft]
de: [Standardentwurf]

# notAccessible
source: WARNING: Workspace Webmount page id not accessible:
de: WARNUNG: Kein Zugriff auf Seiten-ID der Datenbankfreigabe der Arbeitsumgebung:

source: Compare User Settings
de: Benutzereinstellungen vergleichen

source: List Users Online
de: Angemeldete Benutzer anzeigen

source: Backend User Administration
de: Verwaltung der Backend-Benutzer

source: Filemounts
de: Verzeichnisfreigaben

source: Webmounts
de: Datenbankfreigaben

source: Default upload path
de: Standardhochladeverzeichnis

source: Main user group
de: Hauptbenutzergruppe

source: Member of groups
de: Mitglied von Gruppen

source: Page types access
de: Zugriff auf Seitentypen

source: Select tables
de: Tabellen anzeigen

source: Modify tables
de: Tabellen ändern

source: Non-exclude fields
de: Erlaubte Ausschlussfelder

source: Explicit Allow/Deny
de: Feldwerte explizit erlauben/verbieten

source: Limit to languages
de: Auf Sprachen einschränken

source: Workspace permissions
de: Berechtigungen für Arbeitsumgebung

source: Workspace membership
de: Mitgliedschaften in Arbeitsumgebung

source: Custom options
de: Benutzerdefinierte Optionen

source: Modules
de: Module

source: TSconfig
de: TSconfig (Baumansicht)

source: TSconfig HL
de: TSconfig (chronologisch als Code)

source: Non-mounted readable pages:
de: Nicht-freigegebene lesbare Seiten:

source: < Back to overview
de: < Zurück zur Übersicht

source: User Info
de: Benutzerinformation

source: Group by:
de: Anordnen nach:

source: Update
de: Aktualisieren

source: Group and Compare Users
de: Benutzer anordnen und vergleichen

# tooManyUsers
source: There were too many users:
de: Es gab zu viele Benutzer:

# canOnlyDisplay
source: This tool can only display the following number of users at a time:
de: Sie können höchstens die folgende Anzahl Benutzer gleichzeitig anzeigen:

# newUser
source: Create new user
de: Neuen Benutzer erstellen

source: Usernames:
de: Benutzernamen:

source: Switch user to:
de: Benutzer wechseln zu:

source: [change-to mode]
de: [Wechseln-zu-Modus]

source: [switch-back mode]
de: [Rückschalt-Modus]

# cachedGrouplistsUpdated
source: (All cached group-lists updated.)
de: (Alle gecachten Gruppenlisten aktualisiert.)

source: Result
de: Ergebnis

source: Show information
de: Informationen anzeigen

# sureToDelete
source: Are you sure you want to delete this element?
de: Dieses Element tatsächlich löschen?

source: Delete(!)
de: Löschen(!)

source: Timestamp:
de: Zeitstempel:

source: Username:
de: Benutzername:

source: Who Is Online
de: Wer ist online
