Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_tsfe.xlf
Languages: de

source: Preview
de: Vorschau

# preview_showHiddenPages
source: Show hidden pages
de: Verborgene Seiten anzeigen

# preview_showHiddenRecords
source: Show hidden records
de: Verborgene Datensätze anzeigen

# preview_simulateDate
source: Simulate time
de: Zeitpunkt simulieren

# preview_simulateUserGroup
source: Simulate user group
de: Benutzergruppe simulieren

# cache_noCache
source: No caching
de: Kein Caching

# cache_doit
source: Clear cache now!
de: Cache jetzt löschen!

# cache_clearLevels
source: Clear levels
de: Löschebenen

# cache_cacheEntries
source: Cache entries
de: Cache-Einträge

source: Publish
de: Veröffentlichen

source: Publish levels
de: Veröffentlichungsebenen

# publish_tree
source: Publish pages
de: Veröffentlichte Seiten

# publish_doit
source: Publish now!
de: Jetzt veröffentlichen!

# edit
source: Editing
de: Eingabe

# edit_displayIcons
source: Display edit panels
de: Bearbeitungsleiste anzeigen

# edit_displayFieldIcons
source: Display edit icons
de: Bearbeitungssymbole anzeigen

# edit_editFormsOnPage
source: Editforms on page
de: Eingabeformular auf Webseite

# edit_editNoPopup
source: No popup window
de: Keine Popup-Fenster

# edit_openAB
source: Open TYPO3 Backend
de: TYPO3-Backend öffnen

# edit_recordHistory
source: View record change history
de: Änderungsprotokoll anzeigen

# edit_newContentElement
source: Create new content element
de: Neues Inhaltelement anlegen

# edit_move_page
source: Move page
de: Seite verschieben

# edit_newPage
source: Create new page
de: Neue Seite anlegen

# edit_editPageProperties
source: Edit page properties
de: Seiteneigenschaften bearbeiten

# edit_editPageOverlay
source: Edit properties of translated page
de: Eigenschaften der übersetzten Seite bearbeiten

# edit_db_list
source: Web>List module
de: Modul Web > Liste

# tsdebug_tree
source: Tree display
de: Baumdarstellung

# tsdebug_LR
source: Track content rendering
de: Rendering der Inhalte verfolgen

# tsdebug_forceTemplateParsing
source: Force TS Rendering
de: TS-Rendering erzwingen

# tsdebug_displayTimes
source: Display all times
de: Rendering-Zeiten anzeigen

# tsdebug_displayMessages
source: Display messages
de: Nachrichten anzeigen

# tsdebug_displayContent
source: Display content
de: Inhalte anzeigen

# tsdebug_displayQueries
source: Explain SELECT queries
de: SELECT-Anweisung erläutern

# div_Levels_0
source: This page
de: Diese Seite

# div_Levels_1
source: + 1 sublevel
de: +1 Ebene

# div_Levels_2
source: + 2 sublevels
de: +2 Ebenen

source: Update
de: Aktualisieren

# p_editRecord
source: Edit record
de: Datensatz bearbeiten

# p_moveUp
source: Move up
de: Nach oben verschieben

# p_moveDown
source: Move down
de: Nach unten verschieben

# p_unhide
source: Un-Hide
de: Sichtbar machen

# p_hide
source: Hide
de: Verbergen

# p_newSubpage
source: New subpage
de: Neue Unterseite

# p_newRecordAfter
source: New record after
de: Neuen Datensatz einfügen

# p_delete
source: Delete
de: Löschen

# p_deleteConfirm
source: Are you sure you want to delete this record?
de: Diesen Datensatz tatsächlich löschen?

# p_hideConfirm
source: Hiding a record will make it invisible on the webpage. To edit the hidden record enter the backend or enable the frontend preview. Continue?
de: Das Verbergen eines Datensatzes macht diesen auf der Web-Seite unsichtbar. Um den Datensatz zu bearbeiten, müssen Sie entweder das Backend benutzen oder bei der Frontend-Eingabe die Vorschau einschalten. Fortfahren?
