Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: de

# file_newfolder.description
source: Enter a name for a new file folder in the tree here. If you want to create multiple folders, please select the number of new folders before entering folder names.
de: Geben Sie hier den Namen für einen neuen Ordner an. Wenn Sie mehrere Ordner erstellen möchten, geben Sie bitte <em>vor</em> der Eingabe der Namen die Anzahl an.

# file_newfolder.image_descr
source: To create a new folder you first click the parent folder icon in the folder tree. As the next step you select the number of folders to create and then you enter the new folder names. After pressing the "Create folders" button the folders will appear in the folder tree when you reload it.
de: Um einen neuen Ordner zu erstellen, klicken Sie in der Baumansicht zuerst auf das Symbol des Ordners, in dem der neue Ordner erstellt werden soll. Wählen Sie als nächstes die Anzahl der zu erstellenden Ordner und geben Sie danach die Ordnernamen ein. Klicken Sie auf "Ordner anlegen". Danach müssen Sie die Baumansicht aktualisieren und die Ordner werden angezeigt.

# file_newfile.alttitle
source: Creating a new file
de: Neue Datei erstellen

# file_newfile.description
source: Enter a filename here if you want to create a new text-based file. Notice that it must have one of the endings in the list of text-endings shown above (except "php" endings).
de: Geben Sie hier einen Dateinamen an, wenn Sie eine neue, textbasierte Datei erstellen möchten. Beachten Sie, dass sie eine der Endungen haben muss, die in der Liste oben angezeigt werden (außer der Endung ".php").

# file_newfile.details
source: Newly created files will have the size of 0 (zero). After creating a new file it would be natural that you wanted to edit the file to put content into it. This is done simply by clicking the icon of the file and select "Edit" from the clickmenu.
de: Neue Dateien haben eine Größe von 0 (null). Nachdem Sie eine neue Datei erstellt haben, können Sie sie bearbeiten, um ihr einen Inhalt zu geben. Klicken Sie dazu einfach auf das Symbol der Datei und klicken Sie in dem Menü auf "Bearbeiten".

# file_newfile.image_descr
source: To create a new file, first click the folder icon where you want to create the file. Select "New". Then enter the filename in the dialog in the right frame. After pressing "Create file" you will see a new, empty file in the folder you selected.
de: Um eine neue Datei zu erstellen, klicken Sie zuerst auf das Symbol des Ordners, in dem Sie die Datei erstellen möchten. Wählen Sie "Neu". Geben Sie dann im rechten Bereich des Fensters den Dateinamen ein. Drücken Sie auf "Datei erzeugen" und Sie werden eine neue Datei in dem Ordner sehen, den Sie ausgewählt haben.

# file_rename.alttitle
source: Rename a file or folder
de: Datei oder Ordner umbenennen

# file_rename.description
source: You can rename files or folders in TYPO3 quite easily. Just notice that certain characters are not allowed. So use a-z, numbers, underscores and don't make the names too long. If you enter invalid characters it will be automatically corrected.
de: Sie können Dateien und Ordner in TYPO3 ganz einfach umbenennen. Beachten Sie nur, dass bestimmte Zeichen nicht erlaubt sind. Nutzen Sie die Buchstaben von a bis z, Ziffern, den Unterstrich und machen Sie die Namen nicht zu lang. Wenn Sie ungültige Zeichen eingeben, werden diese automatisch korrigiert.

# file_rename.image_descr
source: To rename a file (or folder for that sake) just click the icon of it, select "Rename" and enter the new name. Notice that restrictions may apply on filenaming, for instance ".php" is usually not a valid extension of a filename for security reasons.
de: Um eine Datei oder einen Ordner umzubenennen, klicken Sie auf sein Symbol, wählen Sie "Umbenennen" und geben Sie den neuen Namen ein. Beachten Sie, dass für Dateinamen Einschränkungen gelten können, so ist z.B. ".php" aus Sicherheitsgründen normalerweise keine erlaubte Endung.

# file_upload.alttitle
source: Uploading files.
de: Dateien hochladen

# file_upload.description
source: Here you can upload one or more files to the server. Start by selecting the number of files to upload, then you begin to select files from your local computer to upload.
de: Hier können Sie eine oder mehrere Dateien auf den Server hochladen. Beginnen Sie, indem Sie die Anzahl der hochzuladenden Dateien auswählen. Wählen Sie dann die Dateien, die Sie hochladen möchten, auf Ihrem Computer aus.

# file_upload.details
source: If the filenames you upload exist already they will be renamed with a numeric suffix, eg. "file_01.jpg". However you can avoid this behaviour if you select "Overwrite existing files" before pressing the "Upload" button. Normally there is a limit to the size of files you can upload. By default PHP will allow you to upload around 2MB. TYPO3 is configured to allow 10MB internally by default. These settings can be changed by your server administrator if you need them changed. Notice that file uploads may take a significant amount of time, even if you have fast internet access via DSL etc. If you have large amount of files you want to upload - or if the files are very large - you should consider using an FTP client instead. It depends not on TYPO3 but on the webserver whether this is an options for you.
de: Wenn die Dateinamen, der Dateien, die Sie hochladen, bereits existieren, werden sie umbenannt durch Anhängen einer Zahl, z.B. "Datei_01.jpg". Dieses Verhalten können Sie verhindern, indem Sie "Überschreibe vorhandene Dateien" auswählen, bevor Sie auf "Hochladen" klicken. Normalerweise gibt es eine Größenbeschränkung bei den Dateien, die Sie hochladen können. Standardmäßig erlaubt Ihnen PHP etwa 2 MB hochzuladen. TYPO3 ist standardmäßig so konfiguriert dass es bis zu 10 MB unterstützt. Diese Einstellungen können von Ihrem Server-Administrator angepasst werden, falls nötig. Beachten Sie, dass das Hochladen von Dateien einige Zeit benötigen kann, auch wenn Sie eine schnelle Internetverbindung wie DSL nutzen. Wenn Sie große Mengen an Dateien hochladen möchten oder wenn eine Datei sehr groß ist, dann überlegen Sie, ob Sie zum Hochladen statt TYPO3 nicht einen FTP-Klienten nutzen möchten. Ob das für Sie möglich ist, hängt nicht von TYPO3, sondern von Ihrem Web-Server ab.

# _file_upload.seeAlso
source: xMOD_csh_corebe:filelist_module, Howto upload files | http://typo3.org/documentation/document-library/doc_tut_quickstart/Uploading_images_to/
de: xMOD_csh_corebe:filelist_module, Anleitung zum Hochladen von Dateien | http://typo3.org/documentation/document-library/doc_tut_quickstart/Uploading_images_to/

# file_upload.image_descr
source: To upload files, first click the folder icon where you want to upload to. From the clickmenu you select "Upload files". In the next screen you select the number of files and click the "Browse..." buttons to select files from your computer. Finally you click the "Upload files" button to start the upload process (which might take some minutes with large files!)
de: Um Dateien hochzuladen, klicken Sie zuerst auf das Symbol des Ordners, in den Sie die Dateien hochladen möchten. Wählen Sie im Menü "Dateien hochladen". Wählen Sie im folgenden Dialog die Anzahl der Dateien und klicken Sie auf "Durchsuchen...", um die Dateien auszuwählen. Drücken Sie schließlich auf "Hochladen", um das Hochladen zu starten. (Dieser Vorgang kann bei großen Dateien einige Minuten dauern!)

# wizard_forms_wiz.alttitle
source: Forms Wizard
de: Formularassistent

# wizard_forms_wiz.description
source: The Form Wizard enables you to create form elements through a nice interface rather than "coding" a certain syntax for the elements.
de: Mit Hilfe des Formularassistenten können Formulare über eine benutzerfreundliche Bedieneroberfläche statt durch "Programm-Code" mit einer bestimmten Elementesyntax erstellt werden.

# wizard_forms_wiz.details
source: To the left in the form wizard you can add, delete and move items in the form around. In the Element Type column you can select between various kinds of form elements such as regular input fields, text areas, selector boxes, checkboxes etc. Each form element also has a label field where you can enter a title for the field. Some fields also provide the possibility of checking for "required" values. In the "Detailed" configuration column the options will depend on the form field type selected in the "Element type" column. The options here can be to enter elements for a selector box or enter the width of an input field. The "Field:" box is important since it defines the technical name of the form field. This is the name that people will see when they receive an email from the mail form. <b>Custom applications of the form wizard</b> The most typical application of the Form wizard is with Content Elements of the type "Form" but the wizard can be used for other custom applications as well. Technical details about this is available in the links below.
de: Auf der linken Seite des Formularassistenten können Elemente des Formulars hinzugefügt, gelöscht und verschoben werden. In der Spalte Elementtyp kann aus verschiedenen Typen von Formularelementen ausgewählten, z.B. Eingabefeldern, Textbereiche, Auswahlfelder, Markierungsfelder usw. Jedes Formularelement besitzt darüber hinaus ein Beschreibungsfeld, mit dem sich dem Feld ein Titel zuweisen lässt. Manche Felder bieten die Möglichkeit, eine Prüfung auf obligatorische Werte durchzuführen. In der Konfigurationsspalte "Details" hängen die Optionen vom unter "Elementtyp" ausgewählten Typ des Formularfeldes ab. Die Optionen können z.B. die Eingabe von Einträgen für ein Auswahlfeld oder der Breite eines Eingabefeldes umfassen. Das Feld "Feld:" ist insofern von großer Wichtigkeit, als es die technische Bezeichnung des Formularfeldes festlegt. Diese Bezeichnung wird in E-Mails angegeben, die vom E-Mail-Formular generiert wurden. <b>Benuterdefinierte Anwendungen des Formularassistenten</b> Die gebräuchliste Anwendung des Formularassistenten erfolgt mit Inhaltselementen vom Typ Formular, jedoch kann der Formularassistent auch im Zusammenhang mit anderen, benutzerdefinierten Anwendungen eingesetzt werden. Technische Einzelheiten dazu finden Sie unter nachstehenden Links.

# _wizard_forms_wiz.seeAlso
source: xMOD_csh_corebe:wizard_table_wiz, Form Wizard details [Technical]| http://typo3.org/documentation/document-library/doc_core_api/Wizards_Configuratio/,
de: xMOD_csh_corebe:wizard_table_wiz, Details zum Formularassistent [Technisch]| http://typo3.org/documentation/document-library/doc_core_api/Wizards_Configuratio/,

# wizard_forms_wiz.image_descr
source: This is how the form wizard looks in action. Using the form fields for setting up forms rather than coding them is much easier. Usually you enter the Form Wizard by clicking the form wizard icon next for a text field like this. Notice the contents of the field to the left of the icon - this is the "raw codes" that the Form Wizard saves you from editing manually!
de: So sieht der Formularassistent im Einsatz aus. Es ist wesentlich einfacher, die Formularfelder zum Gestalten von Formularen zu verwenden, als diese selbst zu programmieren. Normalerweise ruft man den Formularassistenten über das Assistentensymbol neben einem Textfeld wie diesem auf. Beachten Sie den Inhalt des Feldes zur Linken des Symbols - dabei handelt es sich um den Roh-Code, vor dessen Erstellung Sie der Assistent bewahrt!

# wizard_forms_wiz_buttons.alttitle
source: Form Wizard buttons
de: Schaltflächen des Formularassistenten

# wizard_forms_wiz_buttons.description
source: Use the refresh button to update the form (without saving it), for instance if you changed a field type or so. When you are done you should click one of the real save buttons to save and return to the form from which you entered the wizard. The information from this wizard should then be saved into the field the wizard was associated with.
de: Verwenden Sie die Schaltfläche "Aktualisieren", um das Formular ohne Speichern auf den neuesten Stand zu bringen. Nach Fertigstellung der Arbeiten sollte eine der Schaltflächen zum tatsächlichen Speichern verwendet werden, um die Änderungen zu speichern und zum Formular zurückzukehren, von dem aus der Assistent aufgerufen wurde. Die Daten des Assistenten sollten dann im Feld gespeichert werden, dem der Assistent zugeordnet ist.

# wizard_forms_wiz_formmail_info.alttitle
source: Mailform Info Fields
de: Informationsfelder E-Mail-Formular

# wizard_forms_wiz_formmail_info.description
source: These fields specifically apply to the usage of the form wizard with Content Elements of the type "Form". They allow you to enter information like the subject line of the email sent, the recipient address and whether the sent email should be in HTML or not.
de: Diese Felder beziehen sich auf die Verwendung des Formularassistenten mit Inhaltselementen vom Typ "Formular". Damit ist es möglich, Informationen wie die Betreffzeile einer E-Mail und die Empfängeradresse anzugeben, sowie, ob die E-Mail im HTML-Format gesendet werden soll oder nicht.

# wizard_forms_wiz_formmail_info.details
source: Notice: In order to enter a recipient address you need access to the "Subheader" field in the Content Elements. Yes, its quite strange, but so it is. Ask your administrator for access if you don't have it.
de: Hinweis: Zum Eingeben der Empfängeradresse wird das Zugriffrecht auf das Feld "Untertitel" des Inhaltselements benötigt. Seltsam, aber so ist es nun einmal. Wenden Sie sich ggf. an den Administrator.

# _wizard_forms_wiz_formmail_info.seeAlso
source: Howto create Mail Forms | http://typo3.org/documentation/document-library/doc_tut_quickstart/Email_form/
de: Anleitung zum Erstellen von Mailformularen | http://typo3.org/documentation/document-library/doc_tut_quickstart/Email_form/

# wizard_table_wiz.alttitle
source: Table wizard
de: Tabellenassistent

# wizard_table_wiz.description
source: The table wizard helps you create tables that are normally stored in the database by XML or a syntax where each line represents a row and each cell is divided by a vertical line sign, "|". This wizard makes it transparent for you.
de: Der Tabellenassistent hilft bei der Erstellung von Tabellen, die in der Datenbank normalerweise als XML-Daten oder in einer Syntax gespeichert werden, bei der jede Zeile des Textes eine Tabellenzeile repräsentiert und jede Zelle durch eine vertikale Linie ("|") abgetrennt wird. Dieser Assistent übersetzt dies für Sie.

# wizard_table_wiz.details
source: The wizard is quite simple. By the buttons to the left and in the bottom you can add, delete and move columns and rows in the table. You can also disable the setting "Small fields" below the wizard if you want larger textarea fields for the editing.
de: Der Assistent ist einfach zu handhaben. Mit Hilfe der Schaltflächen links und unten können Spalten und Zeilen der Tabelle hinzugefügt, daraus gelöscht und darin verschoben werden. Wer einen größeren Textbereich für die Bearbeitung bevorzugt, kann die Einstellung "Kleine Felder" unterhalb des Assistenten deaktivieren.

# _wizard_table_wiz.seeAlso
source: xMOD_csh_corebe:wizard_forms_wiz, Table Wizard details [Technical]| http://typo3.org/documentation/document-library/doc_core_api/Wizard_scripts_in_th/
de: xMOD_csh_corebe:wizard_forms_wiz, Details zum Tabellenassistent [Technisch]| http://typo3.org/documentation/document-library/doc_core_api/Wizard_scripts_in_th/

# wizard_table_wiz_buttons.alttitle
source: Table wizard buttons
de: Schaltflächen des Tabellenassistenten

# wizard_table_wiz_buttons.description
source: Use the refresh button to update the form without saving it. When you are done you should click one of the real save buttons to save and return to the form from which you entered the wizard. The information from this wizard should then be saved into the field the wizard was associated with.
de: Verwenden Sie die Schaltfläche Aktualisieren, um das Formular ohne Speichern auf den neuesten Stand zu bringen. Nach Fertigstellung der Arbeiten sollte eine der Schaltflächen zum tatsächlichen Speichern verwendet werden, um die Änderungen zu speichern und zum Formular zurückzukehren, von dem aus der Assistent aufgerufen wurde. Die Daten des Assistenten sollten dann im Feld gespeichert werden, dem der Assistent zugeordnet ist.

# shortcuts.alttitle
source: Backend Shortcuts
de: Backend-Verweise

# shortcuts.description
source: You can create shortcuts to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
de: Verweise auf Module können mit TYPO3 sehr einfach erstellt werden. Der Vorteil ist, dass damit mit nur <em>einem</em> Mausklick zwischen Bildschirmen gewechselt werden kann, anstatt sich mit mehreren Klicks durch Backend-Module usw. bewegen zu müssen. Der Rahmen enthält darüber hinaus auch ein Feld zum Eingeben einer Seiten- oder Datensatz-ID, die bearbeitet oder nach der gesucht werden soll.

# shortcuts.details
source: In order to create a shortcut it must be supported by the module you want to create the shortcut to. Whether shortcuts are supported can be seen in the bottom of a module. If there is a small "shortcut" icon you can click it to create the shortcut. In the shortcut frame you can also enter a page id to edit in the "Edit Page ID" box. This will load the current page module with the id provided in the box. Only "Admin"-users can access the shortcut frame in TYPO3 by default. Other users must have it enabled by the User TSconfig option, "options.shortcutFrame = 1". See link below for details (Admins). Editing pages from an id is easy with the shortcut frame. Simply enter an integer number and that page will be loaded for editing. If you enter "[table]:[id]" then it will try to edit a record from the [table] table, for example "tt_content:123" will look for content element 123 (for admins only). Finally, if you enter a string that doesn't match a page or other record the Web>List module will be invoked doing a search in the first database mount you have.
de: Um einen Verweis erstellen zu können, muss dies von dem Modul unterstützt werden, auf das ein Verweis erstellt werden soll. Ob Verweise unterstützt werden, lässt sich unten im Modul erkennen. Befindet sich dort ein kleines Verweissymbol, kann damit durch Anklicken ein Verweis erzeugt werden. Im Verweisrahmen kann unter "Seiten-ID bearbeiten" die Seiten-ID einer zu bearbeitenden Seite eingegeben werden. Hierdurch wird das aktuelle Seitenmodul für die angegebene ID geladen. Standardmäßig haben unter TYPO3 nur Administratoren Zugriff auf den Verweisrahmen. Für andere Benutzer muss er erst über eine Benutzer-TSconfig-Option, "options.shortcutFrame = 1", aktiviert werden. Weitere Informationen siehe nachstehenden Link (Administratoren). Das Bearbeiten von Seiten über eine ID ist über den Verweisrahmen sehr einfach. Geben Sie einfach eine ganze Zahl ein und die entsprechende Seite wird zur weiteren Bearbeitung geladen. Bei Eingabe von "[tabelle].[id]" wird versucht, einen Datensatz der Tabelle [tabelle] zu bearbeiten. Beispielsweise ruft "tt_content:123" das Inhaltselement 123 auf (nur für Administratoren). Gibt man eine Zeichenkette ein, die nicht mit einer Seite oder einem Inhaltselement übereinstimmt, so wird das Modul "Web > Liste" aufgerufen und führt eine Suche in der ersten vorhandenen Datenbankfreigabe durch.

# _shortcuts.seeAlso
source: User TSconfig ->SETUP | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/
de: Benutzer-TSconfig ->SETUP | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/

# shortcuts.image_descr
source: To create a shortcut to a page, just click the short cut icon usually found in the bottom of pages. You will have to confirm the creation of the shortcut. It is nothing dangerous - only annoying to clean up if you happen to create shortcuts against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the shortcut frame reload and a new icon (the module icon) appear. If you click this icon you will now jump to the page you created the shortcut from! You can name shortcuts, you can even group them and share them. If you want to edit or delete a shortcut you select the "Edit" checkbox and then click the shortcut icon. This will reload the shortcut frame so you get a field for entering a title. You can also delete all shortcuts in a "group" - here, just click the "0" (zero) to the left of the icons and you will remove all shortcuts in the group.
de: Um einen Verweis auf eine Seite zu erstellen, klicken Sie auf das Verweis-Symbol, das Sie oben auf jeder Seite finden. Bestätigen Sie die Erstellung des Verweises. Es ist nicht gefährlich, sondern nur lästig Verweise wieder aufzuräumen, die Sie gegen Ihren Willen erstellt haben. Klicken Sie einfach auf "OK". Wenn Sie auf "OK" geklickt haben, sollten Sie sofort sehen, dass das Menü sich aktualisiert und ein neues Symbol (das Modul-Symbol) erscheint. Wenn Sie dieses Symbol anklicken, springen Sie zu der Seite, auf der Sie den Verweis erstellt haben! Sie können Verweise umbenennen, Sie können sie gruppieren und gemeinsam benutzen. Wenn Sie einen Verweis bearbeiten möchten, wählen Sie das "Bearbeiten"-Symbol. Sie können dann den Namen des Verweises und die Gruppe, in der er erscheinen soll, verändern. Um einen Verweis zu löschen, klicken Sie auf das "Löschen"-Symbol und bestätigen Sie das Löschen durch einen Klick auf "OK".

# bookmarks.alttitle
source: Backend Bookmarks
de: Backend-Lesezeichen

# bookmarks.description
source: You can create bookmarks to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
de: Sie können Lesezeichen zu Modulen in TYPO3 recht einfach erstellen. Der Vorteil ist, dass Sie zwischen Ansichten in TYPO3 mit <em>nur einem</em> Klick anstatt mit mehreren Klicks durch mehrere Module wechseln können. Sie können sogar eine Seiten- oder Datensatz-ID angeben, die Sie bearbeiten möchten. Zudem können Sie Datensätze durchsuchen.

# bookmarks.details
source: In order to create a bookmark it must be supported by the module you want to create the bookmark to. Whether bookmarks are supported can be seen in the top of a module. If there is a small star icon you can click it to create the bookmark.
de: Um ein Lesezeichen erstellen zu können, muss das Modul, auf das das Lesezeichen zeigen soll, dies unterstützen. Sie können dies am oberen Rand des Moduls erkennen: Wenn sich dort ein kleines Sternchen-Symbol befindet, können Sie es anklicken, um ein Lesezeichen zu erstellen.

# _bookmarks.seeAlso
source: User TSconfig ->SETUP | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/
de: Benutzer-TSconfig ->SETUP | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/
