Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_core.xlf
Languages: de

# labels.openInNewWindow
source: Open in new window
de: In neuem Fenster öffnen

# labels.goBack
source: Go back
de: Zurück

# labels.makeShortcut
source: Create a shortcut to this page?
de: Einen Verweis auf diese Seite erzeugen?

# labels.makeBookmark
source: Create a bookmark to this page
de: Ein Lesezeichen für diese Seite erzeugen

# labels.lockedRecord
source: The user '%s' began to edit this record %s ago.
de: Der Benutzer "%s" hat mit der Bearbeitung dieses Datensatzes vor %s begonnen.

# labels.lockedRecord_content
source: The user '%s' began to edit content on this page %s ago.
de: Der Benutzer "%s" hat mit der Bearbeitung dieser Seite vor %s begonnen.

# labels.lockedRecordUser
source: The %s '%s' began to edit this record %s ago.
de: Der %s "%s" hat mit der Bearbeitung dieses Datensatzes vor %s begonnen.

# labels.lockedRecordUser_content
source: The %s '%s' began to edit content on this page %s ago.
de: Der %s "%s" hat mit der Bearbeitung dieser Seite vor %s begonnen.

# labels.user
source: User
de: Benutzer

# labels.beUser
source: BE-User
de: BE-Benutzer

# labels.feUser
source: FE-User
de: FE-Benutzer

# labels.unknownUser
source: -Unknown-
de: -Unbekannt-

# labels.showRecords
source: Show records
de: Datensätze anzeigen

# labels.path
source: Path
de: Pfad

# labels.resetFilter
source: Reset Filter
de: Filter entfernen

# labels.table
source: Table
de: Tabelle

# labels.upOneLevel
source: Up one level
de: Eine Ebene höher gehen

# labels.expandTable
source: Expand table
de: Tabelle ausklappen

# labels.collapseTable
source: Collapse table
de: Tabelle einklappen

# labels.enterSearchString
source: Search String:
de: Suchbegriff:

# labels.enterSearchLevels
source: This page|1 level down|2 levels down|3 levels down|4 levels down
de: Diese Seite|Inkl. 1 Ebene|Inkl. 2 Ebenen|Inkl. 3 Ebenen|Inkl. 4 Ebenen

# labels.noEditPermission
source: Sorry, you didn't have proper permissions to perform this change.
de: Sie haben nicht die nötigen Rechte, um diese Änderung durchzuführen.

# labels.fieldsMissing
source: The fields marked with a yellow exclamation mark are not yet correctly filled in. Please complete them properly.
de: Mit einem gelben Ausrufezeichen markierte Felder in diesem Formular wurden nicht ordnungsgemäß ausgefüllt. Bitte füllen Sie sie korrekt aus.

# labels.fieldsChanged
source: There are unsaved changes in the form! Do you want to continue WITHOUT saving?
de: Das Formular enthält nicht gespeicherte Änderungen! Ohne Speichern fortfahren?

# labels.noRTEfound
source: Notice: This field can only be edited with a Rich Text Editor. No editor is currently available or enabled.
de: Hinweis: Dieses Feld kann nur mit einem Rich-Text-Editor (RTE) bearbeitet werden. Ein solcher Editor ist jedoch momentan nicht verfügbar oder der RTE wurde deaktiviert.

# labels.showPalettes
source: Show secondary options (palettes)
de: Zweite Optionspalette anzeigen

# labels.showDescriptions
source: Show field descriptions
de: Feldbeschreibung anzeigen

# labels.disableRTE
source: Disable Rich Text Editor (RTE)
de: Rich-Text-Editor (RTE) deaktivieren

# labels._CONTROL_
source: Control
de: Bedienungselement

# labels._PATH_
source: Path
de: Pfad

# labels._LOCALIZATION_
source: Localization
de: Lokalisierung

# labels.setFields
source: Set fields
de: Felder setzen

# labels.search
source: Search
de: Suchen

# labels.author
source: Author:
de: Autor:

# labels.note
source: Note:
de: Bemerkung:

# labels.category
source: Category:
de: Kategorie:

# labels.reload
source: Reload
de: Neu laden

# labels.csv
source: Download CSV file
de: CSV-Datei herunterladen

# labels.clear_cache
source: Clear cache for this page
de: Cache dieser Seite löschen

# labels.no_title
source: No title
de: Kein Titel

# labels.cancel
source: Cancel
de: Abbruch

# labels.hidden
source: Hidden
de: Verborgen

# labels.endtime
source: End
de: Stopp

# labels.minutesHoursDaysYears
source: min| hrs| days| yrs| min| hour| day| year
de: Min| Std| Tage| Jahre

# labels.menu
source: Menu:
de: Menü:

# labels.showPage
source: View webpage
de: Web-Seite anzeigen

# labels.showList
source: Show record list
de: Datensatzliste anzeigen

# labels.days
source: days
de: Tage

# labels.depth_0
source: This page
de: Diese Seite

# labels.depth_1
source: 1 level
de: 1 Ebene

# labels.depth_2
source: 2 levels
de: 2 Ebenen

# labels.depth_3
source: 3 levels
de: 3 Ebenen

# labels.depth_4
source: 4 levels
de: 4 Ebenen

# labels.depth_infi
source: Infinite
de: Unendlich

# labels.allow
source: Allow
de: Erlauben

# labels.deny
source: Deny
de: Verbieten

# labels.enabled
source: Enabled
de: Aktiviert

# labels.show
source: Show
de: Anzeigen

# labels.generalTab
source: General
de: Allgemein

# labels.refresh
source: Reload the tree from server
de: Baumansicht aktualisieren

# labels.temporaryDBmount
source: Cancel temporary DB mount
de: Temporäre Datenbankfreigabe aufheben

# labels.refreshList
source: Reload list from server
de: Liste neu laden

# labels.close
source: Close
de: Schließen

# labels.new
source: NEW
de: NEU

# labels.createNewPage
source: Create new %s
de: %s neu erstellen

# labels.createNewRecord
source: Create new %s on page "%s"
de: %s auf Seite "%s" neu erstellen

# labels.createNewRecordRootLevel
source: Create new %s on root level
de: %s auf Wurzelebene neu erstellen

# labels.editPage
source: Edit %s "%s"
de: %s "%s" bearbeiten

# labels.editRecord
source: Edit %s "%s" on page "%s"
de: %s "%s" auf Seite %s bearbeiten

# labels.editRecordNoTitle
source: Edit %s on page "%s"
de: %s auf Seite "%s" bearbeiten

# labels.editRecordRootLevel
source: Edit %s "%s" on root level
de: %s "%s" auf Wurzelebene bearbeiten

# labels.rootLevel
source: root level
de: Wurzelebene

# labels.addnew
source: Add new
de: Neu hinzufügen

# labels.toggleall
source: Toggle all
de: Alle umschalten

# labels.selected
source: Selected Items
de: Ausgewählte Objekte

# labels.items
source: Available Items
de: Verfügbare Objekte

# labels.remove_selected
source: Remove selected items
de: Ausgewähltes Objekt löschen

# labels.move_to_top
source: Move selected items to top
de: Ausgewählte Objekte zum Anfang verschieben

# labels.move_up
source: Move selected items upwards
de: Ausgewählte Objekte nach oben verschieben

# labels.move_down
source: Move selected items downwards
de: Ausgewählte Objekte nach unten verschieben

# labels.move_to_bottom
source: Move selected items to bottom
de: Ausgewählte Objekte zum Ende verschieben

# labels.move
source: Move this item
de: Dieses Objekt verschieben

# labels.browse_file
source: Browse for files
de: Dateien durchblättern

# labels.browse_db
source: Browse for records
de: Datensätze durchblättern

# labels.clipInsert_file
source: Insert %s file(s) from the clipboard
de: %s Datei(en) aus der Zwischenablage einfügen

# labels.clipInsert_db
source: Insert %s record(s) from the clipboard
de: %s Datensätze aus der Zwischenablage einfügen

# labels.generalOptions
source: General options:
de: Allgemeine Optionen:

# labels.generalOptions_more
source: General options (continued):
de: Allgemeine Optionen (Fortsetzung):

# labels.allTables
source: [All tables]
de: [Alle Tabellen]

# labels.moreOptions
source: More options...
de: Weitere Optionen...

# labels.noMatchingValue
source: INVALID VALUE ("%s")
de: AKTUELLER WERT IST NICHT ERLAUBT (%s)

# labels.thumbmode_clip
source: Show Thumbnails on ClipBoard
de: Vorschaubilder in der Zwischenablage anzeigen

# labels.copymode
source: Copy items instead of moving them
de: Objekte kopieren statt zu verschieben

# labels.clipNoEl
source: No elements
de: Keine Elemente

# labels.cliptabs
source: Clipboard #
de: Zwischenablage Nr.

# labels.removeItem
source: Remove item
de: Objekt löschen

# labels.holdDownCTRL
source: Important: Hold down the CTRL key while toggling elements in this list!
de: Achtung: Bei Änderung innerhalb dieser Liste STRG-Taste gedrückt halten!

# labels.revertSelection
source: Revert selection
de: Auswahl rückgängig machen

# labels.setAllCheckboxes
source: Select All Checkboxes
de: Alle Markierungsfelder auswählen

# labels.checkAll
source: Check all
de: Alle auswählen

# labels.uncheckAll
source: Uncheck all
de: Keine auswählen

# labels.changeInOrig
source: Changed in original translation
de: Im Original geändert

# labels.expandAll
source: Expand all
de: Alle anzeigen

# labels.new_section
source: Create new:
de: Neu erstellen:

# labels.count
source: Quantity:
de: Menge:

# labels.findRecord
source: Find records
de: Datensätze suchen

# labels.noRecordFound
source: No record found
de: Kein Datensatz gefunden

# alttext.suggestSearching
source: Searching...
de: Suche läuft...

# ver.mgm
source: Version Management
de: Versionsverwaltung

# ver.selVer
source: Select version:
de: Version auswählen:

# ver.swap
source: Swap/Publish
de: Austauschen/Veröffentlichen

# ver.swapPage
source: Publish this version of the page including content
de: Diese Version der Seite inklusive Inhalt veröffentlichen

# labels.referencesToRecord
source: (There are %s reference(s) to this record!)
de: (Auf diesen Datensatz zeigen %s Referenzen!)

# labels.translationsOfRecord
source: (This record has %s translation(s) which will be deleted, too!)
de: (Für diesen Datensatz gibt es %s Übersetzung(en), die ebenfalls gelöscht werden!)

# show_item.php.viewItem
source: View Item
de: Element anzeigen

# show_item.php.referencesToThisItem
source: References to this item:
de: Referenzen auf dieses Element:

# show_item.php.referencesFromThisItem
source: References from this item:
de: Referenzen von diesem Element aus:

# show_item.php.file
source: File
de: Datei

# show_item.php.dimensions
source: Dimensions
de: Ausmaße

# show_item.php.filesize
source: Size
de: Dateigröße

# show_item.php.pixels
source: Pixels
de: Pixel

# show_item.php.files
source: files
de: Dateien

# show_item.php.cannotDisplayArchive
source: Sorry, TYPO3_CONF_VARS[BE][disable_exec_function] was set, so cannot display content of archive file.
de: Es wurde leider TYPO3_CONF_VARS[BE][disable_exec_function] gesetzt, daher kann der Inhalt der Archivdatei nicht angezeigt werden.

# show_item.php.table
source: Table:
de: Tabelle:

# show_item.php.title
source: Title:
de: Titel:

# show_item.php.field
source: Field:
de: Feld:

# show_item.php.flexpointer
source: Flexpointer:
de: Flexzeiger:

# show_item.php.softrefKey
source: Softref Key:
de: Softref-Schlüssel:

# show_item.php.sorting
source: Sorting:
de: Sortierung:

# show_item.php.refTable
source: Ref Table:
de: Ref-Tabelle:

# show_item.php.ftp_area
source: FTP AREA
de: FTP-BEREICH

# db_new.php.pagetitle
source: New record
de: Neuer Datensatz

# db_new.php.after
source: after
de: nach

# db_new.php.inside
source: inside
de: in

# file_upload.php.pagetitle
source: Upload files
de: Dateien hochladen

# file_upload.php.submit
source: Upload files
de: Hochladen

# file_upload.php.files
source: files
de: Dateien

# file_upload.php.number_of_files
source: Number of files:
de: Anzahl Dateien:

# file_rename.php.pagetitle
source: Rename
de: Umbenennen

# file_rename.php.submit
source: Rename
de: Umbenennen

# file_edit.php.pagetitle
source: Edit
de: Bearbeiten

# file_edit.php.submit
source: Save
de: Speichern

# file_edit.php.saveAndClose
source: Save and Close
de: Speichern und schließen

# file_edit.php.coundNot
source: This filetype cannot be edited.<br />The file must have an extension like:<br /><br /> <b>%s</b>
de: Dieser Dateityp kann nicht bearbeitet werden. Folgende Dateitypen werden unterstützt: %s

# file_newfolder.php.pagetitle
source: New file or folder
de: Neuer Ordner bzw. neue Datei

# file_newfolder.php.submit
source: Create folders
de: Ordner anlegen

# file_newfolder.php.folders
source: folders
de: Ordner

# file_newfolder.php.newfile_submit
source: Create file
de: Datei erzeugen

# file_newfolder.php.newfile
source: Create new textfile
de: Textdatei erzeugen

# file_newfolder.php.number_of_folders
source: Number of folders:
de: Anzahl Ordner:

# file_clipupload.php.warning_head
source: Upload path error
de: Pfadfehler beim Hochladen

# file_clipupload.php.warning
source: No upload-folder is found. You should create a TEMP-folder ("_temp_") in the root of one of your mounts first!
de: Kein Ordner zum Hochladen gefunden. Legen Sie zuerst einen TEMP-Ordner in einem Ihrer Hauptverzeichnisse an ("_temp_")!

# mess.redraw
source: Redrawing the page will discard the current data. Do you want to continue?
de: Durch das Neuzeichnen der Seite gehen die aktuellen Daten verloren. Den Vorgang fortsetzen?

# mess.delete
source: Are you sure you want to delete "%s"?
de: "%s" tatsächlich löschen?

# mess.deleteClip
source: Are you sure you want to delete ALL selected elements (%s) on the clipboard?
de: Alle markierten Elemente (%s) aus der Zwischenablage entfernen?

# mess.refresh_login
source: Your login has probably expired. Do you want to refresh it now?
de: Ihre Anmeldung ist abgelaufen. Die Anmeldung erneuern?

# mess.refresh_login_refresh_button
source: Stay logged in!
de: Angemeldet bleiben!

# mess.refresh_logout_button
source: Logout
de: Abmelden

# mess.refresh_direct_logout_button
source: No, log out.
de: Nein, abmelden.

# mess.refresh_login_countdown
source: {0} seconds
de: {0} Sekunden

# mess.refresh_login_countdown_singular
source: {0} second
de: {0} Sekunde

# mess.refresh_login_logging_in
source: Logging in...
de: Anmeldung läuft...

# mess.refresh_login_failed
source: Login failed
de: Fehler

# mess.refresh_login_failed_message
source: Password not correct.
de: Das Passwort ist falsch.

# mess.refresh_login_title
source: Refresh Login to TYPO3 (User: %s)
de: Anmeldung an TYPO3 erneuern (Benutzer: %s)

# mess.refresh_login_username
source: Username
de: Benutzername

# mess.refresh_login_password
source: Password
de: Passwort

# mess.refresh_login_button
source: Login
de: Anmelden

# mess.refresh_login_emptyPassword
source: Empty password is not allowed!
de: Leeres Passwort nicht erlaubt!

# mess.please_wait
source: Please wait ...
de: Bitte warten...

# mess.be_locked
source: The TYPO3 backend is currently locked for maintenance. Leave this browser window open and the backend will automatically become available again once maintenance is complete.
de: Das TYPO3-Backend ist derzeit wegen Wartungsarbeiten gesperrt. Wenn Sie dieses Browserfenster geöffnet lassen, steht Ihnen das Backend automatisch wieder zur Verfügung, sobald die Wartungsarbeiten beendet sind.

# mess.login_about_to_expire
source: Your TYPO3 login is about to expire. Please confirm that you want to stay logged in.
de: Ihre Anmeldung an TYPO3 läuft ab. Bestätigen Sie bitte, wenn Sie weiterhin angemeldet bleiben wollen.

# mess.login_about_to_expire_title
source: TYPO3 login expiration notice
de: Hinweis zum Ablauf der TYPO3-Anmeldung

# mess.login_expired
source: Your TYPO3 login has expired. You need to login again if you want to continue. Otherwise you can close the current browser window.
de: Ihre TYPO3-Anmeldung ist abgelaufen. Wenn Sie fortfahren möchten, ist eine erneute Anmeldung erforderlich. Andernfalls können Sie das aktuelle Browserfenster schließen.

# mess.noSelItemForEdit
source: Please select one or more items in the list before you can edit.
de: Sie müssen mindestens ein Element auswählen, bevor Sie mit der Bearbeitung beginnen.

# mess.onChangeAlert
source: This change will affect which fields are available in the form. Would you like to save now in order to refresh the display?
de: Diese Änderung beeinflusst die zur Verfügung stehenden Eingabefelder. Die Änderungen speichern und die Anzeige aktualisieren?

# mess.move_into
source: Move "%s" into "%s"?
de: "%s" nach "%s" verschieben?

# mess.move_after
source: Move "%s" to after "%s"?
de: "%s" hinter "%s" verschieben?

# mess.copy_into
source: Copy "%s" into "%s"?
de: "%s" nach "%s" kopieren?

# mess.copy_after
source: Copy "%s" to after "%s"?
de: "%s" hinter "%s" kopieren?

# mess.copycb_into
source: Copy all elements (%s) from the clipboard into "%s"?
de: Alle Objekte (%s) aus der Zwischenablage nach "%s" kopieren?

# mess.copycb_after
source: Copy all elements (%s) from the clipboard to the position after "%s"?
de: Alle Objekte (%s) aus der Zwischenablage hinter "%s" kopieren?

# mess.movecb_into
source: Move all elements (%s) from the clipboard into "%s"?
de: Alle Objekte (%s) aus der Zwischenablage nach "%s" verschieben?

# mess.movecb_after
source: Move all elements (%s) from the clipboard to the position after "%s"?
de: Alle Objekte (%s) aus der Zwischenablage hinter "%s" verschieben?

# rm.menu
source: [menu]
de: [Menü]

# rm.saveDoc
source: Save document
de: Dokument speichern

# rm.saveDocShow
source: Save document and view page
de: Dokument speichern und Web-Seite anzeigen

# rm.saveCloseDoc
source: Save and close document
de: Dokument speichern und schließen

# rm.translationSaveDoc
source: Translation finished, save and close
de: Übersetzung beendet, speichern und schließen

# rm.translationSaveDocClear
source: Translation NOT finished, Save
de: Übersetzung NICHT beendet, speichern

# rm.saveCloseAllDocs
source: Save and close all documents
de: Alle Dokumente speichern und schließen

# rm.saveNewDoc
source: Save document and create a new one
de: Dokument speichern und neues erstellen

# rm.closeDoc
source: Close document
de: Dokument schließen

# rm.closeAllDocs
source: Close all documents
de: Alle Dokumente schließen

# rm.clearCache_clearCache
source: Clear cache
de: Cache löschen

# rm.clearCache_thisPage
source: This page
de: Diese Seite

# rm.clearCache_all
source: Clear FE cache
de: Alle Caches löschen

# rm.clearCache_pages
source: Clear Page Cache
de: Seiten-Cache löschen

# rm.clearCache_allTypo3Conf
source: Clear cache in typo3conf/
de: Konfigurations-Cache löschen

# rm.clearCacheMenu_all
source: Clear all caches
de: Alle Caches löschen

# rm.clearCacheMenu_pages
source: Clear page content cache
de: Seiteninhalts-Cache löschen

# rm.clearCacheMenu_allTypo3Conf
source: Clear configuration cache
de: Konfigurations-Cache löschen

# rm.adminFunctions
source: Admin functions
de: Admin-Funktionen

# rm.edit
source: Edit
de: Bearbeiten

# rm.delete
source: Delete
de: Löschen

# buttons.logout
source: Logout
de: Abmelden

# buttons.exit
source: Exit
de: Verlassen

# buttons.selMenu_modules
source: MODULES
de: MODULE

# buttons.clear
source: Clear
de: Löschen

# buttons.clipboard
source: Clipboard
de: Zwischenablage

# cm.copy
source: Copy
de: Kopieren

# cm.cut
source: Cut
de: Ausschneiden

# cm.view
source: Show
de: Ansehen

# cm.edit
source: Edit
de: Bearbeiten

# cm.new
source: New
de: Neu

# cm.pasteinto
source: Paste into
de: Einfügen in

# cm.pasteafter
source: Paste after
de: Einfügen nach

# cm.select
source: Select
de: Auswählen

# cm.deselect
source: Deselect
de: Auswahl aufheben

# cm.selectto
source: Select to
de: Auswählen bis

# cm.deselectto
source: Deselect to
de: Ausw. aufheben bis

# cm.delete
source: Delete
de: Löschen

# cm.hide
source: Hide
de: Verbergen

# cm.unhide
source: Unhide
de: Sichtbar machen

# cm.upload
source: Upload Files
de: Dateien hochladen

# cm.rename
source: Rename
de: Umbenennen

# cm.open
source: Open
de: Öffnen

# cm.save
source: Save
de: Speichern

# cm.unzip
source: Unzip
de: Entpacken

# cm.createnew
source: Create new
de: Neu anlegen

# cm.tempMountPoint
source: Mount as treeroot
de: Als Startpunkt für den Seitenbaum festlegen

# cm.copyPage_into
source: Copy page into
de: Seite kopieren in

# cm.copyPage_after
source: Copy page after
de: Seite kopieren hinter

# cm.movePage_into
source: Move page into
de: Seite verschieben in

# cm.movePage_after
source: Move page after
de: Seite verschieben hinter

# cm.copyFolder_into
source: Copy folder into
de: Ordner kopieren in

# cm.moveFolder_into
source: Move folder into
de: Ordner verschieben in

# cm.createNewRelation
source: Create new relation
de: Neue Relation erstellen

# cm.branchActions
source: Branch Actions
de: Teilbereichsaktionen

# cm.copyPasteActions
source: Page Actions
de: Seitenaktionen

# cm.collapseBranch
source: Collapse Branch
de: Teilbereich einklappen

# cm.expandBranch
source: Expand Branch
de: Teilbereich ausklappen

# tree.defaultPageTitle
source: [Default Title]
de: [Standard-Titel]

# tree.copyHint
source: Press Ctrl to copy.
de: Zum Kopieren 'Strg' drücken.

# tree.activeFilterMode
source: Active Filtering Mode
de: Filtermodus aktiv

# tree.dropToRemove
source: Drop here to delete
de: Zum Löschen hier ablegen

# tree.dropZoneElementRemoved
source: Click here to undelete
de: Zum Wiederherstellen hier klicken

# tree.dropZoneElementRestored
source: Page restored
de: Seite wiederhergestellt

# tree.buttonNewNode
source: Create new pages
de: Neue Seiten erstellen

# tree.buttonFilter
source: Filter tree
de: Baum filtern

# tree.searchTermInfo
source: Enter search term
de: Suchbegriff eingeben

# warning.install_password
source: The Install Tool is still using the default password "joh316". Update this within the %sAbout section%s of the Install Tool.
de: Das Installationsprogramm benutzt noch das Standardpasswort "joh316". Bitte ersetzen Sie es %shier%s.

# warning.backend_admin
source: The default backend user "admin" with password "password" is still present. %sEdit this account%s, either deleting it completely or changing the username and password.
de: Der Standardbenutzer "admin" des Backends mit dem Passwort "password" ist noch vorhanden. %sÄndern Sie dieses Konto%s. Entweder indem Sie es vollständig löschen oder indem Sie Benutzername und Passwort ändern.

# warning.file_deny_pattern
source: The value of fileDenyPattern is not set to its default:%s If TYPO3 is running on Apache, a customized value might enable backend or frontend users to execute malicious php scripts.
de: Für fileDenyPattern ist nicht der Standardwert definiert: %s Wird TYPO3 mit Apache betrieben, kann ein angepasster Wert dazu führen, dass Backend- oder Frontend-Benutzer in die Lage versetzt werden, bösartige PHP-Skripte auszuführen.

# warning.file_deny_pattern_partsNotPresent
source: Security Risk! The new value of fileDenyPattern misses parts of its default:%s If TYPO3 is running on Apache, a customized value might enable backend or frontend users to execute malicious php scripts.
de: Sicherheitsrisiko! Der neue Wert von fileDenyPattern enthält nicht alle Teile des Standardwertes %s. Wenn TYPO3 auf einem Apache-Server ausgeführt wird, kann ein veränderter Wert Backend- oder Frontend-Benutzer in die Lage versetzen, bösartige PHP-Skripte auszuführen.

# warning.file_deny_htaccess
source: The current value of fileDenyPattern allows to upload/create files with the name ".htaccess". If TYPO3 is running on Apache, this enables backend or frontend users to create and execute php scripts. Please reset the value of fileDenyPattern to its default.
de: Der aktuelle Wert für fileDenyPattern erlaubt das Hochladen/Anlegen von Dateien mit dem Namen ".htaccess". Wird TYPO3 mit Apache betrieben, werden Backend- und Frontend-Benutzer in die Lage versetzt, PHP-Skripte zu erstellen und auszuführen. Setzen Sie bitte fileDenyPattern auf die Voreinstellung zurück.

# warning.install_enabled
source: The Install Tool is permanently enabled. Delete the file "%s" when you have finished setting up TYPO3.
de: Das Installationsprogramm ist dauerhaft aktiviert. Löschen Sie die Datei "%s", wenn Sie mit der Installation von TYPO3 fertig sind.

# warning.install_enabled_cmd
source: Click to remove the file now!
de: Klicken Sie hier, um die Datei jetzt zu löschen!

# warning.install_encryption
source: The encryption key is not set. Set it in the %sBasic Configuration section%s of the Install Tool.
de: Es ist kein Schlüssel für die Verschlüsselung festgelegt. Legen Sie ihn im %sAbschnitt Grundkonfiguration%s des Installationsprogramms fest.
