Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_*_groups.xlf
Languages: de

# TSconfig.details
source: User TSconfig can be set for each backend user and group. Configuration set for backend groups is inherited by the user who is a member of those groups. The available options typically cover user settings like those found in the User>Setup module (in fact options from that module can be forcibly overridden from User TSconfig!), configuration of the "Admin Panel" (frontend), various backend tweaks (lock user to IP, may user clear all cache?, width of the navigation frame etc.) and backend module configuration (overriding any configuration set for backend modules in Page TSconfig).
de: Benutzer-TSconfig kann für jeden Backend-Benutzer und jede Backend-Benutzergruppe gesetzt werden. Die für Benutzergruppen festgelegte Konfiguration wird an die Mitglieder dieser Gruppe vererbt. Zu den verfügbaren Optionen gehören typischerweise Einstellungen wie im Modul "Benutzerwerkzeuge > Einstellungen" (tatsächlich können dessen Optionen per Benutzer-TSconfig übersteuert werden), im Admin-Panel (Frontend), diverse Optimierungen des Backends (Benutzer auf IP festlegen, der Zugriff auf die Funktion zum Löschen des Cache, Breite des Navigationsrahmens usw.) und die Konfiguration der Backend-Module (Übersteuerung der Konfiguration, die über Seiten-TSconfig gesetzt wurde).

# TSconfig.syntax
source: TypoScript syntax without conditions and constants.
de: Eingabe als normales TypoScript, aber ohne Bedingungen und Konstanten.

# _TSconfig.seeAlso
source: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, TSconfig Reference| http://typo3.org/documentation/document-library/doc_core_tsconfig/User_TSconfig/, TypoScript Syntax | http://typo3.org/documentation/document-library/doc_core_ts/
de: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, TSconfig-Referenz | http://typo3.org/documentation/document-library/doc_core_tsconfig/User_TSconfig/, TypoScript-Syntax | http://typo3.org/documentation/document-library/doc_core_ts/

# TSconfig.image_descr
source: In the TSconfig field help is right at hand - just click the TS wizard icon, then a window will pop up. In the pop-up window you will see a tree of possible configuration values. These are extracted from the TSconfig manual. You can click around to find the options you need to set through this wizard.
de: Für das TSconfig-Feld steht Hilfe jederzeit bereit - klicken Sie einfach das Symbol des TS-Assistenten an, um ein Fenster zu öffnen. In dem Popup-Fenster sehen Sie dann einen Baum möglicher Konfigurationswerte. Diese wurden aus dem TSconfig-Handbuch extrahiert. Mit diesem Assistenten können Sie die benötigten Optionen suchen.

# hide_in_lists.description
source: This option will prevent the user group from showing up in lists, where user groups are selected.
de: Ist diese Option aktiviert, taucht die Gruppe nicht in Listen auf, aus denen Benutzergruppen ausgewählt werden können.

# hide_in_lists.details
source: This will affect the list of user groups in the Task Center To-Do and Messages parts as well as the Web>Access module. The option is extremely useful if you have general user groups defining some global properties which all your users are members of. Then you would probably not like all those users to 'see' each other through the membership of this group, for instance sending messages or To-Dos to each other. And this is what is option will prevent.
de: Dies wirkt sich sowohl auf die Benutzergruppenlisten in den Bereichen To-Do und Nachrichten des Aufgabenzentrums aus als auch auf das Modul "Web > Zugriff". Die Option ist äußerst nützlich, wenn einige Benutzergruppen vorhanden sind, über die globale Einstellungen definiert werden und bei denen alle Benutzer Mitglieder sind. In diesem Fall möchte man gewöhnlich nicht, dass sich alle Benutzer über die Mitgliedschaft in dieser Gruppe gegenseitig "sehen" können und sich gegenseitig Nachrichten schicken oder Aufgaben zuweisen. Genau dies kann mit Hilfe dieser Option verhindert werden.

# subgroup.description
source: Select backend user groups which are automatically included for members of this group.
de: Legt Backend-Benutzergruppen fest, die Mitgliedern dieser Gruppe automatisch zugewiesen werden.

# subgroup.details
source: The properties of subgroups are added to the properties of this group and basically they will simply be added to the list of member groups of any user which is a member of this group. This feature provides a great way to create 'Supervisor' user groups.
de: Die Eigenschaften der Untergruppen werden den Eigenschaften dieser Gruppe hinzugefügt. Die Gruppen werden einfach zur Liste der Gruppen hinzugefügt, bei denen der Benutzer Mitglied ist. Mit Hilfe dieser Funktion lassen sich sehr gut "Experten"-Benutzergrupen erstellen.

# explicit_allowdeny.description
source: Select field values to explicitly deny or allow for user group members.
de: Legt Feldwerte fest, die Mitgliedern der Benutzergruppe explizit verboten oder erlaubt werden sollen.

# explicit_allowdeny.details
source: Selector box fields can be configured for access control on value level. This list represents all values that are configured for access control. Each value can be configured to require either explicit access (Allow) or explicit denial (Deny). If a value has the prefix "Allow" (green icon) it means that by default users <em>cannot</em> set this value unless they are member of a user group which explicitly allows it (by setting this checkbox). If a value has the prefix "Deny" (red icon) it means that by default users can set this value unless they are member of a user group which explicitly denies it (by setting this checkbox). The list is organized so values from the same selector box is listed together. If values from a selectorbox is not present in the allow/deny list it simply means they are not evaluated and hence they can be set by anyone having access to the field in general.
de: Auswahlfelder können für die Zugriffskontrolle auf Wertebene konfiguriert werden. Diese Liste repräsentiert alle Werte, die für die Zugriffskontrolle konfiguriert wurden. Es kann für jeden Wert eingestellt werden, ob er entweder explizite Erlaubnis oder explizites Verbot erfordert. Ist einem Wert "Erlauben" vorangestellt (grünes Symbol), so können Standardbenutzer diesen Wert <em>nicht setzen</em>, es sei denn, sie wären Mitglieder einer Benutzergruppe, die ihnen dies explizit erlaubt (über dieses Markierungsfeld). Ist einem Wert "Verbieten" vorangestellt (rotes Symbol), so kann der Standardbenutzer diesen Wert setzen, solange er nicht Mitglied einer Gruppe ist, die dies explizit verbietet (über dieses Markierungsfeld). Die Liste ist so organisiert, dass Werte des selben Auswahlfeldes zusammen aufgeführt werden. Sind Werte eines Auswahlfeldes nicht in der Erlauben/Verbieten-Liste aufgeführt, bedeutet dies einfach, dass sie nicht ausgewertet werden und daher von jedem gesetzt werden können, der allgemeinen Zugriff auf das Feld hat.

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
de: Legt fest, auf welche Sprachversionen von Datensätzen Gruppenmitglieder beschränkt sind.

# allowed_languages.details
source: Records in TYPO3 can be configured to carry information about their language. If that is the case access to these elements will also be evaluated based on whether the user has the language in question included from this list. If a user has no languages listed all together it simply means that he can edit <em>all</em> languages!
de: Datensätze können unter TYPO3 so konfiguriert werden, dass sie Informationen über ihre Sprache enthalten. Ist dies der Fall, werden diese Elemente auch im Hinblick darauf ausgewertet, ob in dieser Liste für den Benutzer Zugriffsrechte für diese Sprachen gesetzt wurden. Werden für einen Benutzer keine Sprachen aufgeführt, so kann er <em>sämtliche</em> Sprachen bearbeiten!

# allowed_languages.image_descr
source: This example shows a situation where two languages, Danish and German, are created in addition to the default language.
de: Das Beispiel zeigt ein Szenario, bei dem zwei Sprachen, Dänisch und Deutsch, zusätzlich zur Standardsprache erstellt wurden.

# custom_options.description
source: Select custom permission options.
de: Legt benutzerdefinierte Rechteoptionen fest.

# custom_options.details
source: This list represents custom permissions introduced by various backend modules (from extensions). The significance of each option depends on the backend module that evaluates it.
de: Diese Liste repräsentiert benutzerdefinierte Zugriffsrechte, die von verschiedenen Backend-Modulen (von Erweiterungen) eingeführt werden. Die Bedeutung der einzelnen Optionen hängen vom auswertenden Backend-Modul ab.

# custom_options.image_descr
source: This is just an example from an internal test application. It shows how checkboxes are added by a custom module under its own header. You can also show a description text with each checkbox to explain its function.
de: Hierbei handelt es sich nur um ein Beispiel einer internen Testanwendung. Es zeigt, wie ein Benutzermodul Markierungsfelder unterhalb seiner Überschrift hinzufügt. Darüber hinaus lassen sich Beschreibungen für jedes Markierungsfeld anzeigen, die dessen Funktion erläutern.
