Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_login.xlf
Languages: de

# labels.username
source: Username
de: Benutzername

# labels.password
source: Password
de: Passwort

# labels.interface
source: Interface
de: Oberfläche

# labels.submitLogin
source: Login
de: Anmelden

# labels.submitLogout
source: Log Out
de: Abmelden

# labels.donate
source: Donate
de: Spenden

# labels.whatIsOpenId
source: What is OpenId?
de: Was ist OpenID?

# labels.switchToOpenId
source: Switch to OpenID
de: Zum OpenID-Login

# labels.switchToDefault
source: Switch to default login
de: Zum Standard-Login

# availableInterfaces
source: Backend,Front End,Traditional Backend
de: Backend,Frontend,Traditionelles Backend

# interface.backend_old
source: Traditional Backend
de: Traditionelles Backend

# headline
source: Login to the TYPO3 Backend on ###SITENAME###
de: Anmeldung am Backend von ###SITENAME###

# info.about
source: This is the backend login of TYPO3. You need username and password to access this administration interface. If you are a visitor of ###SITENAME###, please visit the public website: ###SITELINK###
de: Dies ist die Anmeldung am TYPO3-Backend. Um auf die Verwaltungsoberfläche zugreifen zu können, benötigen Sie einen Benutzernamen und ein Passwort. Falls Sie ein Besucher von ###SITENAME### sind, besuchen Sie bitte den öffentlichen Bereich: ###SITELINK###

# info.reset
source: Reset this form
de: Formular zurücksetzen

# info.cookies_and_js
source: (Note: Cookies and JavaScript must be enabled!)
de: (Hinweis: Cookies und JavaScript müssen aktiviert sein!)

# clear
source: Clear this field!
de: Dieses Feld leeren!

# login_process
source: Verifying Login Data ...
de: Anmeldedaten werden verifiziert...

# warning.incompatibleBrowserHeadline
source: Unsupported Browser
de: Nicht unterstützter Browser

# warning.incompatibleBrowser
source: You are using an unsupported browser version.
de: Sie verwenden eine nicht unterstützte Browser-Version.

# warning.incompatibleBrowserInternetExplorer
source: Please install <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />a more modern browser version</a>.
de: Bitte installieren Sie <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />eine aktuellere Browser-Version</a>.

# newsheadline
source: Important Messages:
de: Wichtige Meldungen:

# error.login
source: Your login attempt did not succeed. Make sure to spell your username and password correctly, including upper/lowercase characters.
de: Der Anmeldeversuch ist fehlgeschlagen. Achten Sie darauf, Benutzernamen und Passwort korrekt einzugeben, einschließlich Groß-/Kleinschreibung.

# error.login.title
source: Your login attempt did not succeed
de: Ihr Anmeldeversuch war nicht erfolgreich

# error.login.description
source: Make sure to spell your username and password correctly, including upper/lowercase characters.
de: Bitte stellen Sie sicher, dass Ihr Benutzername und Passwort korrekt sind. Groß-/Kleinschreibung wird unterschieden.

# error.javascript
source: Activate JavaScript, please!
de: Bitte aktivieren Sie JavaScript!

# error.cookies
source: Activate Cookies, please!
de: Bitte aktivieren Sie Cookies!

# error.cookies_ignore
source: Ignore!
de: Ignorieren!

# error.capslock
source: Attention: Caps lock enabled!
de: Achtung: Feststelltaste aktiviert!

# error.furtherInformation
source: For more information or further help click here
de: Weitere Informationen und Hilfe erhalten Sie hier

# warranty.by
source: Warranty is supplied by %s; %sclick for details.%s
de: Gewährleistung wird geboten von %s; %sDetails sind hier verfügbar.%s

# no.warranty
source: TYPO3 comes with ABSOLUTELY NO WARRANTY; %sclick for details.%s
de: Sie nutzen TYPO3 OHNE GEWÄHRLEISTUNG; %sDetails sind hier verfügbar.%s

# extension.copyright
source: Extensions are copyright of their respective owners.
de: Erweiterungen sind Eigentum ihrer jeweiligen Autoren.

# details.link
source: Go to %s for details.
de: Weitere Informationen erhalten Sie unter %s.

# free.software
source: This is free software, and you are welcome to redistribute it under certain conditions; %sclick for details.%s
de: Dies ist freie Software und Sie dürfen sie unter gewissen Voraussetzungen verbreiten; %sDetails sind hier verfügbar.%s

# keep.notice
source: Obstructing the appearance of this notice is prohibited by law.
de: Das Erscheinen dieses Hinweises zu verhindern, ist gesetzlich verboten.
