Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: de

# ext_details_saving_disabled
source: [SAVING IS DISABLED - It can be enabled with the $TYPO3_CONF_VARS['EXT']['noEdit'] flag]
de: [SPEICHERN IST DEAKTIVIERT - Es kann über die Option $TYPO3_CONF_VARS['EXT']['noEdit'] aktiviert werden]

# ext_details_cancel_button
source: Cancel
de: Abbruch

# ext_details_edit_file
source: Edit file:
de: Datei bearbeiten:

# ext_details_filesize_exceeded_kb
source: Filesize exceeded %s KBytes
de: Dateigröße über %s KByte

# ext_details_file_too_large
source: Files larger than %s KBytes are not allowed to be edited.
de: Dateien größer als %s KByte dürfen nicht bearbeitet werden.

# ext_details_fatal_edit_error
source: Fatal Edit error: File '%s' was not inside the correct path of the TYPO3 Extension!
de: Schwerer Fehler beim Bearbeiten: Die Datei "%s" befand sich nicht im korrekten Pfad der TYPO3-Erweiterung!

# ext_details_loaded_and_running
source: The extension is installed (loaded and running)!
de: Die Erweiterung ist installiert (geladen und läuft)!

# ext_details_remove_button
source: Click here to remove the extension:
de: Zum Deinstallieren der Erweiterung hier klicken:

# ext_details_not_loaded
source: The extension is <strong>not</strong> installed yet.
de: Die Erweiterung wurde noch <strong>nicht</strong> installiert.

# ext_details_install_button
source: Click here to install the extension:
de: Zum Installieren der Erweiterung hier klicken:

# ext_details_always_loaded
source: This extension is entered in the TYPO3_CONF_VARS['EXT']['requiredExt'] list and is therefore always loaded.
de: Diese Erweiterung befindet sich in der Liste TYPO3_CONF_VARS['SYS']['requiredExt'] und wird daher stets geladen.

# ext_details_current_status
source: Current status:
de: Aktueller Status:

# ext_details_update_needed
source: Update needed:
de: Aktualisierung erforderlich:

# ext_details_notice_static_data
source: (Notice: "Static data" may not <em>need</em> to be updated. You will only have to import static data each time you upgrade the extension.)
de: (Hinweis: "Statische Daten" <em>müssen nicht</em> notwendigerweise aktualisiert werden. Dies ist nur nach jeder Aktualisierung der Erweiterung erforderlich.

# ext_details_configuration
source: Configuration:
de: Konfiguration:

# ext_details_notice_clear_cache
source: (<em>Notice: You may need to clear the cache after the configuration of the extension. This is required if the extension adds TypoScript depending on these settings.</em>)
de: (<em>Hinweis: Nach der Konfiguration der Erweiterung kann ein Leeren des Cache erforderlich sein. Dies ist dann der Fall, wenn die Erweiterung abhängig von diesen Einstellungen TypoScript einbindet.</em>)

# ext_details_no_unique_ext
source: The extensions has an extension key prefixed "user_" which indicates that it is a user-defined extension with no official unique identification. Therefore it cannot be uploaded.
de: Die Erweiterung besitzt einen mit "user_" beginnenden Schlüssel. Dies weist darauf hin, dass es sich um eine benutzerdefinierte Erweiterung ohne offiziellen, eindeutigen Schlüssel handelt. Ein Hochladen ist daher nicht möglich.

# ext_details_no_username
source: You have not configured a default username/password yet. %sGo to "Settings"%s if you want to do that.
de: Benutzername und Passwort wurden noch nicht definiert. %sRufen Sie die "Einstellungen" auf%s, um dies nachzuholen.

# ext_details_upload_to_ter
source: Upload extension to repository
de: Erweiterung in Bibliothek hochladen

# ext_details_delete
source: Delete
de: Löschen

# ext_details_backup
source: Backup
de: Sichern

# ext_details_update_em_conf
source: Update EM_CONF
de: EM_CONF aktualisieren

# ext_details_ext_files
source: Extension files
de: Erweiterungsdateien

# ext_details_update
source: Update:
de: Aktualisierung:

# ext_details_no_update_object
source: No update object
de: Kein zu aktualisierendes Objekt

# reqInstExt_install_import
source: Install/Import:
de: Installation/Import:

# reqInstExt_ext_key
source: Extension Key:
de: Erweiterungsschlüssel:

# reqInstExt_import_install_selected
source: Import and Install selected
de: Ausgewählte importieren und installieren

# reqInstExt_return
source: Return
de: Zurück

# reqInstExt_imp_inst_ext
source: Import/Install Extensions:
de: Erweiterungen importieren/installieren:

# updatesForm_make_updates
source: Make updates
de: Aktualisierungen durchführen

# extDumpTables_tables_fields
source: Table and field structure required
de: Erforderliche Tabellen- und Feldstruktur

# extDumpTables_bytes_written_to
source: %sbytes written to %s
de: %sByte geschrieben nach %s

# extDumpTables_dumping_content
source: Dumping table content for static tables:
de: Dump des Tabelleninhalts statischer Tabellen:

# extDumpTables_static_tables
source: Static tables
de: Statische Tabellen

# extDumpTables_write_static
source: Write current static table contents to ext_tables_static+adt.sql now!
de: Aktuellen Inhalt statischer Tabellen jetzt in ext_tables_static+adt.sql schreiben!

# extDumpTables_dumping_db_structure
source: Dumping current database structure for:
de: Dump der aktuellen Datenbankstruktur erstellen für:

# extDumpTables_tables
source: Tables:
de: Tabellen:

# extDumpTables_solo_fields
source: Solo-fields:
de: Einzelfelder:

# extDumpTables_write_dump
source: Write this dump to ext_tables.sql now!
de: Diesen Dump jetzt in ext_tables.sql schreiben!

# extDumpTables_based_on
source: This dump is based on two factors:
de: Dieser Dump basiert auf zwei Faktoren:

# extDumpTables_based_on_one
source: 1) All tablenames in ext_tables.sql which are <em>not</em> found in the "modify_tables" list in ext_emconf.php are dumped with the current database structure.
de: 1) Alle Tabellennamen in ext_tables.sql, die sich <em>nicht</em> in der Liste "modify_tables" in ext_emconf.php befinden, werden zusammen mit der aktuellen Datenbankstruktur geschrieben.

# extDumpTables_based_on_two
source: 2) For any tablenames which <em>are</em> listed in "modify_tables" all fields and keys found for the table in ext_tables.sql will be re-dumped with the fresh equivalents from the database.
de: 2) Im Falle von Tabellennamen, die in "modify_tables" aufgeführt <em>sind</em>, werden alle Felder und Schlüssel für die in ext_tables.sql befindliche Tabelle neu mit den frischen Entsprechungen aus der Datenbank geschrieben.

# extDumpTables_bottomline
source: Bottomline is: Whole tables are dumped from database with no regard to which fields and keys are defined in ext_tables.sql. But for tables which are only modified, any NEW fields added to the database must in some form or the other exist in the ext_tables.sql file as well.
de: Insgesamt gilt: Für vollständige Tabellen wird der Dump aus der Datenbank ohne Rücksicht auf in ext_tables.sql definierte Felder und Schlüssel erstellt. Bei Tabellen, die nur modifiziert wurden, müssen alle NEUEN Felder, die zur Datenbank hinzugefügt wurden, in irgendeiner Weise auch in ext_tables.sql vorhanden sein.

# extFileList_file
source: File:
de: Datei:

# extFileList_size
source: Size:
de: Größe:

# extFileList_edit
source: Edit:
de: Bearbeiten:

# extFileList_download
source: Download...
de: Herunterladen...

# extFileList_edit_file
source: Edit file
de: Datei bearbeiten

# extFileList_total
source: Total:
de: Insgesamt:

# extDelete_ext_active
source: This extension is currently installed (loaded and active) and so cannot be deleted!
de: Diese Erweiterung ist derzeit installiert (geladen und aktiv) und kann daher nicht entfernt werden!

# extDelete_wrong_scope
source: You cannot delete (and install/update) extensions in the %s scope.
de: Erweiterungen im Zusammenhang %s können nicht entfernt (und installiert/aktualisiert) werden.

# extDelete_remove_dir_failed
source: ERROR: Could not remove extension directory '%s'. The following errors occurred:
de: FEHLER: Erweiterungsverzeichnis "%s" konnte nicht entfernt werden. Folgende Fehler sind aufgetreten:

# extDelete_removed_header
source: Extension deleted
de: Erweiterung entfernt

# extDelete_removed
source: Removed extension in path '%s'!
de: Erweiterung im Pfad "%s" entfernt!

# extDelete_sure
source: Are you sure you want to delete this extension from the server?
de: Diese Erweiterung tatsächlich vom Server entfernen?

# extDelete_from_server
source: DELETE EXTENSION FROM SERVER
de: ERWEITERUNG VOM SERVER ENTFERNEN

# extDelete_from_location
source: (in the '%s' location '%s'!)
de: ("%s" am Ort "%s"!)

# extDelete_backup
source: (Maybe you should make a backup first, see above.)
de: (Vielleicht sollte erst eine Sicherung erstellt werden. Siehe oben.)

# extDelete_neither_global_nor_local
source: This extension is neither a global nor a local one and so cannot be removed.
de: Diese Erweiterung ist weder global noch lokal und kann daher nicht entfernt werden.

# extUpdateEMCONF_sure
source: Are you sure you want to update EM_CONF?
de: EM_CONF tatsächlich aktualisieren?

# extUpdateEMCONF_file
source: Update extension EM_CONF file
de: Datei EM_CONF der Erweiterung aktualisieren

# extUpdateEMCONF_info_changes
source: If files are changed, added or removed to an extension this is normally detected and displayed so you know that this extension has been altered locally and may need to be uploaded or at least not overwritten.
de: Werden Dateien einer Erweiterung geändert, hinzugefügt oder entfernt, so wird dies normalerweise erkannt, so dass klar wird, dass diese Erweiterung lokal geändert wurde und ggf. hochgeladen oder zumindest nicht überschrieben werden sollte.

# extUpdateEMCONF_info_reset
source: Updating this file will reset this check.
de: Aktualisieren dieser Datei setzt die Prüfung zurück.

# extBackup_select
source: Make selection:
de: Auswahl vornehmen:

# extBackup_files
source: Extension files:
de: Erweiterungsdateien:

# extBackup_download
source: Download extension '%s' as a file.
de: Erweiterung "%s" als Datei herunterladen.

# extBackup_data_tables
source: Data tables:
de: Datentabellen:

# extBackup_static_tables
source: Static tables:
de: Statische Tabellen:

# extBackup_unexpected_error
source: An unexpected error has occurred. There are problems with your extension key or with the extension data.
de: Ein unerwarteter Fehler ist aufgetreten. Der Erweiterungsschlüssel oder die Erweiterungsdaten befinden sich nicht in ordnungsgemäßem Zustand.

# extBackup_dump_table
source: Dump table '%s'
de: Dump erstellen für Tabelle "%s"

# extBackup_number_of_records
source: %s records
de: %s Datensätze

# extBackup_table_not_there
source: Did not exist.
de: Ist nicht vorhanden.

# extBackup_dump_all_tables
source: Dump all existing tables.
de: Dump aller vorhandenen Tabellen erstellen.

# extBackup_download_all_data
source: Download all data from:
de: Alle Daten herunterladen von:

# extBackup_nothing_to_dump
source: Nothing to dump...
de: Kein Inhalt für Dump vorhanden...

# extInfoArray_general_info
source: General information:
de: Allgemeine Informationen:

# extInfoArray_title
source: Title:
de: Titel:

# extInfoArray_description
source: Description:
de: Beschreibung:

# extInfoArray_author
source: Author:
de: Autor:

# extInfoArray_category
source: Category:
de: Kategorie:

# extInfoArray_state
source: State:
de: Status:

# extInfoArray_shy
source: Shy:
de: Verborgen:

# extInfoArray_internal
source: Internal:
de: Intern:

# extInfoArray_depends_on
source: Depends on:
de: Abhängig von:

# extInfoArray_conflicts_with
source: Conflicts with:
de: Konflikt mit:

# extInfoArray_suggests
source: Suggests:
de: Empfohlen:

# extInfoArray_priority
source: Priority:
de: Priorität:

# extInfoArray_clear_cache
source: Clear cache:
de: Cache leeren:

# extInfoArray_incl_modules
source: Includes modules:
de: Enthält Module:

# extInfoArray_lock_type
source: Lock installation Type:
de: Sperrtyp für Installation:

# extInfoArray_load_in_frontend
source: Load in frontend:
de: Im Frontend laden:

# extInfoArray_modifies_tables
source: Modifies tables:
de: Tabellen modifizieren:

# extInfoArray_inst_status
source: Installation status:
de: Installationsstatus:

# extInfoArray_inst_type
source: Type of installation:
de: Installationstyp:

# extInfoArray_inst_twice
source: Double installation:
de: Doppelte Installation:

# extInfoArray_root_files
source: Root files:
de: Wurzeldateien:

# extInfoArray_table_error
source: Table error!
de: Tabellenfehler!

# extInfoArray_missing_fields
source: Probably one or more required fields/tables are missing in the database!
de: Wahrscheinlich fehlen ein oder mehrere Felder/Tabellen in der Datenbank!

# extInfoArray_static_table_error
source: Static table error!
de: Fehler bei statischen Tabellen!

# extInfoArray_static_tables_missing_empty
source: The static tables are missing or empty!
de: Die statischen Tabellen fehlen oder sind leer!

# extInfoArray_db_update_needed
source: The database will need to be updated when this extension is installed.
de: Bei Installation dieser Erweiterung muss die Datenbank aktualisiert werden.

# extInfoArray_tables_ok
source: All required tables are already in the database!
de: Es befinden sich bereits alle erforderlichen Tabellen in der Datenbank!

# extInfoArray_db_requirements
source: Database requirements:
de: Datenbank-Anforderungen:

# extInfoArray_db_status
source: Database status:
de: Datenbankstatus:

# extInfoArray_flags
source: Flags:
de: Optionen:

# extInfoArray_config_template
source: Config template:
de: Konfigurations-Template:

# extInfoArray_typoscript_files
source: TypoScript files:
de: TypoScript-Dateien:

# extInfoArray_language_files
source: Language files:
de: Sprachdateien:

# extInfoArray_upload_folder
source: Upload folder:
de: Hochladeverzeichnis:

# extInfoArray_create_directories
source: Create directories:
de: Verzeichnisse erstellen:

# extInfoArray_module_names
source: Module names:
de: Modulnamen:

# extInfoArray_class_names
source: Class names:
de: Klassennamen:

# extInfoArray_code_warnings
source: Code warnings:
de: Quelltextwarnungen:

# extInfoArray_dev_relevant
source: (developer-relevant)
de: (relevant für Entwickler)

# extInfoArray_annoyances
source: Naming annoyances:
de: Benennungsärgernisse:

# extInfoArray_exception
source: [exception]
de: [Ausnahme]

# extInfoArray_difference_detected
source: A difference between the originally installed version and the current one was detected!
de: Ein Unterschied zwischen der ursprünglich installierten und der aktuellen Version wurde festgestellt!

# extInfoArray_modified_files
source: Modified files:
de: Modifizierte Dateien:

# extInfoArray_files_changed
source: Files changed:
de: Geänderte Dateien:

# extInfoArray_additional_fields
source: Additional fields:
de: Zusätzliche Felder:

# extInfoArray_double_installation_infotext
source: A %s extension with this key is also available on the server, but cannot be loaded, because the "%s" version takes precedence.
de: Es befindet sich bereits eine %s Erweiterung mit diesem Schlüssel auf dem Server, kann aber nicht geladen werden, da die Version "%s" höhere Priorität besitzt.

# repositoryUploadForm_username
source: Repository Username:
de: Benutzername für Bibliothek:

# repositoryUploadForm_password
source: Repository Password:
de: Passwort für Bibliothek:

# repositoryUploadForm_changelog
source: Changelog for upload:
de: Änderungsprotokoll für das Hochladen:

# repositoryUploadForm_command
source: Upload command:
de: Hochladebefehl:

# repositoryUploadForm_new_bugfix
source: New bugfix version (latest %s)
de: Neue, fehlerkorrigierte Version (neueste %s)

# repositoryUploadForm_new_sub_version
source: New sub version (latest %s)
de: Neue Unterversion (neueste %s)

# repositoryUploadForm_new_main_version
source: New main version (latest %s)
de: Neue Hauptversion (neueste %s)

# repositoryUploadForm_upload
source: Upload extension
de: Erweiterung hochladen

# listRowHeader_modifies_tables_short
source: Mod. Tables:
de: Mod. Tabellen:

# listRowHeader_modules
source: Modules:
de: Module:

# listRowHeader_clear_cache_short
source: Cl. Cache?
de: Cache lr?

# listRowHeader_tables_fields
source: Tables/Fields:
de: Tabellen/Felder:

# listRowHeader_ts_files
source: TS files:
de: TS-Dateien:

# listRowHeader_affects
source: Affects:
de: Betrifft:

# listRowHeader_config
source: Config:
de: Konfig:

# listRowHeader_classes
source: Classes:
de: Klassen:

# listRowHeader_changed_files
source: Changed files:
de: Geänderte Dateien:

# listRowHeader_ext_key
source: Extension key:
de: Erweiterungsschlüssel

# listRowHeader_download_short
source: DL:
de: HL:

# listRowHeader_documentation_short
source: Doc:
de: Dok:

# listRowHeader_type
source: Type:
de: Typ:

# listRowHeader_title_upload_date
source: Date of upload of the repository version.
de: Datum des Hochladens der Bibliotheksversion

# listRowHeader_upload_date
source: Upload date:
de: Hochladedatum:

# listRowHeader_title_current_version
source: Current version of the extension on this server. If printed bold, there is a newer version in the repository! Then you should upgrade.
de: Die aktuelle Version auf diesem Server. Bei Fettdruck ist eine neuere Version in der Bibliothek verfügbar, und es empfiehlt sich ein Upgrade.

# listRowHeader_current_version
source: Cur. Ver:
de: Akt. Ver.:

# listRowHeader_title_current_type
source: Current type of installation of the extension on this server.
de: Aktueller Installationstyp der Erweiterung auf diesem Server.

# listRowHeader_current_type
source: Cur. Type:
de: Akt. Typ:

# listRowHeader_title_number_of_downloads
source: Number of downloads: all versions/this version
de: Anzahl Downloads: alle Versionen/diese Version

# listRow_files
source: Files:
de: Dateien:

# listRow_local_manual
source: Local Open Office Manual
de: Lokales OpenOffice-Handbuch

# helperFunction_install_extension
source: Install extension...
de: Erweiterung installieren...

# helperFunction_import_not_possible
source: Import to both local and global path is disabled in TYPO3_CONF_VARS!
de: Das Importieren ist sowohl für den lokalen als auch globalen Pfad über TYPO3_CONF_VARS deaktiviert!

# detailedExtAnalysis_keys
source: keys
de: Schlüssel

# detailedExtAnalysis_tables_are
source: Some tables or fields are %s!
de: Einige Tabellen oder Felder %s!

# detailedExtAnalysis_tables_are_missing
source: missing
de: fehlen

# detailedExtAnalysis_tables_are_of_wrong_type
source: of wrong type
de: haben den falschen Typ

# detailedExtAnalysis_static_tables_missing
source: Static table(s) missing!
de: Statische Tabelle(n) fehlen!

# detailedExtAnalysis_wrong_mod_path
source: Configured TYPO3_MOD_PATH "%s" is different from "%s", which it should be.
de: Der konfigurierte TYPO3_MOD_PATH "%s" weicht vom Richtwert "%s" ab.

# detailedExtAnalysis_mconf_missing
source: No definition of MCONF[name] variable found inside!
de: Keine Definition der Variable MCONF[name] gefunden!

# detailedExtAnalysis_be_module_conf_missing
source: Backend module conf file "%s" should exist, but does not!
de: Die Konfigurationsdatei "%s" für das Backend-Modul fehlt!

# detailedExtAnalysis_module_folder_missing
source: Backend module folder "%s" should exist, but does not!
de: Das Verzeichnis "%s" für das Backend-Modul fehlt!

# detailedExtAnalysis_unconfigured_module
source: It seems like there is a backend module in "%s" which is not configured in ext_emconf.php.
de: Anscheinend ist in "%s" ein Backend-Modul vorhanden, aber nicht über ext_emconf.php konfiguriert.

# detailedExtAnalysis_module
source: Module
de: Modul

# detailedExtAnalysis_module_and_more
source: Module+
de: Modul+

# detailedExtAnalysis_page_ts
source: Page-TSconfig
de: Seiten-TSconfig

# detailedExtAnalysis_user_ts
source: User-TSconfig
de: Benutzer-TSconfig

# detailedExtAnalysis_ts_setup
source: TS/Setup
de: TS/Konfiguration

# detailedExtAnalysis_ts_constants
source: TS/Constants
de: TS/Konstanten

# detailedExtAnalysis_constants
source: Constants
de: Konstanten

# detailedExtAnalysis_setup
source: Setup
de: Konfiguration

# detailedExtAnalysis_no_upload_folder
source: Error: Upload folder "%s" did not exist!
de: Fehler: Hochladeverzeichnis "%s" nicht vorhanden!

# detailedExtAnalysis_class_ok
source: Class filename "%s" contained the class "%s" just as it should.
de: Klassendateiname "%s" enthält ordnungsgemäß die Klasse "%s".

# detailedExtAnalysis_class_not_ok
source: Class filename "%s" did NOT contain the class "%s"!
de: Klassendateiname "%s" enthält NICHT die Klasse "%s".

# detailedExtAnalysis_xclass_ok
source: 'XCLASS OK in %s.
de: XCLASS in %s in Ordnung.

# detailedExtAnalysis_xclass_no_include
source: Couldn't find the include_once statement for XCLASS!
de: Anweisung include_once für XCLASS nicht gefunden!

# detailedExtAnalysis_xclass_incorrect
source: The XCLASS filename-key "%s" was different from "%s" which it should have been!
de: Der XCLASS-Dateinamenschlüssel "%s" weicht vom erwarteten Wert "%s" ab!

# detailedExtAnalysis_no_xclass_filename
source: No XCLASS filename-key found in file "%s". Maybe a regex coding error here...
de: Kein XCLASS-Dateinamenschlüssel in Datei "%s" gefunden. Möglicherweise ein Fehler im Code für reguläre Ausdrücke...

# detailedExtAnalysis_no_xclass_found
source: No XCLASS inclusion code found in file "%s".
de: Kein Code für XCLASS-Einbindung in Datei "%s" gefunden.

# rmExtDir_could_not_be_deleted
source: Error: "%s" could not be deleted!
de: Fehler: "%s" konnte nicht entfernt werden!

# rmExtDir_error_file
source: Error: "%s" was either not a file, or it was equal to the removed directory or simply outside the removed directory "%s"!
de: Fehler: "%s" war entweder keine Datei, entsprach dem entfernten Verzeichnis oder befand sich außerhalb des entfernten Verzeichnisses "%s"!

# rmExtDir_error_files_left
source: Error: "%s" could not be removed (are there files left?)
de: Fehler: "%s" konnte nicht entfernt werden (Dateien übrig?)

# rmExtDir_error_no_dir
source: Error: "%s" was no directory!
de: Fehler: "%s" war kein Verzeichnis!

# rmExtDir_error_folders_left
source: Error: Extension directory "%s" could not be removed (are there files or folders left?)
de: Fehler: Erweiterungsverzeichnis "%s" konnte nicht entfernt werden (noch Dateien oder Verzeichnisse vorhanden?)

# rmExtDir_error
source: Error:
de: Fehler:

# rmExtDir_error_unallowed_path
source: Error: Unallowed path to remove:
de: Fehler: Nicht erlaubter Pfad für Entfernen:

# clearMakeExtDir_no_ext_key
source: FATAL ERROR: Extension key was not set for some VERY strange reason. Nothing done...
de: SCHWERER FEHLER: Erweiterungsschlüssel aus SEHR seltsamem Grund nicht gesetzt. Keine Änderung durchgeführt...

# clearMakeExtDir_could_not_remove_dir
source: ERROR: Could not remove extension directory "%s". Reasons:
de: FEHLER: Erweiterungsverzeichnis "%s" konnte nicht entfernt werden. Gründe:

# clearMakeExtDir_could_not_create_dir
source: ERROR: Could not create extension directory "%s"!
de: FEHLER: Erweiterungsverzeichnis "%s" konnte nicht erstellt werden!

# clearMakeExtDir_no_dir
source: ERROR: The extension install path "%s" was no directory!
de: FEHLER: Der Erweiterungsinstallationspfad "%s" war kein Verzeichnis!

# writeModPath_ok
source: TYPO3_MOD_PATH and $BACK_PATH were updated in "%s"!
de: TYPO3_MOD_PATH und $BACK_PATH in "%s" aktualisiert!

# writeModPath_notRequired
source: Notice: Module "%s" uses module-API to register module, TYPO3_MOD_PATH and $BACK_PATH not required.
de: Hinweis: Das Modul "%s" benutzt eine API aus dem Modul, um das Modul zu registrieren. TYPO3_MOD_PATH und $BACK_PATH werden daher nicht benötigt.

# writeModPath_error
source: Error: Either TYPO3_MOD_PATH or $BACK_PATH was not found in the "%s" file. You must manually configure that!
de: Fehler: TYPO3_MOD_PATH oder $BACK_PATH nicht in Datei "%s" gefunden. Manuelle Konfiguration erforderlich!
