Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_*_users.xlf
Languages: de

# .description
source: This is the table of backend administration users. Backend users can login in the backend of TYPO3 and are typically producers of content on a website.
de: Backend-Benutzer können sich im TYPO3-Backend-Bereich anmelden und dort Inhaltselemente anlegen oder bearbeiten.

# .details
source: The main settings for a backend user is a username, password and group memberships. The username and password authenticates the user to the system. The group memberships enables the user to perform actions in TYPO3 since groups are the main source of permission settings for a backend user. Backend usergroups can also be understood as "roles". A usergroup can contain a configuration of permissions which allows the user to play a certain role in the system. <b>The "Admin" user</b> There is a special kind of user, the "Admin" user. This user has access to everything in TYPO3. There are no limits for Admin-users at all. You should normally have only a single or two admin-users in your system. Admin-users are the only users who can create other backend users. Alternatively you can create an "Action" which enables other normal users to do it as well (with certain restrictions of course). <b>Location</b> Backend users are always created in the root of the page tree (like Backend groups are). <b>Comparing Users</b> To manage and compare users, getting an overview of their access credentials etc. you can use the Tools > User Admin module (extension: beuser). It allows you to group users by various categories of permissions. You can also switch to another users account by a single click of a button.
de: Die Haupteinstellungen für einen Backend-Benutzer bestehen aus einem eindeutigen Benutzernamen, einem Passwort und einer oder mehreren Gruppenmitgliedschaften. Mit seinem Benutzernamen und dem Passwort authentifiziert sich ein Benutzer gegenüber dem System und durch Gruppenmitgliedschaften werden dem Benutzer bestimmte Rechte innerhalb des TYPO3-Systems eingeräumt. Benutzergruppen stellen die Hauptquelle für Benutzerberechtigungen dar. Man kann Backend-Benutzergruppen auch als "Benutzerrollen" verstehen: mit einer Benutzergruppe können die Rechte definiert werden, die ein Benutzer benötigt, um eine bestimmte Aufgabe oder Rolle innerhalb des Systems wahrzunehmen, z.B. als Textredakteur, Designer oder Systemadministrator. <b>Der "Admin"-Benutzer</b> Es gibt einen besonderen Benutzertyp, den "Admin"-Benutzer. Dieser Benutzer hat auf alle Bereiche von TYPO3 Zugriff, d.h. für ihn existieren keinerlei Beschränkungen. Normalerweise sollten in einem System nur ein oder zwei Admin-Benutzer angelegt werden. Admin-Benutzer sind die einzigen, die andere Benutzer anlegen können. Sie können jedoch auch eine Aktion definieren, durch die ein normaler Benutzer dazu in die Lage versetzt wird (mit bestimmten Einschränkungen). <b>Speicherort für Backend-Benutzer und Gruppen</b> Backend-Benutzer (und Benutzergruppen) werden immer in der Wurzel des Seitenbaumes angelegt. <b>Benutzer vergleichen</b> Um Benutzer verwalten, vergleichen und sich einen Überblick über Benutzerrechte verschaffen zu können, kann das Werkzeug "Verwaltung" verwendet werden (Adminwerkzeuge > Verwaltung). Damit lassen sich u.a. Benutzer nach verschiedenen Kategorien sortieren und vergleichen. Hier können Sie auch mit einem einzigen Mausklick die Identität eines anderen Benutzers annehmen, um dessen Benutzerrechte direkt zu überprüfen.

# _.seeAlso
source: be_groups, About backend users | http://typo3.org/documentation/document-library/doc_tut_quickstart/Backend_users/ Setting up a new user and group | http://typo3.org/documentation/document-library/doc_core_inside/Setting_up_a_new_use/ Users and Groups [Technical] | http://typo3.org/documentation/document-library/doc_core_inside/Users_and_groups/
de: be_groups, Über Backend-Benutzer | http://typo3.org/documentation/document-library/doc_tut_quickstart/Backend_users/ Einrichtung neuer Benutzer und Gruppen | http://typo3.org/documentation/document-library/doc_core_inside/Setting_up_a_new_use/ Bentzer und Gruppen [Technisch] | http://typo3.org/documentation/document-library/doc_core_inside/Users_and_groups/

# .image_descr
source: Backend users are found in the root of the page tree. "Admin" backend users can always be recognized on their icon being red while normal users have a blue icon. The editing form of a backend users record. The "Tools > User Admin" module where you can get an overview of the users on the system and what permissions they have. Click the "SU" button to switch to a users account.
de: Backend-Benutzer und Backend-Benutzergruppen werden in der Wurzel des Seitenbaumes angelegt. Im Bild sind "Admin"-Benutzer daran zu erkennen, dass sie ein rotes Benutzersymbol haben (normale Benutzer werden in blau dargestellt). In neueren Versionen von TYPO3 hat ein Admin-Benutzer ein blaues und ein normaler Benutzer ein grünes Symbol. Die Eingabemaske zum Anlegen oder Bearbeiten von Backend-Benutzern. Die Eingabemaske des Werkzeugs "Verwaltung", mit dem man sich einen Überblick über alle Backend-Benutzer verschaffen kann. Mit der Schaltfläche "SU" ("Switch User") können Sie als Administrator die Identität des entsprechenden Benutzers annehmen, um dessen Rechte zu überprüfen.

# username.description
source: Enter the login name of the backend user.
de: Geben Sie den Benutzernamen des Backend-Benutzers an.

# username.details
source: A username is required and must be in lowercase without spaces in it. Furthermore the username must be unique. If it is not unique a number will be appended automatically.
de: Das Feld für den Benutzernamen ist - ebenso wie das für das Passwort - ein Pflichtfeld und muss ausgefüllt werden. Der Benutzername muss eindeutig sein und darf nur aus Kleinbuchstaben bestehen. Leerzeichen sind nicht erlaubt! Sollte der Benutzername nicht eindeutig sein, fügt TYPO3 automatisch eine Zahl an.

# password.description
source: Enter the password for the backend username above (Notice the value you enter <i>will</i> be readable in the field!).
de: Geben Sie das Passwort für diesen Benutzer an. Das Passwort wird während der Eingabe im Klartext angezeigt.

# password.details
source: The password is required. Before the password is sent to the server it's md5-hashed, so the password value itself is not transferred over the Internet. This is true both when editing the password and when the user logs in. While this principle does not reveal the raw password it is <i>not</i> the same as real encryption. If you need the highest degree of security you should install the TYPO3 backend on a secure server. The password is stored in the database as an md5-hash and thus it's not possible to extract the original password from the database either. This means that 'lost passwords' must be substituted with a new password for the user. <b>Notice</b> When you enter the password in the password field it is initially visible in clear text! First when the password field focus is lost will the password become a "list of dots". <b>User changing password</b> Users can change their password from the User > Setup module
de: Das Feld für das Passwort ist - ebenso wie das für den Benutzernamen - ein Pflichtfeld und muss ausgefüllt werden. Passwörter werden verschlüsselt (als MD5-Hash), sobald Sie dieses Eingabefeld verlassen. Damit wird sicher gestellt, dass keinerlei Klartextpasswörter über das Internet gesendet werden. Dieser Vorgang findet auch bei der Anmeldung am System statt. Auch wenn mit dieser Methode prinzipiell sichergestellt wird, dass keine Passwörter im Klartext übertragen werden, entspricht dies <i>nicht</i> einer verschlüsselten Kommunikation! Die größtmögliche Sicherheit für Ihr System erreichen Sie, wenn Sie TYPO3 auf einem sicheren Server (mit SSL und HTTPS) installieren. Das Passwort wird in der Datenbank als sogenannter MD5-Hash-Wert gespeichert und kann deshalb nicht rückübersetzt werden. Aus diesem Grund müssen verloren gegangene oder vergessene Benutzerpasswörter durch neue ersetzt werden. <b>Hinweis</b> Bei der Eingabe erscheint im Eingabefeld das Passwort zunächst im Klartext (unverschlüsselt). Beim Verlassen des Feldes erscheinen dann die gewohnten "Passwortpunkte". <b>Passwortänderung durch Benutzer</b> Benutzer können ihr Passwort innerhalb ihres Benutzerprofils auch selbst ändern.

# usergroup.description
source: Assign backend user groups to the user.
de: Weisen Sie den Benutzer einer oder mehreren Benutzergruppen zu.

# usergroup.details
source: The backend user groups defines the permissions which the backend user will inherit. So unless the backend user is an 'Admin' user, he needs to be a member of one or more user groups in order to have practically any permissions assigned. The properties set in the user groups are mostly added together. The first (top) group in the list is the group which will, by default, be the owner of pages the user creates.
de: Erst durch das Zuweisen von Backend-Benutzergruppen können Sie festlegen, welche Rechte ein Benutzer erhält. Ein Benutzer verfügt über praktisch keine Rechte, solange er noch keiner Benutzergruppe zugewiesen wurde (diese Einschränkung gilt nicht für Admin-Benutzer). Die Rechte verschiedener Gruppen werden dabei größtenteils zusammengefasst. Die erste (oberste) Gruppe in der Liste legt fest, welcher Gruppe neu erstellte Seiten des Benutzers gehören (Standardgruppe).

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
de: Geben Sie den Rechnernamen oder die Netzwerkadresse an, von welcher sich der Benutzer anmelden muss.

# lockToDomain.details
source: A TYPO3 system may have multiple domains pointing to it. Therefore this option secures that users can login only from a certain host name.
de: Ein TYPO3-System kann unter Umständen über mehrere verschiedene Domänennamen erreichbar sein. Deshalb kann mit dieser Einstellung sichergestellt werden, dass sich Benutzer nur von einer bestimmten Domäne aus anmelden können.

# disableIPlock.description
source: Disable the lock of the backend users session to the remote IP number.
de: Mit dieser Option können bestehende Anmeldebeschränkungen (IP-Adressen) für diesen Benutzer deaktiviert werden.

# disableIPlock.details
source: You will have to disable this lock if backend users are accessing TYPO3 from ISDN or modem connections which may shutdown and reconnect with a new IP. The same would be true for DHCP assignment of IP numbers where new IP numbers are frequently assigned.
de: Sie müssen diese Option für Benutzer wählen, die über eine Internet-Wählverbindung (Modem, ISDN, DSL) auf TYPO3 zugreifen. Solche Benutzer erhalten bei jeder Internet-Einwahl eine andere IP-Adresse zugewiesen. Gleiches gilt auch für Benutzer, die per DHCP am Netzwerk angemeldet sind. Auch hier ändern sich die IP-Adressen ständig, so dass Sie in diesem Fall keine IP-basierte Anmeldebeschränkung vornehmen sollten.

# db_mountpoints.description
source: Assign startpoints for the users page tree.
de: Definieren Sie den Seitenbaum des Benutzers.

# db_mountpoints.details
source: The page tree used my all Web-submodules to navigate must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a 'Database mount'. <strong>Notice</strong> that backend user groups also has DB mounts which can be inherited by the user. So if you want a group of users to share a page tree, you should probably mount the page tree in the backend user group which they share instead.
de: Um normalen Backend-Benutzern (Nicht-Administratoren) überhaupt einen Seitenbaum darstellen zu können, ist es zunächst notwendig festzulegen, auf welche Bereiche der Website die Benutzer Zugriff erhalten sollen. Dazu weist man ihnen hier eine oder mehrere Seiten des Seitenbaumes zu. Aus diesen Startseiten (inklusive aller Unterseiten) wird dann der benutzereigene Seitenbaum gebildet. Da der Begriff "Startseite" eigentlich lediglich eine Referenz zu einem Datenbankeintrag darstellt, wird solch eine Startseite auch als "Datenbankfreigabe" ("database mount" oder "DB mount") bezeichnet. <strong>Hinweis</strong> Backend-Benutzergruppen können ebenfalls Datenbankfreigaben erteilt werden. Diese Freigaben werden an alle Gruppenmitglieder vererbt. Der resultierende Seitenbaum setzt sich somit aus den persönlichen und den Gruppenfreigaben zusammen! Es wird empfohlen, Datenbankfreigaben auf Gruppenebene zu erstellen. <strong>Achtung</strong> Damit die Benutzer die angezeigten Seiten auch bearbeiten können, müssen Sie dem Benutzer auch entsprechende Bearbeitungsrechte einräumen (im Modul "Web > Zugriff").

# db_mountpoints.image_descr
source: A DB mount is assigned to the user. Users can only operate on pages and records which are inside their DB mounts! When a page is mounted for a user it will become the root of their page tree. The user must have access to the page through the regular page permissions set in the Web > Access module.
de: Dem Benutzer wurde eine Datenbankfreigabe zugewiesen. Benutzer können lediglich Seiten und Datensätze bearbeiten, die ihnen hier auch zugewiesen wurden. Zugewiesene Datenbankfreigaben bilden die Wurzel des Seitenbaums. Sie müssen dem Benutzer auch entsprechende Bearbeitungsrechte einräumen (im Modul "Web > Zugriff").

# file_mountpoints.description
source: Assign startpoints for the file folder tree.
de: Legen Sie den Ordnerbaum fest, der dem Benutzer zu Verfügung stehen soll.

# file_mountpoints.details
source: The file folder tree is used by all File-submodules to navigate between the file folders on the webserver. Notice as with 'DB mounts' the file folder mounts may be inherited from the member groups of the user. See Backend Groups for details
de: Der Dateibaum wird von allen TYPO3-Dateimodulen benutzt, um zwischen den verschiedenen Ordnern auf dem Webserver navigieren zu können. Genau wie bei den Datenbankfreigaben werden auch hier Gruppenrechte vererbt. Lesen Sie dazu bitte die Beschreibung für "Backend-Benutzergruppen".

# email.description
source: Enter the email address of the user.
de: Geben Sie die E-Mail-Adresse des Benutzers an.

# email.details
source: This address is rather important to enter because this is where messages from the system is sent. <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
de: Diese Adresse ist sehr wichtig, denn hierhin werden TYPO3-Systemmeldungen versendet. <strong>Hinweis</strong> Benutzer können diesen Wert innerhalb ihres Benutzerprofils auch selbst ändern (im Modul Benutzer > Einstellungen).

# realName.description
source: Enter the ordinary name of the user, eg. John Doe.
de: Geben Sie den vollständigen Namen des Benutzers an (z.B. Petra Mustermann).

# realName.details
source: <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
de: <strong>Hinweis</strong> Benutzer können diesen Wert innerhalb ihres Benutzerprofils auch selbst ändern (im Modul Benutzer>Einstellungen).

# disable.description
source: This option will temporarily disable the user from logging in.
de: Mit dieser Option können Sie dem Benutzer den Systemzugang verwehren.

# admin.description
source: 'Admin' users have TOTAL access to the system!
de: "Admin"-Benutzer haben VOLLSTÄNDIGEN Zugang zum System!

# admin.details
source: 'Admin' can do anything TYPO3 allows and this kind of user should be used only for administrative purposes. All daily handling should be done with regular users. 'Admin' users don't need to be members of any backend user groups. However you should be aware that any page created by an admin user without a group will not have any owner-group assigned and thus it will probably be invisible for other users. If this becomes a problem you can easily solve it by assigning a user group to the 'Admin' user anyway. This does of course not affect the permissions since they are unlimited, but the first group listed is by default the owner group of newly created pages. 'Admin' users are easily recognized as they appear with a red icon instead of the ordinary blue user-icon. You should probably not assign any other users than yourself as an 'Admin' user.
de: "Admin"-Benutzer können alle Funktionen nutzen, die TYPO3 bietet. Deshalb sollten solche Benutzer nur für administrative Aufgaben verwendet werden. Alle täglich anfallenden Aufgaben können auch mit normalen oder speziell angepassten Benutzern und Benutzergruppen durchgeführt werden. Admin-Benutzer müssen nicht Mitglied einer Benutzergruppe sein. Man sollte sich aber darüber im Klaren sein, dass Aufgrund dieser Tatsache neu von solchen Admins angelegte Seiten deshalb auch keine Besitzergruppe haben und somit für andere Benutzer unter Umständen unsichtbar sind. Wenn das ein Problem darstellt, so kann man Admin-Benutzer einer Benutzergruppe zuweisen. Natürlich werden die Bearbeitungs- und Zugriffsrechte dadurch nicht berührt, denn Admin-Benutzer haben nach wie vor uneingeschränkte Rechte. Neue Seiten werden dadurch jedoch mit den entsprechenden Gruppenrechten angelegt. Admin-Benutzer sind an dem blauen Benutzersymbol zu erkennen, normale Benutzer werden mit einem grünen Symbol dargestellt. Außer sich selbst sollten Sie keinem anderen Benutzer Admin-Rechte einräumen.

# options.description
source: Select if the user should inherit page tree or folder tree mountpoints from member groups.
de: Mit dieser Option wird festgelegt, ob dem Benutzer die Seiten- und Verzeichnisfreigaben der ihm zugeordneten Benutzergruppen zugewiesen (vererbt) werden sollen.

# options.details
source: It's a great advantage to let users inherit mountpoints from membergroups because it makes administration of the same mountpoints for many users extremely easy. If you don't check these options, you must make sure the mount points for the page tree and file folder tree is set specifically for the user.
de: Das Vererben von Datenbank- und Verzeichnisfreigaben durch die Zugehörigkeit zu einer Benutzergruppen macht es Administratoren sehr einfach, eine Freigabe für viele Benutzer zu erstellen und zu verwalten. Wählt man diese Option nicht, müssen für solche Benutzer entsprechende Freigaben für den Seitebaum und Verzeichnisse separat eingerichtet werden.

# fileoper_perms.description
source: Select file operation permissions for the user.
de: Legen Sie die Dateibearbeitungsrechte des Benutzers fest.

# fileoper_perms.details
source: These settings relate to the functions found in the File>List module as well as general upload of files. <strong>Notice</strong> that backend user groups also have file operation permissions which automatically apply to the user if he's member of an accordant group. So if you want a group of users share identical file operation permissions, you should probably define them in a backend user group instead.
de: Diese Einstellungen wirken sich auf die verfügbaren Funktionen innerhalb des Moduls "Datei > Dateiliste" sowie auf das allgemeine Hochladen von Dateien aus. <strong>Beachten</strong> Sie, dass auch Backend-Benutzergruppen Rechte für Dateioperationen festlegen, die automatisch gelten, wenn ein Benutzer Mitglied der entsprechenden Gruppe ist. Soll eine Gruppe Benutzer die selben Rechte für Dateioperationen erhalten, sollten diese besser über eine Backend-Benutzergruppe festgelegt werden.

# starttime.description
source: Enter the date from which the account is active.
de: Geben Sie das Datum an, ab dem der Benutzername gültig sein soll.

# endtime.description
source: Enter the date from which the account is disabled.
de: Geben Sie das Datum an, ab dem der Benutzername ungültig sein soll.

# lastlogin.description
source: This field shows the user's last log in date.
de: Zeigt an, wann sich der Benutzer zuletzt angemeldet hat.

# lang.description
source: Select the <i>default</i> language.
de: Wählen Sie die <i>Standardsprache</i>.

# lang.details
source: This determines the language of the backend interface for the user. All mainstream parts available for regular users are available in the system language selected. 'Admin'-users however will experience that the 'Admin'-only parts of TYPO3 is in english. This includes all submodules in "Tools" and the Web>Template module. <b>Notice</b> this is only setting the default language. As soon as the user has logged in the language must be changed through the User>Setup module. Also you will have to install the corresponding language pack which can be found as an extension on TYPO3.org with the prefix "csh_XX" where XX is the TYPO3 language key.
de: Hier legen Sie die Sprache für das Backend fest. Alle Hauptmenüpunkte normaler Benutzer wurden in die hier gewählte Sprache übersetzt. Admin-Benutzer werden jedoch feststellen, dass die speziellen Admin-Menüs lediglich in Englisch verfügbar sind. Das betrifft zum Beispiel alle Module innerhalb von "Werkzeuge" und im Modul "Web > Template". <b>Hinweis:</b> Die hier gewählte Sprache legt lediglich den Standardwert fest. Nach erfolgreicher Anmeldung kann jeder Benutzer seine persönlichen (Sprach-)Einstellungen im Modul "Benutzerwerkzeuge > Einstellungen" vornehmen. Für jede gewünschte Systemsprache muss der Administrator aber zunächst das entsprechende Sprachpaket installieren. Diese Sprachpakete können im Menü "Admin > Erw-Manager" unter "Übersetzungen" von TYPO3.org heruntergeladen werden.

# userMods.description
source: Select available backend modules for the user.
de: Weist dem Benutzer bestimmte Backend-Module zu.

# userMods.details
source: This determines which 'menu items' are available for the user in the backend. Notice that the same list of modules may be configured for the backend user groups and that these will be inherited by the user in addition to the modules you select here. It's highly likely that you should not set any modules for the user himself but rather select the modules in the backend groups he's a member of. However this list provides a great way to add a single module for specific users.
de: Mit dieser Option wird das Aussehen und der Funktionsumfang des Benutzermenüs festgelegt. Bitte beachten Sie, dass die gleichen Module evtl. schon innerhalb einer Benutzergruppe festgelegt wurden und diese an den Benutzer vererbt werden. Es empfiehlt sich, alle allgemeinen Module innerhalb der Benutzergruppe zu definieren und dem Benutzer hier lediglich einzelne, ganz spezielle Module zuzuweisen.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
de: Definiert zusätzliche, benutzerspezifische TSconfig-Einstellungen (fortgeschrittene Konfiguration)

# TSconfig.details
source: This field allows you to extend the configuration of the user in severe details. A brief summary of the options include a more detailed configuration of the backend modules, setting of user specific default table field values, setting of Rich Text Editor options etc.
de: Mit dieser Einstellung lassen sich dem Benutzer ganz spezielle Konfigurationen (etwa für den RTE oder Optionen einzelner Module etc.) zuweisen. Mit dem Eintrag "mod.SHARED.colPos_list = 1,0,2,3" könnte man z.B. festlegen, dass der Benutzer in allen Spalten Inhalte anlegen darf.

# _TSconfig.seeAlso
source: pages:TSconfig, fe_users:TSconfig, be_groups:TSconfig, User TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/User_TSconfig/
de: pages:TSconfig, fe_users:TSconfig, be_groups:TSconfig, Benutzer-TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/User_TSconfig/

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
de: Legt fest, in welchen Sprachen der Benutzer Inhaltselemente bearbeiten darf.
