Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_sysfilem.xlf
Languages: de

# .description
source: Filemounts describe a filepath on the server, relative or absolute.
de: Verzeichnisfreigaben beschreiben relative oder absolute Pfade auf dem Server.

# .details
source: By creating a file mount record and placing a reference to it in a Backend usergroup you can allow a user access to the file mount in the File>List module. Filemounts may also configure access to a path on the server to which the user has FTP-access. Just remember to set file-permissions on the server correctly so the webserver user (which PHP is running as) has at least read access to the FTP-dir. You can only mount absolute paths if they are within the base path set in $TYPO3_CONF_VARS[BE][lockRootPath]
de: Indem Sie eine Verzeichnisfreigabe erstellen und diese Freigabe einer Backend-Benutzergruppe zuweisen, gewähren Sie diesen Benutzern den Zugriff auf die freigegebenen Dateien (über das Menü "Datei > Dateiliste"). Verzeichnisfreigaben können unter Umständen auch Pfade beschreiben, zu denen der Benutzer direkten Zugriff per FTP hat. Stellen Sie in diesem Fall sicher, dass der Web-Server (bzw. der Systembenutzer, unter dessen Kennung der PHP-Prozess läuft) zumindest Leserechte auf diese Dateien hat - andernfalls erscheinen solche Dateien nicht im TYPO3-Datei-Browser! Absolute Pfade für Verzeichnisfreigaben sind nur innerhalb des durch die Systemvariable $TYPO3_CONF_VARS[BE][lockRootPath] festgelegten Pfades möglich.

# _.seeAlso
source: be_groups:file_mountpoints, be_users:file_mountpoints, More about File mounts | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/
de: be_groups:file_mountpoints, be_users:file_mountpoints, Mehr über Dateifreigaben | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/

# title.description
source: Enter a title for the filemount. The title will appear as the name of the file mount when it is applied to users and groups.
de: Geben Sie einen Namen für die Verzeichnisfreigabe an. Dieser Name erscheint, wenn Sie Benutzern oder Gruppen diese Verzeichnisfreigabe zuweisen.

# path.description
source: Enter the path of the filemount, relative or absolute depending on the settings of BASE.
de: Geben Sie den relativen oder absoluten Pfad zur Verzeichnisfreigabe an (abhängig davon, welche Option Sie bei Basis wählen).

# path.details
source: If BASE is set to relative, the path mounted is found in the subfolder "fileadmin/" of the website. Then you should enter the subfolder in "fileadmin/" as path. For instance if you want to mount access to "fileadmin/user_uploads/all/" then enter the value "user_uploads/all" as the value of PATH. If BASE is absolute you should enter the absolute path on the server, eg. "/home/ftp_upload" or "C:/home/ftp_upload". Further you must make sure the configuration variable $TYPO3_CONF_VARS[BE][lockRootPath] contains the first part of the path you want to mount. <strong>Notice:</strong> In any case, make sure the webserver user which PHP is running as has <em>at least</em> read-access to the path. If not, the mount will simply not appear without any warnings. If you have problems - especially with absolute mounts - try to mount something "simple" like a relative path in fileadmin. If that is working well, try the absolute path. Your PHP-configuration may also impose other restrictions on you if open_basedir is enabled. Then use relative paths.
de: Wenn Sie bei Basis die Option "relativ" wählen, beziehen sich Verzeichnisfreigaben auf Unterordner von "fileadmin/". Beispiel: Um Ihren Benutzern den Ordner "fileadmin/user_upload/" zur Verfügung zu stellen, können Sie zunächst die Basis-Option "relativ" wählen und dann als Pfad "user_upload/" eingeben. Wenn Sie bei Basis die Option "absolut" wählen, beziehen sich Verzeichnisfreigaben auf den absoluten Pfad auf dem Server, also z.B. "/home/ftp_upload" oder "C:/home/ftp_upload". Sie müssen hierbei darauf achten, dass der erste Teil des angegebenen Pfades auch in der Systemvariablen $TYPO3_CONF_VARS[BE][lockRootPath] eingetragen ist. <strong>Hinweis:</strong> Stellen Sie sicher, dass der Benutzer des Web-Servers, unter dem PHP läuft, <em>mindestens</em> Leserechte für den Pfad hat. Wenn das nicht der Fall ist, wird die Freigabe ohne weitere Warnung nicht angezeigt. Wenn Sie Probleme mit Verzeichnisfreigaben haben, versuchen Sie zuerst, einen "einfachen" Pfad, wie einen relativen Pfad im Ordner fileadmin/ freizugeben. Wenn das funktioniert, probieren Sie absolute Pfade. Ihre PHP-Konfiguration kann auch weitere Einschränkungen beinhalten, nämlich wenn "Safe Mode" oder "Open Basedir" aktiviert sind. Nutzen Sie in diesem Fall relative Pfade.

# path.image_descr
source: This is a filemount relative to "fileadmin/". The mounted folder is "fileadmin/user_upload/" since "user_upload" is the value of the "Path" field. The directory structure of "fileadmin/" where you can see the "user_upload" folder in the bottom of the list.
de: Dies ist eine Verzeichnisfreigabe relativ zum Ordner "fileadmin/". Weil als Pfad "user_upload" eingegeben wurde, ist der freigegebene Ordner "fileadmin/user_upload". Dies ist die Ordnerstruktur von "fileadmin/". Sie finden den Ordner "user_upload" am Ende der Liste.

# hidden.description
source: Use this option to temporarily disable the filemount.
de: Verwenden Sie diese Option, um die Verzeichnisfreigabe zeitweilig aufzuheben.

# hidden.details
source: All backend users using the mount will not have access anymore. This includes 'Admin'-users.
de: Allen Backend-Benutzern - 'Admin'-Benutzer eingeschlossen - wird der Zugriff auf diese Verzeichnisfreigabe entzogen.

# base.description
source: Determines whether the value of the PATH field is to be recognized as an absolute path on the server or a path relative to the fileadmin/ subfolder to the website.
de: Legt fest, ob das Feld "Pfad" als absoluter Pfad oder als relativer Pfad (bezogen auf den Ordner fileadmin/) interpretiert werden soll.
