Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_misc.xlf
Languages: de

# shortcutDescription
source: This is the shortcuts menu. You do not have any shortcuts added yet, you can do so by clicking the shortcut icon %icon%, which you can find on each page in the backend.
de: Dieses Menü zeigt von Ihnen angelegte Verweise an. Sie haben noch keine Verweise hinzugefügt, können das aber mit einem Mausklick auf das Verweissymbol %icon% tun, das auf jeder Seite des Backends vorhanden ist.

# shortcut_edit
source: Edit
de: Bearbeiten

# shortcut_create
source: Create
de: Erstellen

# shortcut_editID
source: Edit/Search
de: Bearbeiten/Suchen

# shortcut_save
source: Update shortcut title
de: Verweistitel aktualisieren

# shortcut_saveClose
source: Update and close editor
de: Aktualisieren und Editor schließen

# shortcut_close
source: Close shortcut editor
de: Verweiseditor schließen

# shortcut_delete
source: Remove shortcut
de: Verweis entfernen

# shortcut_loadEdit
source: Loading page
de: Seite wird geladen

# shortcut_searchFor
source: Search for:
de: Suchen nach:

# shortcut_notEditable
source: No editable page found!
de: Keine Seite zur Bearbeitung gefunden!

# shortcut_group
source: Group
de: Gruppe

# shortcut_group_1
source: Pages
de: Seiten

# shortcut_group_2
source: Records
de: Datensätze

# shortcut_group_3
source: Files
de: Dateien

# shortcut_group_4
source: Tools
de: Werkzeuge

# shortcut_group_5
source: Miscellaneous
de: Verschiedenes

# shortcut_all
source: All
de: Alle

# shortcut_onlyAdmin
source: You cannot edit a shared shortcut!
de: Sie können keine gemeinsamen Verweise bearbeiten!

# shortcut_selSC
source: Select shortcut
de: Verweis auswählen

# shortcut_delAllInCat
source: Delete all shortcuts in this group?
de: Alle Verweise in dieser Gruppe löschen?

# shortcut_onlineWS
source: LIVE workspace
de: LIVE-Arbeitsumgebung

# shortcut_offlineWS
source: Draft workspace
de: Entwurfsarbeitsumgebung

# shortcut_active
source: active
de: aktiv

# shortcut_inactive
source: inactive
de: inaktiv

# shortcut_noWSfound
source: ERROR: No workspaces found!
de: FEHLER: Keine Arbeitsumgebungen gefunden!

# shortcut_FEPreview
source: Enable Frontend Preview
de: Vorschau im Frontend aktivieren

# shortcut_workspace
source: Go to Workspace Module
de: Modul Arbeitsumgebungen aufrufen

# bookmarkDescription
source: This is the bookmarks menu. You do not have any bookmarks added yet, you can do so by clicking the bookmark icon %icon%, which you can find on each page in the backend.
de: Dieses Menü zeigt von Ihnen angelegte Lesezeichen an. Sie haben noch keine Lesezeichen hinzugefügt, können das aber mit einem Mausklick auf das Lesezeichensymbol %icon% tun, das auf jeder Seite des Backends vorhanden ist.

# bookmark_edit
source: Edit
de: Bearbeiten

# bookmark_create
source: Create
de: Erstellen

# bookmark_editID
source: Edit/Search
de: Bearbeiten/Suchen

# bookmark_save
source: Update bookmark title
de: Lesezeichentitel aktualisieren

# bookmark_saveClose
source: Update and close editor
de: Aktualisieren und Editor schließen

# bookmark_close
source: Close bookmark editor
de: Lesezeicheneditor schließen

# bookmark_delete
source: Remove bookmark
de: Lesezeichen entfernen

# bookmark_loadEdit
source: Loading page
de: Seite wird geladen

# bookmark_searchFor
source: Search for:
de: Suchen nach:

# bookmark_notEditable
source: No editable page found!
de: Keine Seite zur Bearbeitung gefunden!

# bookmark_group
source: Group
de: Gruppe

# bookmark_group_1
source: Pages
de: Seiten

# bookmark_group_2
source: Records
de: Datensätze

# bookmark_group_3
source: Files
de: Dateien

# bookmark_group_4
source: Tools
de: Werkzeuge

# bookmark_group_5
source: Miscellaneous
de: Verschiedenes

# bookmark_all
source: All
de: Alle

# bookmark_onlyAdmin
source: You cannot edit a shared bookmark!
de: Sie können keine gemeinsamen Lesezeichen bearbeiten!

# bookmark_selSC
source: Select bookmark
de: Lesezeichen auswählen

# bookmark_delAllInCat
source: Delete all bookmarks in this group
de: Alle Lesezeichen in dieser Gruppe löschen

# bookmark_onlineWS
source: LIVE workspace
de: LIVE-Arbeitsumgebung

# bookmark_offlineWS
source: Draft workspace
de: Entwurfsarbeitsumgebung

# bookmark_active
source: active
de: aktiv

# bookmark_inactive
source: inactive
de: inaktiv

# bookmark_noWSfound
source: ERROR: No workspaces found!
de: FEHLER: Keine Arbeitsumgebungen gefunden!

# bookmark_FEPreview
source: Enable Frontend Preview
de: Vorschau im Frontend aktivieren

# bookmark_workspaceComparisonView
source: Enable comparison view
de: Vergleichsansicht aktivieren

# bookmark_workspace
source: Go to Workspace Module
de: Modul Arbeitsumgebungen aufrufen

source: Overwrite existing files
de: Vorhandene Dateien überschreiben

# selectPosition
source: Select a position for the new page
de: Position für neue Seite auswählen

source: Page (select position)
de: Seite (Position auswählen)

source: Go back
de: Zurück

# createNewPage
source: Create a new page
de: Neue Seite erstellen

# createNewContent
source: Create a new content element
de: Neues Inhaltselement erstellen

# clickForWizard
source: Click here for wizard!
de: Zum Aufrufen des Assistenten hier klicken!

# insertNewPageHere
source: Insert the new page here
de: Neue Seite hier einfügen

source: Insert new record here
de: Neuen Datensatz hier einfügen

# movePageToHere
source: Move page to this position
de: Seite an diese Position verschieben

source: Move element
de: Element verschieben

source: Move elements
de: Elemente verschieben

source: Copy elements
de: Elemente kopieren

# selectPositionOfElement
source: Select position of the element
de: Position für das Element auswählen

# movingElement
source: Move element
de: Element verschieben

# makeCopy
source: Make copy instead of moving element
de: Kopieren statt Verschieben

source: New content element
de: Neues Inhaltselement

source: System Records
de: Systemdatensätze

# 1_selectType
source: 1: Select type of content element:
de: 1: Typ des Inhaltselements auswählen:

source: 2: Select position:
de: 2: Position auswählen:

# CM_editAccess
source: Visibility settings
de: Sichtbarkeitseinstellungen

# CM_history
source: History/Undo
de: Verlauf/Rückgängig

# CM_perms
source: Access
de: Zugriff

# CM_moveWizard
source: Move element
de: Element verschieben

# CM_moveWizard_page
source: Move page
de: Seite verschieben

# CM_newWizard
source: 'Create New' wizard
de: "Neu erstellen"-Assistent

# CM_editPageProperties
source: Edit page properties
de: Seiteneigenschaften bearbeiten

# CM_db_list
source: Web>List module
de: Web > Liste

# noEditPage
source: You asked to edit page "%s" but you cannot edit this page. Now loading backend as usual.
de: Sie möchten die Seite "%s" bearbeiten, dies ist jedoch nicht möglich. Das Backend wird wie gewöhnlich geladen.

source: Localize
de: Lokalisieren

# localize.isLocalizable
source: Record can be localized
de: Datensatz kann lokalisiert werden

# localize.wasRemovedInOriginal
source: Record was removed in original language
de: Datensatz der Ursprungssprache wurde entfernt

source: Localize all records
de: Alle Datensätze lokalisieren

# localizeMergeIfNotBlank
source: The value of the default language will be used if this field is left empty in the translation.
de: Der Wert der Standardsprache wird verwendet falls dieses Feld in der Übersetzung leer gelassen wird.

source: Synchronize with original language
de: Mit Ursprungssprache synchronisieren

source: Switch to User
de: Umschalten zu Benutzer

# fileUpload_windowTitle
source: File Upload Progress
de: Hochladen von Dateien

# fileUpload_buttonSelectFiles
source: Select Files
de: Dateien auswählen

# fileUpload_buttonCancelAll
source: Cancel All Uploads
de: Alle Übertragungen abbrechen

# fileUpload_infoComponentMaxFileSize
source: You can upload files with a maximum size of {0}.
de: Es können Dateien bis zu einer Größe von {0} hochgeladen werden.

# fileUpload_infoComponentFileUploadLimit
source: You can upload a total of {0}.
de: Es können insgesamt {0} hochgeladen werden.

# fileUpload_infoComponentFileTypeLimit
source: You can upload the following file types {0}.
de: Es können folgende Dateitypen hochgeladen werden {0},

# fileUpload_infoComponentOverrideFiles
source: Overwrite existing files
de: Vorhandene Dateien überschreiben

# fileUpload_processRunning
source: Another process is already uploading
de: Es läuft bereits ein anderer Hochladevorgang

# fileUpload_uploadWait
source: Waiting to start upload of {0}
de: Warten auf Hochladen von {0}

# fileUpload_uploadStarting
source: Starting upload of {0}
de: Starten des Hochladens von {0}

# fileUpload_uploadProgress
source: {0}% of {1} uploaded
de: {0}% von {1} hochgeladen

# fileUpload_uploadSuccess
source: {0} was successfully uploaded!
de: {0} erfolgreich hochgeladen!

# fileUpload_errorQueueLimitExceeded
source: Too many files selected
de: Zu viele Dateien ausgewählt

# fileUpload_errorQueueFileSizeLimit
source: {0} is too big
de: {0} ist zu groß

# fileUpload_errorQueueZeroByteFile
source: {0} is empty
de: {0} ist leer

# fileUpload_errorQueueInvalidFiletype
source: Filetype not allowed for {0}
de: Dateityp nicht erlaubt bei {0}

# fileUpload_errorUploadHttp
source: Too many files selected
de: Zu viele Dateien ausgewählt

# fileUpload_errorUploadHttpError
source: A HTTP error occured: {0}
de: HTTP-Fehler aufgetreten: {0}

# fileUpload_errorUploadMissingUrl
source: Internal error: No Upload URL set
de: Interner Fehler: Keine Hochlade-URL festgelegt

# fileUpload_errorUploadIO
source: Internal error: Problems while reading/writing the file
de: Interner Fehler: Fehler beim Lesen/Schreiben der Datei

# fileUpload_errorUploadSecurityError
source: Internal error: {0}
de: Interner Fehler: {0}

# fileUpload_errorUploadLimit
source: Upload limit exceeded
de: Höchstwert für Hochladen überschritten

# fileUpload_errorUploadFailed
source: Upload failed
de: Hochladen fehlgeschlagen

# fileUpload_errorUploadFileIDNotFound
source: Internal error: File ID not found
de: Interner Fehler: Datei-ID nicht gefunden

# fileUpload_errorUploadFileValidation
source: Internal error while validating the file
de: Interner Fehler beim Validieren der Datei

# fileUpload_errorUploadFileCancelled
source: Upload of {0} canceled
de: Hochladen von {0} abgebrochen

# fileUpload_errorUploadStopped
source: Upload of {0} stopped
de: Hochladen von {0} angehalten

# fileUpload_allErrorMessageTitle
source: All uploads failed
de: Hochladen aller Dateien fehlgeschlagen

# fileUpload_allErrorMessageText
source: All of your uploads failed.<br /><br />If this problem persists, please try another browser, contact your administrator or disable this "Flash Uploader" in your User Settings.<br /><br />Detailed problem description:<br />
de: Keiner der Hochladevorgänge konnte abgeschlossen werden.<br /><br />Falls dieses Problem weiterhin besteht, benutzen Sie bitte einen anderen Browser, kontaktieren Ihren Administrator oder deaktivieren die Option "Flash-Schnittstelle zum Hochladen" in den Benutzereinstellungen.<br /><br />Problembeschreibung:<br />

# fileUpload_allError401
source: The server returned the status code 401, which is related to a .htaccess file used for password protection on your server. Unfortunately this can not be handled by your browser's Flash plugin.
de: Der Server lieferte Statuscode 401 zurück. Dies ist häufig auf einen .htaccess Passwortschutz zurückzuführen. Leider wird dies von dem von Ihnen verwendeten Flash-Plugin nicht unterstützt.

# fileUpload_allError2038
source: An input/output error occured (Error #2038). This i.e. happens with servers using a self-signed SSL certificate, which is a limitation of your browser's Flash plugin.
de: Ein Lese-/Schreibfehler ist aufgetreten (Fehler #2038). Dies ist häufig auf ein selbstsigniertes SSL-Zertifikat zurückzuführen. Leider wird dies von dem von Ihnen verwendeten Flash-Plugin nicht unterstützt.

# liveSearch_title
source: Short result list
de: Kurze Liste der Ergebnisse

# liveSearch_emptyText
source: Enter search term
de: Suchbegriff eingeben

# liveSearch_loadingText
source: Searching...
de: Suche läuft...

# liveSearch_listEmptyText
source: No results found.
de: Keine Ergebnisse gefunden.

# liveSearch_showAllResults
source: Show All
de: Alle anzeigen

# liveSearch_helpTitle
source: How to use advanced search tags
de: Zur Benutzung von Suchpräfixen

# liveSearch_helpDescription
source: Search in certain tables:
de: In ausgewählten Tabellen suchen:

# liveSearch_helpDescriptionPages
source: #page:Home will search for all pages with the title "Home"
de: #page:Home sucht nach allen Seiten mit dem Titel "Home".

# extDirect_timeoutHeader
source: Connection Problem
de: Verbindungsproblem

# extDirect_timeoutMessage
source: Sorry, but an error occurred while connecting to the server. Please check your network connection.
de: Bei dem Versuch eine Verbindung zum Server herzustellen ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Netzwerkverbindung.

# viewPort_tooltipModuleMenuSplit
source: Drag to resize the Modules Menu
de: Ziehen Sie hier, um die Größe des Modulmenüs zu ändern

# viewPort_tooltipNavigationContainerSplitDrag
source: Drag to resize or double click to collapse the tree
de: Ziehen Sie hier, um die Größe zu ändern oder doppelklicken Sie, um den Baum einzuklappen

# viewPort_tooltipDebugPanelSplitDrag
source: Drag to resize or click to collapse the Debug Panel.
de: Ziehen Sie hier, um die Größe zu ändern oder klicken Sie, um das Debug-Panel zuzuklappen
