Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_sysws.xlf
Languages: de

# .description
source: Defines custom workspaces in TYPO3 which allows for groups of people to work together in a publishing process with draft content. More information about workspaces can be found in the document "Inside TYPO3".
de: Definiert Arbeitsumgebungen für TYPO3, mit deren Hilfe Gruppen von Benutzern im Prozess der Inhaltserstellung zusammen an Entwürfen arbeiten können. Weitere Informationen über Arbeitsumgebungen finden Sie im Dokument "Inside TYPO3".

# title.description
source: Enter the name of the workspace. This value is shown in the workspace selector box in the backend.
de: Geben Sie den Namen der Arbeitsumgebung ein. Dieser Wert wird im Auswahlfeld für Arbeitsumgebungen im Backend angezeigt.

# description.description
source: Make a description of the workspace purpose here. This information is shown in the Workspace Manager and should instruct the workspace users about the purpose of the workspace.
de: Beschreiben Sie hier den Zweck der Arbeitsumgebung. Dieser Text wird von der Arbeitsumgebungsverwaltung angezeigt und sollte den Benutzern der Arbeitsumgebungen den Zweck der Arbeitsumgebung erläutern.

# adminusers.description
source: Owners of the workspace are those who are allowed to add members and reviewers to the workspace and pick the page tree starting points etc.
de: Die Besitzer einer Arbeitsumgebung können dieser Mitglieder und Redakteure hinzufügen, die Einstiegspunkte der Seitenbäume festlegen usw.

# adminusers.details
source: Owners can also add and delete other owners. If a user is allowed to create workspaces himself he will automatically become the initial owner user of the workspace. They are also the only ones who can eventually publish the workspace content (except general TYPO3 "admin" users) and thus the highest review authority (unless members/reviewers have access to the Live workspace).
de: Besitzer sind auch in der Lage, andere Besitzer hinzuzufügen und zu löschen. Hat ein Benutzer das Recht, Arbeitsumgebungen zu erstellen, so wird er dabei automatisch zum ursprünglichen Besitzer der Arbeitsumgebung. Besitzer sind darüber hinaus - abgesehen von TYPO3-Administratoren - die einzigen, die den Inhalt einer Arbeitsumgebung schließlich veröffentlichen können und besitzen daher die größte Kontrolle (sofern die Mitglieder und Redakteure keinen Zugriff auf die Live-Arbeitsumgebung besitzen).

# members.description
source: Members can be backend users or groups and will have access to work in the workspace. They cannot publish content (unless they have access to the Live workspace) but only edit it after which they will forward it for approval by a reviewer.
de: Bei den Mitgliedern kann es sich sowohl um Backend-Benutzer als auch -Gruppen handeln. Diese können in der Arbeitsumgebung arbeiten. Sie können Inhalte nicht veröffentlichen (es sei denn, sie hätten Zugriff auf die Live-Arbeitsumgebung), sondern nur bearbeiten. Anschließend leiten sie das Ergebnis zur Begutachtung an einen Redakteur weiter.

# reviewers.description
source: Content have to pass through reviewers approval before it can finally be published by a workspace owner. Reviewers can be backend users or groups and will have access to the workspace just as members have, but can in addition approve content for final publication.
de: Inhalte müssen erst von Redakteuren freigegeben werden, bevor sie schließlich von einem Besitzer der Arbeitsumgebung veröffentlicht werden. Bei den Redakteuren kann es sich sowohl um Backend-Benutzer als auch -Gruppen handeln. Diese haben in der Arbeitsumgebung die gleichen Rechte wie Mitglieder, können aber zusätzlich Inhalte zur Veröffentlichung freigeben.

# reviewers.details
source: In case you need no review layer between editors (normally workspace "members") and the workspace owners what you simply do is to add all editors as reviewers. This give them access to raise content all the way to the workspace owners. Since content is by default raised from editing to review to publish state it even gives the possibility of informal "four-eye" review where workspace owners can require that content has been raised by action from two different reviewers.
de: Falls zwischen Mitgliedern und Besitzern keine weitere Ebene benötigt wird, können die Autoren auch als Redakteure hinzugefügt werden. Damit erhalten sie dann die Möglichkeit, den Status der Inhalte bis zur Weitergabe an den Besitzer zu erhöhen. Da Inhalte standardmäßig eine Kette von Bearbeiten über Redigieren bis Veröffentlichen durchlaufen, eröffnet sich so die Möglichkeit informeller "Vier-Augen-Prüfung", bei der die Besitzer der Arbeitsumgebung fordern, dass Inhalt von zwei verschiedenen Redakteuren für gut befunden worden sein muss.

# stagechg_notification.description
source: When the stage of content changes, users in the workspace can receive a notification by email. Only members/reviewers who are attached to the workspace as users and not through their groups will be notified.
de: Bei einer Änderung des Inhaltsstatus können Benutzer in der Arbeitsumgebung per E-Mail benachrichtigt werden. Es werden nur Mitglieder und Redakteure benachrichtigt, die der Arbeitsumgebung als Benutzer hinzugefügt wurden, aber nicht diejenigen, die nur über Gruppen dazugehören.

# stagechg_notification.details
source: "Notify users on next stage only": When content is raised from "Editing" to "Review", reviewers are notified. When content is raised to "Publish", owners are notified. When content is rejected, members and reviewers are notified. When content is raised from rejected state, members are notified. "Notify all users on any change" : All users in workspace are notified regardless of change.
de: "Nur Benutzer der nächsten Stufe benachrichtigen": Wird Inhalt von "Bearbeiten" auf "Redigieren" angehoben, werden die Redakteure benachrichtigt. Wird Inhalt auf "Veröffentlichen" angehoben, werden die Besitzer benachrichtigt. Falls Inhalt zurückgewiesen wird, werden Mitglieder und Redakteure benachrichtigt. Wird Inhalt von "Zurückgewiesen" aus angehoben, werden die Mitglieder benachrichtigt. "Alle Benutzer bei jeder Änderung benachrichtigen": Unabhängig von der Änderung werden sämtliche Benutzer der Arbeitsumgebung benachrichtigt.

# db_mountpoints.description
source: If one or more DB mounts are specified the page tree of the backend will be locked into these root points during work in the workspace.
de: Wurden eine oder mehrere Datenbankfreigaben definiert, so stehen diese während der Arbeit in der Arbeitsumgebung als Baumwurzeln zur Verfügung.

# db_mountpoints.details
source: Any DB mount specified here must be inside the DB mount set for the backend user who logs in. If that is not the case the workspace DB mount will simply not be mounted for the user. If no DB mounts are specified for the workspace the users will access the DB mounts of their user profile.
de: Alle hier angegebenen Datenbankfreigaben müssen Teil der für den angemeldeten Benutzer gesetzten Datenbankfreigaben sein. Ist dies nicht der Fall, werden die Datenbankfreigaben nicht eingebunden. Sind keine Datenbankfreigaben für die Arbeitsumgebung angegeben, hat der Benutzer Zugriff auf diejenigen seines Benutzerprofils.

# file_mountpoints.description
source: Filemounts available for workspace users. Please see details for security information!
de: Verzeichnisfreigaben, die für Benutzer der Arbeitsumgebung verfügbar sind. Sicherheitsinformationen siehe Details!

# file_mountpoints.details
source: IMPORTANT: By default a draft workspace has all filemounts disabled! This is because versioning does not apply to any files edited through filemounts in TYPO3. Hence any access to those files would violate the principle that no content managed in a draft workspace will be live before published. However, for specific projects this violation might be acceptable or necessary and therefore you can add a filemount. This will be forced upon any user in the workspace regardless of his filemounts inherited from his groups and user profile!
de: WICHTIG: Standardmäßig sind in der Entwurfsarbeitsumgebung alle Verzeichnisfreigaben deaktiviert! Grund hierfür ist, dass unter TYPO3 keine Versionierung für über Verzeichnisfreigaben bearbeitete Dateien zur Verfügung steht. Daher würde Zugriff auf diese Dateien das Prinzip verletzen, dass in Entwurfsarbeitsumgebungen verwaltete Inhalte nicht vor der Veröffentlichung online verfügbar sind. Bei bestimmten Projekten kann diese Abweichung jedoch akzeptabel oder notwendig sein. Daher ist es möglich, eine Verzeichnisfreigabe anzugeben. Diese wird für alle Benutzer unabhängig von den über ihre Gruppenzugehörigkeit oder ihr eigenes Profil zugewiesenen Verzeichnisfreigaben erzwungen.

# publish_time.description
source: Specify a time of publication of the workspace content.
de: Gibt den Zeitpunkt an, zu dem der Inhalt der Arbeitsumgebung veröffentlicht werden soll.

# publish_time.details
source: The publish and unpublish times are active only if "mod/user/ws/cli/ws_cli.phpsh" is set up as a cronjob running every minute. Example configuration could be "* * * * * /[ABSOLUTE PATH TO TYPO3 SITE]/typo3/mod/user/ws/cli/ws_cli.phpsh"
de: Die Zeitpunkte für die Veröffentlichung und das Zurückziehen wirken sich nur aus, wenn für "mod/user/ws/cli/ws_cli.phpsh" ein minütlich laufender Cron-Job eingerichtet wurde. Eine Beispielkonfiguration könnte folgendermaßen lauten: "* * * * * /[ABSOLUTE PATH TO TYPO3 SITE]/typo3/mod/user/ws/cli/ws_cli.phpsh"

# unpublish_time.description
source: Specify an additional time of (un)publication of the workspace content.
de: Gibt einen weiteren Zeitpunkt an, zu dem der Inhalt der Arbeitsumgebung veröffentlicht bzw. zurückgezogen werden soll.

# unpublish_time.details
source: By "additional" is meant that both publishing times are used in a similar way, but if "Publish" is specified it takes precedence over "Unpublish". Anyway, the point of two publishing times is that workspace content could be swapped in for a limited period and then out again. But notice; for this to work the Swap mode must be set to "Swap-Into-Workspace on Auto-publish".
de: "Weiterer" heißt, dass beide Zeitpunkte für das Veröffentlichen auf ähnliche Weise behandelt werden, aber das "Veröffentlichen" Priorität über dem "Zurückziehen" genießt. Zweck zweier Veröffentlichungszeitpunkte ist, den Inhalt der Arbeitsumgebung für eine gewisse Zeit verfügbar zu machen und dann wieder zu entfernen. Beachten Sie, dass dies nur funktioniert, wenn als Tauschmodus "Tausch in Arbeitsumgebung hinein bei automatischer Veröffentlichung".

# freeze.description
source: If set, no editing is allowed inside workspace.
de: Ist diese Option aktiv, ist innerhalb der Arbeitsumgebung keine Bearbeitung möglich.

# live_edit.description
source: If set, records from tables where versioning is not enabled can still be edited "live" inside the workspace.
de: Ist diese Option aktiv, können Datensätze aus Tabellen, für die keine Versionierung aktiviert wurde, trotzdem "live" in der Arbeitsumgebung bearbeitet werden.

# review_stage_edit.description
source: If set, records raised to Review stage can still be edited by workspace members. This allows late changes to be made while waiting for the review. Only when the stage is raised to Publish the record is completely locked for editing for members and reviewers.
de: Ist diese Option aktiv, können auf die Stufe "Redigieren" angehobene Datensätze weiterhin von Mitgliedern der Arbeitsumgebung bearbeitet werden. Auf diese Weise können noch Änderungen vorgenommen werden, während auf die Redaktion gewartet wird. Der Datensatz wird erst für weitere Änderungen durch Mitglieder und Redakteure gesperrt, wenn er auf die Stufe "Veröffentlichen" angehoben wird.

# disable_autocreate.description
source: If set, records are not automatically created as new versions when edited in the workspace. A new version must be manually created first.
de: Wenn aktiviert, werden Datensätze nicht automatisch als neue Version erstellt, wenn sie in der Arbeitsumgebung bearbeitet werden. Eine neue Version muss zuerst manuell erstellt werden.

# swap_modes.description
source: Defines modes for publishing as a "swap" action where the online content is moved into the workspace in exchange for the workspace content.
de: Legt Modi für die Veröffentlichung über einen Austauschvorgang fest, bei dem der Online-Inhalt in die Arbeitsumgebung verschoben und durch den Inhalt der Arbeitsumgebung ersetzt wird.

# swap_modes.details
source: By default swapping is allowed. Thereby two versions can be published "in and out" of a workspace multiple times, always substituting each other. If this is not desired, it can be disabled with "Disable Swap-Into-Workspace". Another mode "Swap-Into-Workspace on Auto-publish" will force the automatic publishing through the cronjob to swap versions. This is necessary to use if you specify both a publish AND un-publish time because otherwise the workspace will be empty after the first publish action!
de: Standardmäßig ist das Austauschen erlaubt. Daher ist es möglich, zwei Versionen mehrfach gegeneinander auszustauschen, wobei jeweils die Version in der Arbeitsumgebung durch die andere ersetzt wird. Ist dies unerwünscht, kann die Funktion über die Option "Austausch mit Arbeitsumgebung deaktivieren" deaktiviert werden. Ein weiterer Modus, "Austausch mit Arbeitsumgebung bei automatischer Veröffentlichung" erzwingt die automatische Veröffentlichung über den Cron-Job für den Versionsaustausch. Dies ist erforderlich, wenn Zeitpunkte für das Veröffentlichen <em>und</em> Zurückziehen angegeben werden sollen, da die Arbeitsumgebung nach dem ersten Austauschvorgang anderfalls leer ist!

# vtypes.description
source: Select versioning types you want to disable for workspace editors/reviewers (admin users and owners are not limited).
de: Wählen Sie hier die Versionierungstypen aus, die Mitgliedern und Redakteuren der Arbeitsumgebung nicht zur Verfügung stehen sollen. (Für Administratoren und Besitzer gelten keine Einschränkungen.)

# vtypes.details
source: "Element" is the most common form of versioning where a single element is versionized solo. "Page" is a versioning type where a page record and child records from specified tables (like "Content Elements" and "Language Overlay Records") are copied along. This form is more complex but offers flexibility in terms of rearrangement of elements on the page. "Branch" versioning is where a page is versionized and all subpages and content is copied along. This can have quite heavy implications on data duplication and is recommended only in special circumstances. More information about versioning types can be read in "Inside TYPO3"
de: "Element" ist die gebräuchlichste Form der Versionierung. Bei ihr wird ein einzelnes Element für sich allein versioniert. Beim Versionierungstypen "Seite" werden ein Seitendatensatz und festgelegte Kinddatensätze, wie z.B. Inhaltselemente und Sprachen-Overlay-Datensätze, übernommen. Hierbei handelt es sich um eine komplexere Form der Versionierung, die jedoch einen Gewinn an Flexibilität bei der Anordnung von Elementen auf einer Seite bedeutet. Beim Typ "Zweig" wird nicht nur eine Seite versioniert, sondern es werden auch sämtliche Unterseiten und deren Inhalte übernommen. Dies zieht ggf. den Anfall großer Datenmengen nach sich und wird nur für besondere Fälle empfohlen. Weitere Informationen über Versionierungstypen erhalten Sie im Handbuch "Inside TYPO3".

# publish_access.description
source: Refines the rules of publishing
de: Legt Feinheiten für die Veröffentlichungsregeln fest

# publish_access.details
source: "Publish only content in publish stage" : Only when content is in publish stage can it be published. "Only workspace owner can publish" : Only the workspace owner can publish the content in the workspace, even if members or reviewers have access to the Live workspace.
de: "Nur Inhalte der Stufe 'Veröffentlichen' veröffentlichen": Inhalte können nur veröffentlicht werden, wenn sie sich in der Stufe "Veröffentlichen" befinden. "Nur Besitzer der Arbeitsumgebung kann veröffentlichen": Der Inhalt kann auch dann nur von einem Besitzer der Arbeitsumgebung veröffentlicht werden, wenn Mitglieder oder Redakteure Zugriff auf die Live-Arbeitsumgebung haben.
