Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_mod_user_ws.xlf
Languages: de

# mlang_labels_tablabel
source: Workspace overview
de: Arbeitsumgebungsübersicht

# mlang_labels_tabdescr
source: Workspace overview showing the changes you have made in the workspace. Here you can also publish the changes to the website if you are allowed to do that.
de: Die Arbeitsumgebungsübersicht zeigt Änderungen, die in einer Arbeitsumgebung vorgenommen wurden. Mit den entsprechenden Berechtigungen können Sie die Änderungen an der Website von hier aus veröffentlichen.

# mlang_tabs_tab
source: Workspace
de: Arbeitsumgebung

# title
source: Workspace Manager
de: Arbeitsumgebungsverwaltung

# menuitem_review
source: Review and Publish
de: Begutachten und veröffentlichen

# menuitem_workspaces
source: Workspace List
de: Arbeitsumgebungsliste

# filter_drafts
source: Drafts
de: Entwürfe

# filter_archive
source: Archive
de: Archiv

# filter_all
source: All
de: Alle

# diff_no_diff
source: Do not show differences
de: Untersch. nicht anzeigen

# diff_show_inline
source: Show differences inline
de: Untersch. in Zeile anzeigen

# diff_show_popup
source: Show diff. popups (branches)
de: Untersch.-PopUp (Zweige) anzeigen

# label_errors
source: Errors:
de: Fehler:

# workspace_description_live
source: The LIVE workspace allows changes to take effect immediately on the website. However versioning can be applied inside the live workspace and this overview shows you draft and archive versions from the various workspaces, including the LIVE workspace.
de: Die LIVE-Arbeitsumgebung ermöglicht Änderungen, die sich direkt auf die Website auswirken. Trotzdem kann eine Versionierung in der LIVE-Arbeitsumgebung angelegt werden. Dieser Überblick zeigt die Entwurfs- und Archivversionen der einzelnen Arbeitsumgebungen, inkl. der LIVE-Arbeitsumgebung.

# workspace_description_draft
source: In the Draft workspace all changes will be made as new versions of the live content. Changes can be previewed, reviewed and eventually published live.
de: In der Entwurfsarbeitsumgebung werden alle Veränderungen als neue Versionen des Live-Inhalts angelegt. Für Änderungen gibt es eine Vorschau, sie können begutachtet und gegebenenfalls veröffentlicht werden.

# workspace_description_no_access
source: You have no access to any workspace which might be an error. Please contact you administrator!
de: Sie haben auf keine Arbeitsumgebung Zugriff, was ein möglicherweise ein Irrtum ist. Bitte setzen Sie sich mit dem Administrator in Verbindung.

# edit_workspace_no_permission
source: You have no permission to edit this workspace. Only admin users or owners of the workspace can modify its parameters.
de: Sie haben keine Berechtigung, diese Arbeitsumgebung zu bearbeiten. Nur Administratoren und Eigentümer einer Arbeitsumgebung können ihre Einstellungen ändern.

# create_workspace_no_permission
source: You have no permission to create workspaces. Only admin users can create workspaces.
de: Sie haben keine Berechtigung, Arbeitsumgebungen anzulegen. Dies können nur Administratoren.

# submit_publish_workspace
source: Publish workspace
de: Arbeitsumgebung veröffentlichen

# submit_publish_workspace_confirmation_1
source: Are you sure you want to publish all content in "Publish" stage from the workspace?
de: Alle Inhalte der "Veröffentlichen"-Stufe aus der Arbeitsumgebung tatsächlich veröffentlichen?

# submit_publish_workspace_confirmation_2
source: Are you sure you want to publish all content from the workspace?
de: Den gesamten Inhalt der Arbeitsumgebung tatsächlich veröffentlichen?

# submit_swap_workspace
source: Swap workspace
de: Arbeitsumgebung austauschen

# submit_swap_workspace_confirmation_1
source: Are you sure you want to publish (swap) all content in "Publish" stage from the workspace?
de: Alle Inhalte der "Veröffentlichen"-Stufe aus der Arbeitsumgebung tatsächlich veröffentlichen (austauschen)?

# submit_swap_workspace_confirmation_2
source: Are you sure you want to publish (swap) all content from the workspace?
de: Alle Inhalte der Arbeitsumgebung tatsächlich veröffentlichen (austauschen)?

# submit_apply_action_on_selected_elements
source: Sure you want to perform this action with selected elements?
de: Diese Aktion mit den ausgewählten Elementen tatsächlich durchführen?

# no_publish_permission
source: You are not permitted to publish from this workspace
de: Sie haben keine Berechtigung, aus dieser Arbeitsumgebung zu veröffentlichen.

# label_workspace
source: Workspace:
de: Arbeitsumgebung:

# label_description
source: Description:
de: Beschreibung:

# label_options
source: Options:
de: Optionen:

# label_pagetree
source: Pagetree:
de: Seitenbaum:

# label_draft_versions
source: Workspace Versions:
de: Entwurfsversionen:

# label_stage
source: Stage:
de: Stufe:

# label_publish
source: Publish:
de: Veröffentlichen:

# label_lifecycle
source: Lifecycle:
de: Lebenszyklus:

# label_access_level
source: Access level:
de: Zugangsstufe:

# img_title_publish
source: Publish
de: Veröffentlichen

# img_title_swap
source: Swap
de: Austauschen

# remove_from_ws_confirmation
source: Remove from workspace?
de: Aus der Arbeitsumgebung tatsächlich entfernen?

# img_title_remove_from_ws
source: Remove from workspace?
de: Aus der Arbeitsumgebung entfernen?

# img_title_edit_page
source: Edit page
de: Seite bearbeiten

# img_title_edit_element
source: Edit element
de: Element bearbeiten

# img_title_show_log
source: Show Log
de: Protokoll zeigen

# diffview_label_field_name
source: Fieldname:
de: Feldname:

# diffview_label_colored_diff_view
source: Colored diff-view:
de: Eingefärbte Untersch.-Ansicht:

# diffview_complete_match
source: Complete match on editable fields.
de: Komplette Übereinstimmung der bearbeitbaren Felder

# diffview_cannot_find_records
source: ERROR: Records could strangely not be found!
de: FEHLER: Seltsamerweise konnten keine Datensätze gefunden werden!

# img_title_show_more
source: Show more
de: Mehr anzeigen

# img_title_current_workspace
source: This is a current workspace!
de: Das ist eine aktuelle Arbeitsumgebung!

# img_title_create_new_workspace
source: Create new workspace
de: Neue Arbeitsumgebung anlegen

# link_text_create_new_workspace
source: Create new workspace
de: Neue Arbeitsumgebung anlegen

# edit_workspace_go_back
source: Go back
de: Zurück

# edit_workspace_title_edit
source: Edit workspace
de: Arbeitsumgebung bearbeiten

# edit_workspace_title_new
source: Create new workspace
de: Neue Arbeitsumgebung anlegen

# workspace_list_label_current_workspace
source: Current:
de: Aktuell:

# workspace_list_label_workspace_title
source: Title:
de: Titel:

# workspace_list_label_workspace_description
source: Description:
de: Beschreibung:

# workspace_list_label_owners
source: Owners:
de: Besitzer:

# workspace_list_label_members
source: Members:
de: Mitglieder:

# workspace_list_label_reviewers
source: Reviewers:
de: Gutachter:

# workspace_list_access_admins_only
source: Admins only
de: Nur Administratoren

# workspace_list_access_anyone
source: no restrictions
de: keine Einschränkungen

# workspace_list_label_file_mountpoints
source: File mountpoints:
de: Verzeichnisfreigaben:

# workspace_list_label_db_mountpoints
source: Database mountpoints:
de: Datenbankfreigaben:

# workspace_list_label_frozen
source: Frozen:
de: Eingefroren:

# workspace_list_label_publish_date
source: Publish date:
de: Veröffentlichungsdatum:

# workspace_list_label_unpublish_date
source: Unpublish date:
de: Zurückziehungsdatum:

# workspace_list_label_your_access
source: Your access:
de: Ihr Zugriff:

# workspace_list_label_workspace_users
source: Workspace users:
de: Arbeitsumgebungsbenutzer:

# workspace_list_label_frozen_yes
source: Yes
de: Ja

# workspace_list_label_frozen_no
source: No
de: Nein

# workspace_list_icon_title_edit_workspace
source: Edit workspace
de: Arbeitsumgebung bearbeiten

# workspace_list_icon_title_switch_workspace
source: Switch workspace
de: Arbeitsumgebung umschalten

# workspace_list_access_admin
source: Admin
de: Administrator

# workspace_list_access_owner
source: Owner
de: Besitzer

# workspace_list_access_member
source: Member
de: Mitglied

# workspace_list_access_reviewer
source: Reviewer
de: Gutachter

# workspace_list_publishing_count_draft
source: Draft
de: Entwurf

# workspace_list_publishing_count_archive
source: Archive
de: Archiv

# workspace_list_publishing_count
source: Published %d times
de: %d mal veröffentlicht

# stage_sent_to_review
source: "%s" sent element to "Review"
de: "%s" hat das Element zum "Begutachten" geschickt

# stage_approved_for_publish
source: "%s" approved for "Publish"
de: "%s" hat zum "Veröffentlichen" freigegeben

# stage_rejected
source: "%s" rejected element!
de: "%s" hat das Element abgelehnt!

# stage_reset_to_editing
source: "%s" reset to "Editing"
de: "%s" hat das Element auf "Bearbeiten" zurückgesetzt

# stage_undefined
source: [undefined]
de: [undefiniert]

# stage_label_user_comment
source: User Comment:
de: Benutzerkommentar:

# workspace_list_mount_point_inaccessible
source: This mount point is defined for workspace but not accessible to you. If you need access to this mount point, ask your system administrator to give you access to it.
de: Diese Freigabe ist für die Arbeitsumgebung definiert, Sie haben aber keinen Zugriff. Wenn Sie Zugriff auf diese Freigabe benötigen, wenden Sie sich an den Systemadministrator.

# workspace_list_file_mount_point_live
source: Mount points from user profile are used.
de: Freigaben des Benutzerprofils werden benutzt.

# workspace_list_file_mount_point_draft
source: File mount points are not available in draft workspace.
de: Verzeichnisfreigaben sind in der Entwurfsarbeitsumgebung nicht verwendbar.

# workspace_list_file_mount_point_custom
source: File mount points are not defined for this workspace. Therefore no file mount points available in the workspace.
de: Verzeichnisfreigaben sind für diese Arbeitsumgebung nicht definiert. Aus diesem Grund sind keine Freigaben in dieser Arbeitsumgebung verfügbar.

# workspace_list_db_mount_point_live
source: Mount points from user profile are used.
de: Freigaben des Benutzerprofils werden benutzt.

# workspace_list_db_mount_point_draft
source: Mount points from user profile are used.
de: Freigaben des Benutzerprofils werden benutzt.

# workspace_list_db_mount_point_custom
source: Mount points from user profile are used.
de: Freigaben des Benutzerprofils werden benutzt.

# publish_title
source: Publish workspace
de: Arbeitsumgebung veröffentlichen

# swap_title
source: Swap workspace
de: Arbeitsumgebung austauschen

# publish_status
source: Published records <strong>%d</strong> to <strong>%d</strong> of <strong>%d</strong>.
de: Datensätze <strong>%d</strong> bis <strong>%d</strong> von <strong>%d</strong> veröffentlicht.

# swap_status
source: Swapped records <strong>%d</strong> to <strong>%d</strong> of <strong>%d</strong>.
de: Datensätze <strong>%d</strong> bis <strong>%d</strong> von <strong>%d</strong> ausgetauscht.

# publish_prepare
source: TYPO3 is preparing to publish records.
de: TYPO3 bereitet die Veröffentlichung der Datensätze vor.

# swap_prepare
source: TYPO3 is preparing to swap records.
de: TYPO3 bereitet den Austausch der Datensätze vor.

source: Please, wait...
de: Bitte warten...

# return_to_index
source: Return to Workspace module
de: Zurück zum Modul Arbeitsumgebung

# do_not_interrupt_publishing_1
source: Do not interrupt publishing process or
de: Bitte die Veröffentlichung nicht unterbrechen, da

# do_not_interrupt_publishing_2
source: workspace may be left in half-published state!
de: die Arbeitsumgebung sonst evtl. nur teilweise veröffentlicht wird.

# workspace_published
source: Workspace has been published.
de: Die Arbeitsumgebung wurde veröffentlicht.

# workspace_swapped
source: Workspace has been swapped.
de: Die Arbeitsumgebung wurde ausgetauscht.

# label_reject
source: Reject
de: Ablehnen

# label_review
source: Review
de: Gutachten

# label_sendtoreview
source: Send to review
de: Zum Gutachten

# label_approveforpublishing
source: Approve for publishing
de: Zur Veröffentlichung freigeben

# stage_editing
source: Editing
de: Bearbeiten

# stage_review
source: Review
de: Begutachten

# stage_publish
source: Publish
de: Veröffentlichen

# label_subelements
source: Sub elements
de: Unterelemente

# label_subelementsdetails
source: Sub elements, click for details
de: Unterelemente, Klick für Details

# label_commentforreviewer
source: Comment for Reviewer:
de: Anmerkung für den Gutachter:

# label_commentforpublisher
source: Comment for Publisher:
de: Anmerkung für den Veröffentlicher:

# label_resetstage
source: Reset stage
de: Stufe zurücksetzen

# label_undefined
source: Undefined
de: Undefiniert

# explain_reject
source: Please explain why you reject:
de: Bitte Grund für die Ablehnung erläutern:

# label_page
source: Page
de: Seite

# label_branch
source: Branch
de: Zweig

# label_newrecord
source: New element
de: Neues Element

# label_deletedrecord
source: Deleted element
de: Gelöschtes Element

# label_otherversions
source: Other version(s) in workspace(s):
de: Andere Version(en) in der Arbeitsumgebung

# label_multipleversions
source: Multiple versions in same workspace!
de: Mehrere Versionen in der selben Arbeitsumgebung

# label_nestedversions
source: Version inside version!
de: Version innerhalb einer Version!

# label_rejected
source: Rejected
de: Abgelehnt

# label_showsubelements
source: Show sub elements
de: Unterelemente anzeigen

# label_onlymychanges
source: Show only my changes
de: Nur meine Änderungen anzeigen

# label_offlineWSes
source: Draft workspaces
de: Entwurfsarbeitsumgebung

# label_allWSes
source: All workspaces
de: Alle Arbeitsumgebungen

# label_notapplicable
source: n/a
de: k.A.

# label_percentchange
source: %%% change:
de: %%% Änderung:

# label_percentChange
source: %d%% change:
de: %d%% Änderung:

# label_doaction_default
source: Do:
de: Ausführen:

# label_doaction_publish
source: Publish
de: Veröffentlichen

# label_doaction_swap
source: Swap
de: Austauschen

# label_doaction_release
source: Remove this version
de: Diese Version entfernen

# label_doaction_stage_reject
source: Reject changes
de: Änderungen ablehnen

# label_doaction_stage_editing
source: Send to stage: Editing
de: Auf Stufe setzen: Bearbeiten

# label_doaction_stage_review
source: Send to stage: Review
de: Auf Stufe setzen: Begutachten

# label_doaction_stage_publish
source: Send to stage: Publish
de: Auf Stufe setzen: Veröffentlichen

# label_doaction_flush
source: Flush ALL changes/versions
de: ALLE Änderungen/Versionen löschen

# label_moveto_placeholder
source: Move-to placeholder (destination)
de: Platzhalter für Verschieben (Ziel)

# label_moveto_pointer
source: Move-to pointer (source)
de: Zeiger für Verschieben (Quelle)
