Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_mod_help_about.xlf
Languages: de

# title
source: About TYPO3
de: Über TYPO3

# information
source: TYPO3 Information
de: Informationen zu TYPO3

# welcome
source: TYPO3 Professional Web Content Management System
de: TYPO3 Content-Management-System

# minor
source: TYPO3 is a flexible and professional Open Source Web-CMS based on PHP and MySQL.<br /><br />TYPO3 is <b>freely available</b> under the <a href="http://typo3.org/license" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />%s %s<br />
de: TYPO3 ist ein flexibles und professionelles Open-Source-Web-CMS basierend auf PHP und MySQL.<br /><br />TYPO3 ist <b>frei verfügbar</b> unter der <a href="http://typo3.com/1316.0.html" target="_blank">TYPO3-Lizenz (GNU/GPL)</a>.<br /><br />%s %s<br />

source: Community Credits
de: Die TYPO3-Community

# information_detail
source: Visit <a href="http://typo3.org/community/" target="_blank">typo3.org/community/</a> if you want to know why TYPO3 rocks.
de: Besuchen Sie <a href="http://typo3.org/community/" target="_blank">typo3.org/community/</a>, um zu erfahren, warum TYPO3 rockt!

# coredevs
source: Core Team
de: Kern-Team

# coredevs_detail
source: Visit <a href="http://typo3.org/teams/core/members/" target="_blank">typo3.org/teams/core/members/</a> for the complete member list.<br /><br />The Git Repository and the ChangeLog can be found <a href="http://forge.typo3.org/projects/show/typo3v4-core/" target="_blank">here</a>.
de: Die vollständige Liste der Mitglieder erhalten Sie unter <a href="http://typo3.org/teams/core/members/" target="_blank">typo3.org/teams/core/members/</a>.<br /><br />Das Git-Depot und das Änderungsprotokoll finden Sie <a href="http://forge.typo3.org/projects/show/typo3v4-core/" target="_blank">hier</a>.

source: Extension Authors
de: Entwickler der installierten Erweiterungen

# extension_list_info
source: This is a list of the people who contributed to the extensions you're using in your installation.
de: Dies ist eine Liste der Menschen, die zu den Erweiterungen, die Sie in Ihrer Installation benutzen, beigetragen haben.

source: Extension
de: Erweiterung

# extension_author
source: Author
de: Entwickler

# mlang_labels_tablabel
source: About TYPO3
de: Informationen über TYPO3

# mlang_labels_tabdescr
source: Displays the basic facts about the TYPO3 application, version and licensing terms.
de: Zeigt die grundlegenden Informationen zu TYPO3, Versionsinformationen und Lizenzbedingungen an.

# mlang_tabs_tab
source: About TYPO3
de: Über TYPO3

# donation_header
source: TYPO3 Donation
de: TYPO3 Geldspenden

# donation_message
source: It would be great if you could donate. TYPO3 is Open Source and relies heavily on donations from its users and supporters.<br/> <b>Thank you</b> for making this great Content Management System even better with your help!
de: Es wäre großartig, wenn Sie Geld spenden würden. TYPO3 ist Open-Source-Software und auf Geldspenden von Benutzern und Unterstützern angewiesen.<br/> <b>Danke</b>, dass Sie dieses großartige Content-Management-System mit Ihrer Hilfe noch besser machen!

# donation_button
source: Donate now
de: Jetzt spenden

source: External Libraries
de: Externe Bibliotheken

# external_thanks
source: TYPO3 core uses and thanks these external Open Source projects:
de: Der TYPO3-Kern benutzt und bedankt sich zugleich bei folgenden Open Source Projekten:
