Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_*_users.xlf
Languages: de

# allowed_languages.details
source: You can also limit users to specific languages with user group settings. Please see the same field for backend user groups for more details.
de: Diese Einstellung kann auch für Benutzergruppen vorgenommen werden. Details dazu entnehmen Sie bitte der Beschreibung des gleichnamigen Feldes im Bereich "Benutzergruppen".
