Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: de

# mlang_labels_tablabel
source: TYPO3 Extension Manager
de: TYPO3-Erweiterungsmanager

# mlang_labels_tabdescr
source: Manages TYPO3 extensions from a central repository, which includes plugins, modules, class extensions, configuration code etc.<br /><em>Access for 'admin' users only!</em>
de: Verwaltet TYPO3-Erweiterungen (Extensions) über einen zentralen Speicher (TER), der Plug-Ins, Module, Klassenerweiterungen, Konfigurationen und Übersetzungen enthält.

# mlang_tabs_tab
source: Ext Manager
de: Erweiterungen

# category_BE_modules
source: Backend Modules
de: Backend-Module

# category_miscellanous
source: Miscellaneous
de: Verschiedenes

# category_services
source: Services
de: Dienste

# category_examples
source: Examples
de: Beispiele

# category_documentation
source: Documentation
de: Dokumentation

# state_stable
source: Stable
de: Stabil

# state_experimental
source: Experimental
de: Experimentell

# state_obsolete
source: Obsolete
de: Überholt

# state_exclude_from_updates
source: Exclude From Updates
de: Von Aktualisierungen ausschließen

# type_local
source: Local
de: Lokal

# descr_system
source: System extension (typo3/sysext/) - Always distributed with the TYPO3 source code (static).
de: Systemerweiterung (typo3/sysext/) - Stets Teil des Lieferumfangs des TYPO3-Quelltexts (statisch).

# descr_global
source: Global extension (typo3/ext/) - Available for shared source on server (dynamic).
de: Globale Erweiterung (typo3/ext/) - Verfügbar für gemeinsame Ressourcen auf dem Server (dynamisch).

# descr_local
source: Local extension (typo3conf/ext/) - Local for this TYPO3 installation only (dynamic).
de: Lokale Erweiterung (typo3conf/ext/) - Lokal für nur diese TYPO3-Installation (dynamisch).

# privacy_notice
source: When you interact with the online repository, server information may be sent and stored in the repository for statistics.
de: Beim Kontakt mit der Online-Bibliothek können Server-Informationen gesendet und in der Bibliothek für statistische Zwecke gespeichert werden.

# security_header
source: Did you find a security problem?
de: Haben Sie ein Sicherheitsproblem gefunden?

# security_warning_extensions
source: Please be aware that extensions are third-party software. Installing an extension is a security risk, as the high level of quality and security in the TYPO3 Core can not be assured in these extensions.
de: Bitte seien Sie sich der Tatsache bewusst, dass Erweiterungen von Drittanbietern stammen. Eine Erweiterung zu installieren ist ein Sicherheitsrisiko, denn das hohe Maß an Qualität und Sicherheit im TYPO3-Kern kann für Erweiterungen nicht garantiert werden.

# security_descr
source: If you think you have found a security issue in TYPO3 or an extension, please contact the %sTYPO3 security team%s! Thank you!
de: Wenn Sie der Meinung sind, ein Sicherheitsproblem in TYPO3 oder einer Erweiterung entdeckt zu haben, wenden Sie sich bitte an das %sTYPO3-Sicherheitsteam%s! Vielen Dank!

# menu_loaded_extensions
source: Loaded extensions
de: Geladene Erweiterungen

# menu_install_extensions
source: Install extensions
de: Erweiterungen installieren

# menu_import_extensions
source: Import extensions
de: Erweiterungen importieren

# menu_translation_handling
source: Translation handling
de: Übersetzungen

# menu_settings
source: Settings
de: Einstellungen

# menu_extension_updates
source: Check for extension updates
de: Erweiterungen aktualisieren

# list_order_category
source: Category
de: Kategorie

# list_order_author
source: Author
de: Autor

# list_order_state
source: State
de: Status

# list_order_type
source: Type
de: Typ

# show_description
source: Description
de: Beschreibung

# show_more_details
source: More details
de: Weitere Details

# show_technical
source: Technical (takes time!)
de: Technisch (zeitintensiv!)

# show_validating
source: Validating (takes time!)
de: Validierung (zeitintensiv!)

# show_changed
source: Changed? (takes time!)
de: Geändert? (zeitintensiv!)

# details_edit
source: Edit files
de: Dateien bearbeiten

# details_backup_delete
source: Backup/Delete
de: Sichern/Löschen

# details_dump_db
source: Dump DB
de: DB-Dump erstellen

# details_upload
source: Upload to TER
de: Ins TER hochladen

# details_update
source: UPDATE!
de: AKTUALISIEREN!

# header
source: Extension Manager
de: Erweiterungs-Manager

source: Group by:
de: Anordnen nach:

source: Show:
de: Anzeigen:

# display_shy
source: Display shy extensions:
de: Verborgene Erweiterungen anzeigen:

# only_my_ext
source: Only my extensions:
de: Nur meine Erweiterungen:

source: Show obsolete:
de: Überholte anzeigen:

source: Go back
de: Zurück

source: Look up:
de: Suchen:

# loaded_exts
source: Loaded Extensions
de: Geladene Erweiterungen

# how_to_install
source: If you want to use an extension in TYPO3, you should simply click the "plus" button %s .
de: Soll eine Erweiterung in TYPO3 genutzt werden, die Plus-Schaltfläche betätigen %s.

# how_to_uninstall
source: Installed extensions can also be removed again - just click the remove button %s .
de: Installierte Erweiterungen können wieder entfernt werden. Dazu die Schaltfläche entfernen betätigen %s.

# available_extensions
source: Available Extensions - Grouped by: %s
de: Verfügbare Erweiterungen, angeordnet nach: %s

# do_update
source: Update the extension in '%s' from online repository to server
de: Die Extension in '%s' aus der Online-Bibliothek aktualisieren

source: local
de: lokal

# excluded_from_updates
source: The extension is excluded from updates! You can change this in the appropriate ext_emconf.php file.
de: Die Erweiterung ist von Aktualisierungen ausgeschlossen! Dies kann in der entsprechenden Datei ext_emconf.php geändert werden.

# import_to_local_dir
source: Import this extension from online repository to the 'local' directory typo3conf/ext/.
de: Diese Erweiterung aus der Online-Bibliothek in das 'lokale' Verzeichnis typo3conf/ext/ importieren.

# list_or_look_up
source: List or look up %s extensions
de: %s Erweiterungen aufführen oder suchen

# list_or_look_up_extensions
source: Look up extensions:
de: Erweiterungen suchen:

# list_or_look_up_all
source: all
de: Alle

# list_or_look_up_reviewed
source: reviewed
de: Geprüfte

# look_up_button
source: Look up
de: Suchen

# privacy_notice_header
source: PRIVACY NOTICE:
de: Hinweis zur Privatsphäre:

# extensions_repository_group_by
source: Extensions in TYPO3 Extension Repository (online) - Grouped by:
de: Erweiterungen in der TYPO3-Erweiterungsbibliothek (online), angeordnet nach:

# extension_required_short
source: Rq
de: Bn

# list_of_local_extensions
source: This is the list of extensions which are available locally, but not in the repository.
de: Dies ist eine Aufstellung von Erweiterungen, die lokal, aber nicht in der Bibliothek verfügbar sind.

# might_be_user_defined
source: They might be user-defined and should be prepended user_ then.
de: Es könnte sich um benutzerdefinierte handeln, die dann den Präfix user_ erhalten sollten.

# only_on_this_server
source: Extensions found only on this server
de: Nur auf diesem Server gefundene Erweiterungen

# no_matching_extensions
source: No matching extensions found.
de: Keine passenden Erweiterungen gefunden.

# connect_to_ter
source: Connect to the current mirror and retrieve the current list of available plugins from the TYPO3 Extension Repository.
de: Mit dem aktuellen alternativen Server verbinden und die aktuelle Liste verfügbarer Erweiterungen aus der TYPO3-Erweiterungsbibliothek holen.

source: Retrieve/Update
de: Holen/Aktualisieren

# ext_list_last_updated
source: (last update: %s)
de: (Letzte Aktualisierung: %s)

# in_repository
source: Extensions in TYPO3 Extension Repository
de: Erweiterungen in der TYPO3-Erweiterungsbibliothek

# upload_t3x
source: Upload extension file (.t3x):
de: Erweiterungsdatei hochladen (.t3x):

# upload_to_location
source: ...to location:
de: ...an folgenden Ort:

# local_folder
source: Local (../typo3conf/ext/)
de: Lokal (../typo3conf/ext/)

# overwrite_ext
source: Overwrite any existing extension!
de: Bereits vorhandene Erweiterungen überschreiben!

# upload_ext_file
source: Upload extension file
de: Erweiterungsdatei hochladen

# upload_ext_directly
source: Upload extension file directly (.t3x):
de: Erweiterungsdatei direkt hochladen (.t3x):

# previous_page
source: Prev page
de: Letzte Seite

source: Next page
de: Nächste Seite

# showing_extensions_from_to
source: Showing extensions %s to %s
de: Zeige Erweiterungen %s bis %s

source: Security Settings
de: Sicherheitseinstellungen

# show_exts_without_security_check
source: Enable extensions without review (basic security check):
de: Erweiterungen ohne Prüfung (grundlegenden Sicherheitstest) zulassen:

source: Notice:
de: Hinweis:

# security_notice
source: Make sure you know what consequences enabling this checkbox might have. Check the %sinformation on typo3.org about security reviews%s!
de: Seien Sie sich darüber im Klaren, welche Konsequenzen die Aktivierung dieser Option haben kann. Siehe die %sInformationen bei typo3.org bezüglich Sicherheitstests%s!

source: User Settings
de: Benutzereinstellungen

source: Enter repository username:
de: Benutzernamen für Bibliothek eingeben:

source: Enter repository password:
de: Passwort für Bibliothek eingeben:

# repository_password_info
source: This is <em>not</em> your password to the TYPO3 backend! This user information is what is needed to log in at typo3.org with your account there!
de: Hierbei handelt es sich <em>nicht</em> um das Passwort für den Zugriff auf das TYPO3-Backend! Diese Informationen stimmen mit denen überein, mit denen Sie sich bei typo3.org anmelden können!

source: Mirror selection
de: Auswahl alternativer Server

# mirror_list_url
source: Enter mirror list URL:
de: URL für Liste alternativer Server eingeben:

# mirror_select
source: Select a mirror from below. This list is built from the online mirror list retrieved from the URL above.
de: Wählen Sie einen der nachstehenden alternativen Server. Diese Liste wird aus der online befindlichen Liste alternativer Server zusammengestellt, die von obiger URL bezogen wurde.

source: Mirror list
de: Liste alternativer Server

# mirror_list_reload
source: Click here to reload the list.
de: Zum erneuten Laden der Liste hier klicken.

# mirror_use
source: Use
de: Verwenden

# mirror_country
source: Country
de: Land

# mirror_sponsored_by
source: Sponsored by
de: Gesponsort von

# mirror_use_random
source: Random (recommended!)
de: Zufällig (empfohlen!)

source: Enter repository URL:
de: Bibliotheks-URL eingeben:

# repository_url_hint
source: If you set a repository URL, this overrides the use of a mirror. Use this to select a specific (private) repository.
de: Wird eine Bibliotheks-URL festgelegt, so übersteuert diese die Verwendung alternativer Server. Setzen Sie diese Methode ein, um auf besondere (private) Bibliotheken zuzugreifen.

source: Repository settings
de: Bibliothekseinstellungen

source: Translation Settings
de: Übersetzungseinstellungen

source: Languages to fetch:
de: Zu beziehende Sprachen:

# translation_info
source: For the selected languages the EM tries to download and install translation files if available, whenever an extension is installed. (This replaces the <code>csh_*</code> extensions that were used to install core translations before TYPO3 version 4!)
de: Für die ausgewählten Sprachen wird bei Installation einer Erweiterung versucht, Übersetzungsdateien herunterzuladen und zu installieren. (Dies ersetzt die <code>csh_*</code>-Erweiterungen, die zur Installation von Übersetzungen für den Kern vor TYPO3 Version 4 verwendet wurden!)

# translation_loaded_exts
source: To request an update or installation for already loaded extensions, see below.
de: Zum Einleiten einer Aktualisierung oder Installation für bereits installierte Erweiterungen siehe unten.

# translation_save_selection
source: Save selection
de: Auswahl speichern

# translation_check_status_button
source: Check status against repository
de: Status mit Bibliothek vergleichen

# translation_update_button
source: Update from repository
de: Aus Bibliothek aktualisieren

source: Translation status
de: Übersetzungsstatus

# translation_check_status
source: Checking translation status, please wait...
de: Prüfen des Übersetzungsstatus. Bitte warten...

# translation_table_check
source: This table shows the status of the translations of the loaded extensions.
de: Diese Tabelle zeigt den Status der Übersetzungen für geladene Erweiterungen.

# translation_extension_key
source: Extension key
de: Erweiterungsschlüssel

# translation_checking_extension
source: Checking translation status for extension \"%s\"...
de: Prüfen des Übersetzungsstatus der Erweiterung \"%s\"...

# translation_no_translation
source: No translation available
de: Keine Übersetzung verfügbar

# translation_n_a
source: N/A
de: Nicht zutreffend

# translation_not_installed
source: Not installed/Unknown
de: Nicht installiert/Unbekannt

# translation_needs_update
source: Needs update
de: Aktualisierung erforderlich

# translation_status_update
source: UPD
de: AKT

# translation_is_ok
source: Is up to date
de: Ist aktuell

# translation_check_done
source: Check done.
de: Überprüfung beendet.

# translation_update_status
source: Updating translations, please wait...
de: Aktualisieren der Übersetzungen. Bitte warten...

# translation_table_update
source: This table shows the update results of the translations of the loaded extensions.
de: Diese Tabelle zeigt das Ergebnis der Aktualisierung der Übersetzungen der geladenen Erweiterungen.

# translation_full_check_update
source: If you want to force a full check or update, delete the l10n zip-files from the typo3temp folder.
de: Um eine vollständige Prüfung oder eine Aktualisierung zu erzwingen, löschen Sie die l10n-ZIP-Dateien im Verzeichnis typo3temp/.

# translation_updating_extension
source: Updating translation for extension \"%s\"...
de: Aktualisieren der Übersetzung der Erweiterung \"%s\"...

# translation_has_been_updated
source: Has been updated
de: Wurde aktualisiert

# translation_problems
source: Possible reasons: Network problems, allow_url_fopen is off, cURL is not enabled in the Install Tool
de: Mögliche Gründe: Netzwerkprobleme, allow_url_fopen deaktiviert, cURL nicht im Installationsprogramm verfügbar

# translation_status_could_not_fetch
source: Could not fetch translation status
de: Übersetzungsstatus konnte nicht geprüft werden

# translation_update_done
source: Update done.
de: Aktualisierung beendet.

# translation_unpacking_failed
source: Unpacking the language pack failed!
de: Entpacken des Sprachpakets fehlgeschlagen!

# ext_load_details_button
source: Load details
de: Details laden

# ext_or
source: or
de: oder

# ext_import_update_button
source: Import/Update
de: Importieren/Aktualisieren

# ext_import_update_to
source: to:
de: nach:

# ext_import_local
source: Local:
de: Lokal:

# ext_import_overwrite
source: (OVERWRITE)
de: (ÜBERSCHREIBEN)

# ext_import_folder_empty
source: (empty)
de: (leer)

# ext_import_excluded_from_updates
source: This extension is excluded from updates! You can change this in the ext_emconf.php file in the extension folder.
de: Diese Erweiterung wurde von Aktualisierungen ausgeschlossen! Dies kann über die Datei ext_emconf.php im Verzeichnis der Erweiterung angepasst werden.

# ext_import_select_command
source: Select command
de: Befehl auswählen

# ext_import_remote_ext_details
source: Remote Extension Details
de: Details für ferne Erweiterung

# ext_import_list_not_updated
source: Error: The list could not be fetched from %s.
de: Fehler: Die Liste konnte nicht von %s bezogen werden.

# ext_import_list_updated
source: The mirror list has been updated and now contains %s entries.
de: Die Liste alternativer Server wurde aktualisiert und enthält nun %s Einträge.

# ext_import_list_empty
source: The mirror list was not updated as it contained no entries.
de: Die Liste alternativer Server war leer und wurde daher nicht aktualisiert.

# ext_import_md5_not_updated
source: Error: The extension MD5 sum could not be fetched from %s.
de: Fehler: Die MD5-Summe der Erweiterung konnte nicht von %s bezogen werden.

# ext_import_extlist_updated_header
source: Extension list updated
de: Erweiterungsliste aktualisiert

# ext_import_extlist_updated
source: The extensions list has been updated and now contains %s extension entries.
de: Die Erweiterungsliste wurde aktualisiert und enthält nun %s Einträge.

# ext_import_list_unchanged_header
source: No updates available
de: Keine Aktualisierungen verfügbar

# ext_import_list_unchanged
source: The extension list has not changed remotely, it has thus not been fetched.
de: Die ferne Liste der Erweiterungen hat sich nicht geändert und wurde daher nicht geladen.

# ext_import_ext_already_installed_loaded
source: Extension already installed and loaded.
de: Erweiterung bereits installiert und geladen.

# ext_import_p_localconf
source: localconf.php is not writable!
de: Kein Schreibzugriff auf localconf.php!

# ext_import_ext_loaded
source: Extension was already installed, it has been loaded.
de: Erweiterung war bereits installiert. Sie wurde nun geladen.

# ext_import_ext_n_a
source: Extension not available in matching version.
de: Erweiterung nicht in passender Version verfügbar.

# ext_import_ext_imported
source: Extension has been imported from repository and loaded.
de: Erweiterung aus der Bibliothek importiert und geladen.

# ext_import_ext_not_loaded
source: Extension is in repository, but could not be loaded.
de: Erweiterung befindet sich in der Bibliothek, konnte aber nicht geladen werden.

# ext_import_ext_n_a_rep
source: Extension not available in repository.
de: Erweiterung nicht in Bibliothek verfügbar.

# ext_import_file_not_uploaded
source: File was not uploaded?!
de: Datei nicht hochgeladen?!

# ext_import_file_empty
source: File is empty!
de: Datei leer!

# ext_import_ext_present_no_overwrite
source: A version of the extension was already present in '%s' and the overwrite flag was not set.
de: Eine Version der Erweiterung war bereits in "%s" vorhanden, und die Überschreibenoption war nicht gesetzt.

# ext_import_ext_present_nothing_done
source: So nothing was done...
de: Keine Änderungen vorgenommen...

# ext_import_no_key
source: No extension key in file. Strange...
de: Kein Erweiterungsschlüssel in Datei. Seltsam...

# ext_import_wrong_file_format
source: Wrong file format. No data recognized, %s.
de: Falsches Dateiformat. Keine Daten erkannt, %s.

# ext_import_no_file
source: No file uploaded! Probably the file was too large for PHPs internal limit for uploadable files.
de: Keine Datei hochgeladen! Wahrscheinlich überschritt die Dateigröße die interne Obergrenze von PHP für hochzuladende Dateien.

# ext_import_file_not_created
source: Error: File '%s' could not be created!!!
de: Fehler: Datei "%s" konnte nicht erstellt werden!!!

# ext_import_file_corrupted
source: Error: File '%s' MD5 was different from the md5 of the original file - so the file is corrupted!
de: Fehler: Die MD5-Summe der Datei "%s" wich von der der Originaldatei ab. Die Datei ist defekt!

# ext_import_success
source: Extension imported
de: Erweiterung importiert

# ext_import_success_folder
source: Folder created: %s
de: Verzeichnis erstellt: %s

# ext_import_no_conf_file
source: Error: Could not find '%s'.
de: Fehler: "%s" konnte nicht gefunden werden.

# ext_import_ext_type
source: Installation Type:
de: Installationstyp:

# ext_import_cache_files_removed
source: Cache-files are removed and will be re-written upon next hit.
de: Cache-Dateien wurden entfernt und werden beim nächsten Zugriff neu erstellt.

# ext_import_install_uninstall
source: Install/Uninstall Extension:
de: Erweiterung installieren/deinstallieren

# ext_import_uninstall
source: Uninstall extension
de: Erweiterung deinstallieren

# ext_import_install
source: Install extension
de: Erweiterung installieren

# ext_import_imported
source: The extension has been imported.
de: Die Erweiterung wurde importiert.

# ext_import_close_check
source: Close window and recheck dependencies.
de: Das Fenster schließen und Abhängigkeiten erneut prüfen.

# ext_import_ext_path_different
source: Error: The extension path '%s' was different than expected...
de: Fehler: Der Erweiterungspfad "%s" weicht vom erwarteten Wert ab...

# ext_import_ext_only_here
source: Error: The extension can only be installed in the path %s (lockType=%s).
de: Fehler: Die Erweiterung kann nur im Pfad %s installiert werden (lockType=%s).

# ext_import_no_ext_key_files
source: Error: No extension key!!! Why? - nobody knows... (Or there are no files in the file array...)
de: Fehler: Kein Erweiterungsschlüssel!!! Grund unbekannt... (Eventuell keine Dateien im Datei-Array...)

# ext_import_data_transfer
source: Error: The data transfer did not succeed. %s
de: Fehler: Datenübertragung fehlgeschlagen. %s

# ext_import_no_install_here
source: Error: Installation is not allowed in this path (%s).
de: Fehler: Installation in diesem Pfad nicht erlaubt (%s).

# ext_import_results
source: Extension import results
de: Ergebnis des Erweiterungsimports

# ext_details_ext
source: Extension:
de: Erweiterung:

# ext_details_new_tables_fields
source: Before the extension can be installed the database needs to be updated with new tables or fields.
de: Bevor die Erweiterung installiert werden kann, muss die Datenbank mit neuen Tabellen oder Feldern aktualisiert werden.

# ext_details_new_tables_fields_select
source: Please select which operations to perform:
de: Die durchzuführenden Vorgänge auswählen:

# ext_details_installing
source: Installing %s:
de: Installieren von %s:

# ext_details_db_needs_update
source: Database needs to be updated
de: Datenbank muss aktualisiert werden

# ext_details_remove_ext
source: Remove extension
de: Erweiterung deinstallieren

# ext_details_removing
source: Removing %s:
de: Deinstallieren von %s:

# ext_details_ext_installed_removed
source: The extension has been %s.
de: Die Erweiterung wurde %s.

# ext_details_ext_installed_with_key
source: The extension "%s" has been installed.
de: Die Erweiterung "%s" wurde installiert.

# ext_details_ext_removed_with_key
source: The extension "%s" has been removed.
de: Die Erweiterung "%s" wurde deinstalliert.

# ext_details_installed
source: installed
de: installiert

# ext_details_removed
source: removed
de: deinstalliert

# ext_details_write_access_error
source: Write access error
de: Fehler bei Schreibzugriff

# ext_details_write_error_localconf
source: typo3conf/LocalConfiguration.php seems not to be writable, so the extension cannot be installed automatically!
de: In typo3conf/localconf.php kann nicht geschrieben werden, daher ist eine automatische Installation der Erweiterung nicht möglich!

# ext_details_error_downloading
source: Error while trying to download the extension file...
de: Fehler beim Herunterladen der Erweiterungsdatei...

# ext_details_md5_previous
source: MD5: %s (Previous File)
de: MD5: %s (Vorherige Datei)

# ext_details_no_changes
source: No changes to the file detected!
de: Keine Änderungen an der Datei gefunden!

# ext_details_file
source: File: %s
de: Datei: %s

# ext_details_md5_current
source: MD5: %s (Current File)
de: MD5: %s (Aktuelle Datei)

# ext_details_md5_submitted
source: MD5: %s (Submitted File)
de: MD5: %s (Gesendete Datei)

# ext_details_saving_failed_changes_lost
source: Saving failed, the content was not correctly written to disk. Changes have been lost!
de: Speichern fehlgeschlagen! Der Inhalt wurde nicht ordnungsgemäß auf die Festplatte geschrieben. Die Änderungen sind verloren!

# ext_details_file_saved
source: File saved.
de: Datei gespeichert.

# ext_details_file_save_button
source: Save file
de: Datei speichern
