Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: de

# updateLocalEM_CONF_ok
source: The file "%s" was updated with a cleaned up EM_CONF array.
de: Die Datei "%s" wurde mit einem gesäuberten EM_CONF-Array aktualisiert.

# updateLocalEM_CONF_not_writable
source: Error: "%s" was not writable!
de: Fehler: Schreiben in "%s" nicht möglich!

# updateLocalEM_CONF_not_found
source: Error: No file "%s" found. DON'T PANIC!
de: Fehler: Datei "%s" nicht gefunden. KEINE PANIK!

# updateLocalEM_CONF_no_content
source: No content to write to "%s"!
de: Kein Inhalt zum Schreiben in "%s"!

# makeUploadArray_error_size
source: Error: The total size of the uncompressed upload (%s) exceeds %s!
de: Fehler: Gesamtgröße des nicht komprimierten Hochladens (%s) überschreitet %s!

# makeUploadArray_error_path
source: Error: Extension path for extension "%s" not found!
de: Fehler: Erweiterungspfad für Erweiterung "%s" nicht gefunden!

# checkDependencies_ignored
source: Dependency on %s ignored as requested.
de: Die Abhängigkeit von %s wurde wie gewünscht ignoriert.

# checkDependencies_php_too_low
source: The running PHP version (%s) is lower than required (%s).
de: Die aktuelle PHP-Version (%s) ist niedriger als erforderlich.

# checkDependencies_ignore_requirement
source: Ignore this version requirement
de: Versionserfordernis ignorieren

# checkDependencies_php_too_high
source: The running PHP version (%s) is higher than allowed (%s).
de: Die aktuelle PHP-Version (%s) ist höher als erlaubt (%s).

# checkDependencies_typo3_too_low
source: The running TYPO3 version (%s) is lower than required (%s).
de: Die aktuelle TYPO3-Version (%s) ist niedriger als erforderlich (%s).

# checkDependencies_typo3_too_high
source: The running TYPO3 version (%s) is higher than allowed (%s).
de: Die aktuelle TYPO3-Version (%s) ist höher als erlaubt (%s).

# checkDependencies_ext_not_available
source: The extension "%s" was not available in the system. Please import it from the TYPO3 Extension Repository.
de: Die Erweiterung "%s" ist nicht auf dem System verfügbar. Bitte aus der TYPO3-Erweiterungsbibliothek importieren.

# checkDependencies_import_ext
source: Import this extension to the 'local' directory typo3conf/ext/ from online repository.
de: Diese Erweiterung aus der Online-Bibliothek in das "lokale" Verzeichnis typo3conf/ext/ importieren.

# checkDependencies_import_now
source: Import now (opens a new window)
de: Jetzt importieren (öffnet ein neues Fenster)

# checkDependencies_ignore_ext_requirement
source: Ignore this extension requirement
de: Dieses Erweiterungserfordernis ignorieren

# checkDependencies_ext_not_installed
source: Extension "%s" (%s) was not installed. Please install it first.
de: Die Erweiterung "%s" (%s) wurde nicht installiert. Bitte installieren Sie sie zuerst.

# checkDependencies_install_now
source: Install now (opens a new window)
de: Jetzt installieren (öffnet ein neues Fenster)

# checkDependencies_ext_too_low
source: The running version of extension "%s" (%s) is lower than required (%s).
de: Die aktuelle Version der Erweiterung "%s" (%s) ist niedriger als erforderlich.

# checkDependencies_ext_too_high
source: The running version of extension "%s" (%s) is higher than allowed (%s).
de: Die aktuelle Version der Erweiterung "%s" (%s) ist höher als erlaubt.

# checkDependencies_conflict_ignored
source: Conflict with %s ignored as requested.
de: Der Konflikt mit %s wurde wie gewünscht ignoriert.

# checkDependencies_conflict_remove
source: The extensions "%s" and "%s" (%s) will conflict with each other. Please remove "%s", if you want to install "%s".
de: Es besteht ein Konflikt zwischen den Erweiterungen "%s" und "%s" (%s) . Bitte "%s" deinstallieren, wenn "%s" installiert werden soll.

# checkDependencies_remove_now
source: Remove now (opens a new window)
de: Jetzt deinstallieren (öffnet ein Fenster)

# checkDependencies_ignore_conflict
source: Ignore this conflict error
de: Diesen Konflikt ignorieren

# checkDependencies_conflict_error
source: Conflict Error
de: Konflikt

# checkDependencies_suggestion_ignored
source: Suggestion of %s ignored as requested.
de: Die Empfehlung %s wurde wie gewünscht ignoriert.

# checkDependencies_suggest_import
source: Extension "%s" was not available in the system. You may want to import it from the TYPO3 Extension Repository.
de: Erweiterung "%s" nicht auf dem System verfügbar. Sie kann aus der TYPO3-Erweiterungsbibliothek importiert werden.

# checkDependencies_ignore_suggestion
source: Ignore this suggestion
de: Empfehlung ignorieren

# checkDependencies_suggest_installation
source: Extension "%s" (%s) was not installed. You may want to install it.
de: Erweiterung "%s" (%s) nicht installiert. Es wird empfohlen, sie zu installieren.

# checkDependencies_exts_suggested_by_ext
source: Extensions suggested by extension "%s"
de: Von Erweiterung "%s" empfohlene Erweiterungen

# checkDependencies_try_again
source: Try again
de: Erneut versuchen

# removeExtFromList_dependency
source: The extension(s) '%s' depend(s) on the extension you are trying to remove. The operation was not completed.
de: Die Erweiterung(en) "%s" hängen von der zu deinstallierenden Erweiterung ab. Der Vorgang wurde abgebrochen.

# removeExtFromList_dependency_error
source: Dependency Error
de: Abhängigkeitsfehler

# checkUploadFolder_clear_cache
source: Clear cache
de: Cache leeren

# checkUploadFolder_clear_cache_requested
source: This extension requests the cache to be cleared when it is installed/removed.
de: Diese Erweiterung hat angefordert, bei ihrer Installation und Deinstallation den Cache zu leeren.

# checkUploadFolder_clear_all_cache
source: Clear all cache:
de: Gesamten Cache leeren:

# checkUploadFolder_create_upload_folder
source: Create upload folder
de: Hochladeverzeichnis erstellen

# checkUploadFolder_upload_folder_needed
source: The extension requires the upload folder '%s' to exist.
de: Die Erweiterung erfordert das Vorhandensein des Hochladeverzeichnisses '%s'.

# checkUploadFolder_create_dir
source: Create directory '%s':
de: Erstellen des Verzeichnisses '%s':

# checkUploadFolder_error
source: ERROR: The path '%s' could not be created.
de: FEHLER: Der Pfad '%s' konnte nicht erstellt werden.

# checkUploadFolder_create_folder
source: Create folder
de: Verzeichnis erstellen

# checkUploadFolder_folder_needed
source: The extension requires the folder '%s' to exist.
de: Die Erweiterung erfordert das Vorhandensein des Verzeichnisses '%s'.

# checkDBupdates_add_fields
source: Add fields
de: Felder hinzufügen

# checkDBupdates_changing_fields
source: Changing fields
de: Ändern der Felder

# checkDBupdates_add_tables
source: Add tables
de: Tabellen hinzufügen

# checkDBupdates_rows
source: Rows:
de: Zeilen:

# checkDBupdates_table_exists
source: Table exists!
de: Tabelle bereits vorhanden!

# checkDBupdates_import_static_data
source: Import static data
de: Statische Daten importieren

# tsStyleConfigForm_note
source: Note
de: Hinweis

# tsStyleConfigForm_additional_config
source: This extension provides additional configuration options which become available once it is installed.
de: Diese Erweiterung bietet weitere Konfigurationsoptionen, die nach der Installation verfügbar werden.

# dumpStaticTables_table_not_found
source: Fatal error: Table for dump not found in database...
de: Schwerer Fehler: Tabelle für Dump nicht in Datenbank gefunden...

# terCommunication_ext_version
source: The extension is now available in version %s.
de: Die Erweiterung ist nun in der Version %s verfügbar.

# display_nle
source: Include not loaded extensions into listing
de: Nicht-geladene Erweiterungen mit aufführen

# display_files
source: Display the list of changed files
de: Liste geänderter Dateien anzeigen

# header_upd_ext
source: There are new versions of the following extensions in the TER
de: Im TER befinden sich neue Versionen folgender Erweiterungen

# header_vers_ret
source: Version information
de: Versionsinformation

# tab_mod_name
source: Extension
de: Erweiterung

# tab_mod_key
source: Ext-Key
de: Schlüssel

# tab_mod_loc_ver
source: Local
de: Lokal

# tab_mod_rem_ver
source: Remote
de: Entfernt

# tab_mod_comment
source: Upload-Comment
de: Hochladeanmerkung

# tab_mod_location
source: Location
de: Ort

# msg_warn_diff
source: A difference between the originally installed version and the current was detected!
de: Eine Abweichung zwischen der ursprünglich installierten und der derzeitigen Version wurde festgestellt!

# msg_modified
source: Modified Files:
de: Modifizierte Dateien:

source: (write-protected)
de: (schreibgeschützt)

# note_last_update
source: Last update of the list of extensions:
de: Letzte Aktualisierung des Erweiterungsverzeichnisses:

# note_last_update_new
source: Last update of the list of extensions: %s.
de: Letzte Aktualisierung des Erweiterungsverzeichnisses: %s.

# note_last_update2
source: To get and update the list, go to the section "Import extensions" and use the button "Retrieve/Update".
de: Zum Herunterladen/Aktualisieren des Verzeichnisses die Option "Holen/Aktualisieren" unter "Erweiterungen importieren" verwenden.

# note_last_update2_new
source: To get and update the list, %sgo to the section "Import extensions" and use the button "Retrieve/Update"%s.
de: Zum Herunterladen/Aktualisieren des Verzeichnisses %sdie Option "Holen/Aktualisieren" unter "Erweiterungen importieren" verwenden%s.

# double_inclusion
source: %1$s takes precedence over %2$s
de: %1$s hat eine höhere Priorität als %2$s.

# globalext
source: Globally installed extension
de: Global installierte Erweiterung

# localext
source: Locally installed extension
de: Lokal installierte Erweiterung

# sysext
source: System extension
de: Systemerweiterung
