Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: de

# bookmarks.image_descr
source: To create a bookmark to a page, just click the star icon usually found in the top of pages. You will have to confirm the creation of the bookmark. It is nothing dangerous - only annoying to clean up if you happen to create bookmarks against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the bookmark icon in the toolbar reloading and, after opening the menu, the new entry appear. If you click this entry, you will now jump to the page you created the bookmark from! You can name bookmarks, you can even group them and share them. If you want to edit or delete a bookmark you select the "Edit" checkbox and then click the bookmark icon.
de: Um ein Lesezeichen zu einer Seite zu erstellen, klicken Sie auf das Sternchen-Symbol, das Sie normalerweise oben auf der Seite finden. Sie müssen das Anlegen des Lesezeichens bestätigen. Dies ist nichts Gefährliches - es schützt Sie aber davor, Lesezeichen aus Versehen und gegen Ihren Willen anzulegen. Klicken Sie auf "OK". Sie sollten dann direkt sehen, wie das Lesezeichen-Symbol in der oberen Menüleiste neulädt. Wenn Sie danach das Lesezeichen-Menü öffnen, ist der neue Eintrag vorhanden. Wenn Sie nun diesen Eintrag anklicken, springen Sie direkt zu der Seite, von der aus Sie das Lesezeichen angelegt haben! Sie können Lesezeichen umbenennen, Sie können sie gruppieren und sogar mit anderen Benutzern teilen. Wenn Sie ein Lesezeichen bearbeiten oder löschen möchten, klicken Sie auf "Bearbeiten" und dann auf das Lesezeichen-Menü.

# workspaceSelector.alttitle
source: Workspace Selector
de: Arbeitsumgebungsauswahl

# workspaceSelector.description
source: By this selectorbox you can switch between the workspaces available to you. When you switch workspace the whole backend will reload.
de: Mit Hilfe dieses Auswahlfeldes kann zwischen den verfügbaren Arbeitsumgebungen umgeschaltet werden. Beim Umschalten zu einer anderen Arbeitsumgebung wird das Backend vollständig neu geladen.

# workspaceSelector.details
source: There are two basic workspace types in TYPO3: The "Live" workspace and a number of "Draft" workspaces. When working in the Live workspace all changes you make will take immediate effect. This is the default and traditional state of operation in TYPO3. When working in the default Draft workspace or any customly created workspaces changes are not applied to the live website but rather made through new versions of any element editable. Since versioning doesn't apply to all elements in TYPO3 there are limitations to what can be done in draft workspaces; Only elements with versioning support can be edited and everything else is read-only. Draft workspaces allow preview in the frontend. When changes are final in a draft workspace they can be published into the live workspace.
de: In TYPO3 gbt es zwei grundlegende Typen von Arbeitsumgebungen: Die "Live"-Arbeitsumgebung und eine Reihe von "Entwurf"-Arbeitsumgebungen. Bei der Arbeit in der Live-Arbeitsumgebung wirken sich alle vorgenommenen Änderungen sofort aus. Dies ist die voreingestellte und traditionelle Arbeitsweise mit TYPO3. Bei der Arbeit in der voreingestellten Entwurfsarbeitsumgebung oder benutzerdefinierten Arbeitsumgebungen werden Änderungen nicht auf die online verfügbare Website angewendet, sondern als neue Versionen der editierbaren Elemente angelegt. Da die Versionierung unter TYPO3 nicht für alle Elemente verfügbar ist, unterliegen die Arbeitsumgebungen hinsichtlich der Bearbeitungsmöglichkeiten gewissen Einschränkungen: Es können nur Elemente bearbeitet werden, für die eine Unterstützung der Versionierung vorhanden ist, alle anderen besitzen Nur-Lesen-Status. Für die Entwurfsarbeitsumgebungen ist eine Vorschaufunktion im Frontend verfügbar. Wenn die Arbeiten in einer Arbeitsumgebung abgeschlossen wurden, können sie veröffentlicht und so in die Live-Arbeitsumgebung übertragen werden.
