Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_core.xlf
Languages: de

# warning.install_update
source: This installation is not configured for the TYPO3 version it is running. If you did so intentionally, this message can be safely ignored. If you are unsure, visit the %sUpdate Wizard%s section of the Install Tool to see how TYPO3 would change.
de: Diese Installation ist nicht für die laufende TYPO3-Version konfiguriert. Haben Sie dies mit Absicht getan, können Sie die Nachricht beruhigt ignorieren. Wenn Sie unsicher sind, rufen Sie den Abschnitt %sAktualisierungsassistent%s des Installationsprogramms auf, um die möglichen Änderungen zu überprüfen.

# warning.header
source: Important Notice!
de: Wichtiger Hinweis!

# warning.backend_reference
source: The Reference Index table is empty which is likely the result of a recent TYPO3 upgrade. Please go to %sTools>DB Check%s and update the reference index.
de: Die Referenzindextabelle ist leer. Dies ist wahrscheinlich die Folge einer kürzlich erfolgten TYPO3-Aktualisierung. Bitte den Punkt %sWerkzeuge > DB-Prüfung%s aufrufen und den Referenzindex aktualisieren.

# warning.backend_reference_index
source: The Reference Index table is empty which is likely the result of a recent TYPO3 upgrade. The Reference Index was last updated on %3$s. Please go to %sTools>DB Check%s and update the reference index.
de: Die Referenzindextabelle ist leer. Dies ist wahrscheinlich die Folge einer kürzlich erfolgten TYPO3-Aktualisierung. Der Referenzindex wurde zuletzt am %3$s aktualisiert. Bitte den Punkt %sWerkzeuge > DB-Prüfung%s aufrufen und den Referenzindex aktualisieren.

# warning.memcache_not_usable
source: Memcache is configured, but connection to memcached failed with these configuration(s):
de: Memcache wurde konfiguriert, aber Verbindung zu Memcache ist fehlgeschlagen mit folgender/n Konfiguration(en):

# warning.file_missing
source: File is missing!
de: Datei fehlt!

# warning.file_missing_text
source: This content element references a file which seems to not exist:
de: Dieses Inhaltselement verlinkt auf eine Datei, die nicht existiert:

# error.formProtection.tokenInvalid
source: Validating the security token of this form has failed. Please reload the form and submit it again.
de: Die Validierung des Sicherheitstokens dieses Formulars ist fehlgeschlagen. Bitte laden Sie das Formular erneut und schicken Sie es dann noch einmal ab.

# toolbarItems.shortcuts
source: Shortcuts
de: Verweise

# toolbarItems.shortcut
source: Shortcut
de: Verweis

# toolbarItems.shortcutsGroup
source: Shortcut Group
de: Verweisgruppe

# toolbarItems.shortcutsEdit
source: Edit Shortcut
de: Verweis bearbeiten

# toolbarItems.shortcutsDelete
source: Delete Shortcut
de: Verweis löschen

# toolbarItems.bookmarks
source: Bookmarks
de: Lesezeichen

# toolbarItems.bookmark
source: Bookmark
de: Lesezeichen

# toolbarItems.bookmarksGroup
source: Bookmark group
de: Lesezeichengruppe

# toolbarItems.bookmarksEdit
source: Edit bookmark
de: Lesezeichen bearbeiten

# toolbarItems.bookmarksDelete
source: Delete bookmark
de: Lesezeichen löschen

# toolbarItems.search
source: Search
de: Suchen

# toolbarItems.workspace
source: Workspace
de: Arbeitsumgebung

# tabs.closeAll
source: Close All Tabs
de: Alle Tabs schließen

# tabs.closeOther
source: Close Other Tabs
de: Andere Tabs schließen

# tabs.close
source: Close Tab
de: Tab schließen

# tabs.openInBrowserWindow
source: Open In Browser Window
de: In Browserfenster öffnen

# donateWindow.title
source: TYPO3 donation notice
de: TYPO3-Spenden-Hinweis

# donateWindow.message
source: <b>You have now used TYPO3 for more than three months.</b> It would be great if you could donate. TYPO3 is Open Source and relies heavily on donations from its users and supporters.<br/> <b>Thank you</b> for making this great Content Management System even better with your help!
de: <b>Sie nutzen TYPO3 jetzt seit mehr als drei Monaten.</b> Es wäre sehr freundlich, wenn Sie für seine Weiterentwicklung spenden könnten. TYPO3 ist Open Source und ist sehr auf Spenden seiner Nutzer und Unterstützer angewiesen.<br /> <b>Danke,</b> dass Sie dieses großartige Content-Management-System mit Ihrer Hilfe noch besser machen!

# donateWindow.button_donate
source: Donate now
de: Jetzt spenden

# donateWindow.button_disable
source: Never show again
de: Nie wieder zeigen

# donateWindow.button_postpone
source: Remind me later
de: Mich später erinnern

# ExtDirect.namespaceError
source: Ext Direct error in "%s" with namespace: "%s"\n Try to clear the TYPO3 cache and / or use paramater no_cache=1 as parameter in URL typo3/ajax.php\n\n Check also the following points:\n - configuration in ext_localconf.php: registration key should be like "TYPO3.MyExtension.Sample"\n - URL typo3/ajax.php: namespace parameter should be like: "TYPO3.MyExtension"\n - javascript: method\'s name should be like: "TYPO3.MyExtension.Sample.myMethod"\n
de: Ext-Direct-Fehler in "%s" mit Namespace: "%s" Versuchen Sie, den TYPO3-Cache zu leeren und/oder den Parameter no_cache=1 in der URL typo3/ajax.php zu verwenden. Prüfen Sie auch folgende Punkte: - Die Konfiguration in ext_localconf.php: Der Registrierungsschlüssel sollte wie "TYPO3.MeineErweiterung.Beispiel" aussehen - URL typo3/ajax.php: Der Namespace-Parameter sollte wie "TYPO3.MeineErweiterung" aussehen - JavaScript: Methodennamen sollten wie "TYPO3.MeineErweiterung.Beispiel.meineMethode" aussehen

# ExtDirect.noNamespace
source: Ext Direct error in "%s": no namespace has been found.
de: Ext-Direct-Fehler in "%s": Kein Namespace gefunden.

# extension.not.installed
source: Extension "%s" is not installed.
de: Erweiterung "%s" ist nicht installiert.

# link.to.dblist.correctly
source: Please, do not link to this page. Use t3lib_BEfunc::getListViewLink() for link generation.
de: Bitte verlinken Sie nicht auf diese Seite. Benutzen Sie stattdessen t3lib_extMgm::createListViewLink(), um Links zu erzeugen.

# link.to.filefile.correctly
source: Please, do not link to this page.
de: Bitte verlinken Sie nicht auf diese Seite.

# loadingIndicator
source: Loading ...
de: Lädt...

# csh_tooltip_loading
source: Loading help...
de: Lädt Hilfetext...
