Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_em.xlf
Languages: de

# emconf_flags.details
source: This is a list of the flags: <b>Module:</b> A true backend main/sub module is found to be added. <b>Module+:</b> The extension adds itself to the function menu of an existing backend module. <b>loadTCA:</b> The extension includes a function call to t3lib_div::loadTCA for loading a table. This potentially means that the system is slowed down, because the full table description of some table is always included. However there probably is a good reason for this to happen. Probably the extension tries to manipulate the TCA-config for an existing table in order to extend it. <b>TCA:</b> The extension contains configuration of a table in $TCA. <b>Plugin:</b> The extension adds a frontend plugin to the plugin list in Content Element type "Insert Plugin". <b>Plugin/ST43:</b> TypoScript rendering code for the plugin is added to the static template "Content (default)". "Plugin" and "Plugin/ST43" are commonly used together. <b>Page-TSconfig:</b> Default Page-TSconfig is added. <b>User-TSconfig:</b> Default User-TSconfig is added. <b>TS/Setup:</b> Default TypoScript Setup is added. <b>TS/Constants:</b> Default TypoScript Constants is added.
de: Das ist die Liste aller Flaggen: <b>Module:</b> Ein neues Modul wurde gefunden. <b>Module+:</b> Ein bereits bestehendes Modul wird durch neue Funktionen erweitert. <b>loadTCA:</b> <b>TCA:</b> Die Erweiterung enthält in der Variablen $TCA Konfigurationen für eine Datenbanktabelle. <b>Plugin:</b> Die Erweiterung stellt ein neues Plug-In für das Frontend bereit. <b>Plugin/ST43:</b> Die Erweiterung installiert innerhalb des Inhaltselementes "Content (default)" neue TypoScript-Darstellungsoptionen. Der Begriff "Plug-In" und "Plugin/ST43" werden häufig synonym verwendet. <b>Page-TSconfig:</b> Seiten-TSconfig-Informationen werden installiert. <b>User-TSconfig:</b> Benutzer-TSconfig-Informationen werden installiert. <b>TS/Setup:</b> TypoScript-Setup-Informationen werden installiert. <b>TS/Constants:</b> TypoScript-Konstanten werden installiert.

# emconf_conf.description
source: Shows if the extension has a template for further lowlevel configuration.
de: Zeigt, ob die Erweiterung eine Vorlage zur weitergehenden Konfiguration beinhaltet.

# emconf_TSfiles.alttitle
source: Static TypoScript files
de: Statische TypoScript-Dateien

# emconf_TSfiles.description
source: Shows which TypoScript static files may be present
de: Zeigt, welche statischen TypoScript-Dateien durch diese Erweiterung installiert werden.

# emconf_TSfiles.details
source: If the files ext_typoscript_constants.txt and/or ext_typoscript_setup.txt is found in the extension folder they are included in the hierarchy of all TypoScript templates in TYPO3 right after the inclusion of other static templates.
de: Wenn die Dateien ext_typoscript_constants.txt und/oder ext_typoscript_setup.txt innerhalb des Installationsordners vorhanden sind, werden diese Dateien in die Hierarchie der TypoScript-Vorlagen eingebunden (nachdem alle anderen statischen Vorlagen eingebunden wurden).

# emconf_locallang.alttitle
source: locallang-files
de: locallang-Dateien

# emconf_locallang.description
source: Shows which files named "locallang.php" are present in the extension folder (recursive search). Such files are usually used to present an array $LOCAL_LANG with labels for the application in the system languages.
de: Listet alle Dateien mit dem Namen "locallang.php" innerhalb des Installationsordners der Erweiterung auf (rekursive Suche). In diesen Dateien befinden sich normalerweise sog. $LOCAL_LANG-Arrays, welche Übersetzungen der Erweiterung in die verschiedenen Landessprachen beinhalten.

# emconf_moduleNames.alttitle
source: Backend Module names
de: Namen der Backend-Module

# emconf_moduleNames.description
source: Shows which module names were found inside the extension.
de: Listet die innerhalb der Erweiterung gefundenen Module auf.

# emconf_classNames.alttitle
source: PHP Class names
de: Namen der PHP-Klassen

# emconf_classNames.description
source: Shows which PHP-classes were found in .php and .inc files.
de: Zeigt an, welche PHP-Klassen innerhalb von .php- oder .inc-Dateien gefunden wurden.

# emconf_errors.alttitle
source: Errors
de: Fehler

# emconf_errors.description
source: Displays if any errors with the extension were discovered.
de: Zeigt an, ob durch das Installieren der Erweiterung Fehler aufgetreten sind.

# emconf_NSerrors.alttitle
source: Namespace errors
de: Bezeichnungsfehler

# emconf_NSerrors.description
source: Certain naming convensions apply to extensions. This displays any violations found.
de: Für Erweiterungen gelten bestimmte Namenskonventionen. Verstöße gegen diese Konventionen werden hier angezeigt.

# emconf_NSerrors.details
source: The naming convensions are defined in the "Inside TYPO3" document. To make naming as simple as possible, try to avoid underscores in your extension keys.
de: Die Namenskonventionen werden im Referenzdokument "Inside TYPO3" beschrieben. Um die Bezeichnung so einfach wie möglich zu gestalten, vermeiden Sie bitte den Gebrauch des Unterstriches "_".
