Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_em.xlf
Languages: de

# settings.description
source: Enter settings for the Extension Manager. The username and password is for connections to the repository (usually TYPO3.org) and the upload password is that you would normally use for upload of your extensions.
de: Geben Sie hier Ihre Einstellungen für den Erweiterungs-Manager an. Benutzername und Passwort werden für Verbindungen zum TER (normalerweise auf typo3.org) verwendet und das Hochladepasswort ist identisch mit jenem, welches Sie normalerweise zum Hochladen Ihrer eigenen Erweiterungen ins TER verwenden.

# settings.details
source: <b>Notice:</b> This information is not very well protected! It is send and stored in clear-text!
de: <b>Bemerkung:</b> Die Passwort-Informationen sind nicht sonderlich gut geschützt: Passwörter werden im Klartext gespeichert und übertragen!

# settings.image_descr
source: Settings for TER connections.
de: Einstellungen für Online-Verbindungen zum TER

# makenew.alttitle
source: Kickstarting new extensions
de: Neue Erweiterung erstellen (Kickstarter)

# makenew.description
source: The "Kickstarter" is an application which allows you to start up new extension work very quickly. Through an interface you can create a basic framework for your extension where all the boring stuff is configured from the beginning and you can concentrate directly on coding your application.
de: Der "Kickstarter" ist eine spezielle Erweiterung, die es Ihnen erlaubt, das Grundgerüst für Ihre eigene Erweiterung mit ein paar Mausklicks selbst zu erstellen. Dadurch entfällt das lästige Anlegen der benötigten Ordner, Dateien, Datenbanktabellen usw., und Sie können sich direkt auf die eigentliche Programmierarbeit konzentrieren.

# makenew.details
source: The Extension Repository Kickstarter is a separate extension, "extrep_wizard". Please see more information about the kickstarter otherwise. <b>Notice:</b> The Kickstarter is NOT an editor! When a new extension is started you cannot - as a rule of thumb - go back an edit it with the kickstarter! It will just overwrite any custom changes you did in the meantime!
de: Der "Kickstarter" ist eine eigenständige Erweiterung ("extrep_wizard"). Bitte lesen Sie das entsprechende Handbuch, um mehr über diese Erweiterung zu erfahren. <b>Achtung:</b> Der Kickstarter ist <em>kein</em> Editor! Nachdem Sie eine neue Erweiterung erst einmal angelegt haben, können Sie den Kickstarter nicht mehr dazu verwenden, Veränderungen an der Grundstruktur Ihrer Erweiterung vorzunehmen! All Ihre Änderungen (also Ihre eigentliche Programmierarbeit) werden dadurch überschrieben und Sie erhalten wieder ein leeres Grundgerüst!

# _makenew.seeAlso
source: Register Extension Keys | http://typo3.org/extensions/register-extension-keys/ Extension API | http://typo3.org/documentation/document-library/doc_core_api/Introduction-f289e83016/ Documentation Matrix | http://typo3.org/documentation/document-library/Matrix/
de: Erweiterungsschlüssel registrieren | http://typo3.org/extensions/register-extension-keys/ Erweiterungs-API | http://typo3.org/documentation/document-library/doc_core_api/Introduction-f289e83016/ Dokumentations-Matrix | http://typo3.org/documentation/document-library/Matrix/

# makenew.image_descr
source: When the "Extension Repository Kickstarter" is enabled it adds itself in the menu of the Extension Manager. From here you will be able to start your new extensions. Before you do so you should register an extension key and enter a title and description as base data. From that point it is just clicking the "+" icons to add the various types of functionality you want. Finally you click "View result" to write the extension to the server.
de: Der "Kickstarter" fügt sich nach der Installation als eigenständiger Menüpunkt innerhalb des Eweiterungs-Managers ein. Mit ihm können Sie das Grundgerüst Ihrer eigenen Erweiterung erstellen. Vorher sollten Sie sich jedoch einen eigenen Erweiterungsschlüssel reservieren (auf typo3.org) und die Grunddaten Ihrer Erweiterung (Name und Beschreibung) eingeben. Danach können Sie durch Anklicken des "+"-Zeichens die verschiedenen Funktionalitäten hinzufügen. Mit der Schaltfläche "Ergebnis anzeigen" wird Ihre Erweiterung dann auf den Server übertragen.

# emconf_shy.alttitle
source: Shy
de: Standarderweiterung

# emconf_shy.description
source: If set, the extension will normally be hidden in the EM because it might be a default extension or otherwise something which is not so important.
de: Mit dieser Option werden Erweiterungen innerhalb des Erweiterungs-Managers ausgeblendet, entweder, weil es sich bei ihnen um Standarderweiterungen handelt oder weil sie nicht von allgemeinen Interesse sind.

# emconf_shy.details
source: Use this flag if an extension is of "rare interest" (which is not the same as un-important - just an extension not sought for very often...) It does not affect whether or not it's enabled. Only display in EM. Normally "shy" is set for all extensions loaded by default according to TYPO3_CONF_VARS.
de: Benutzen Sie diese Flagge, wenn eine Erweiterung nicht von allgemeinen Interesse ist (was aber keinesfalls gleichbedeutend mit <em>unwichtig</em> ist!). Diese Option beeinflusst nicht, ob die Erweiterung geladen oder nicht geladen wird, sondern lediglich die Auflistung im EM! Normalerweise werden Standarderweiterungen entsprechend den Werten der Variable TYPO3_CONF_VARS direkt beim Systemstart geladen.

# emconf_category.alttitle
source: Category
de: Kategorie

# emconf_category.description
source: Which category the extension belongs to.
de: Zeigt, welcher Kategorie die Erweiterung angehört.

# emconf_category.details
source: <b>be:</b> Backend (Generally backend oriented, but not a module) <b>module:</b> Backend modules (When something is a module or connects with one) <b>fe:</b> Frontend (Generally frontend oriented, but not a "true" plugin) <b>plugin:</b> Frontend plugins (Plugins inserted as a "Insert Plugin" content element) <b>misc:</b> Miscellaneous stuff (Where not easily placed elsewhere) <b>services:</b> Contains TYPO3 services. <b>templates:</b> Contains website templates <b>doc:</b> Documentation (Eg. tutorials, FAQ's etc.) <b>example:</b> Example extension (Which serves as examples etc.)
de: <b>be:</b> Backend (Backend-orientiert, aber keine Erweiterung) <b>module:</b> Backend-Erweiterung (eigenständige Erweiterung oder Zusatz zu einer anderen Erweiterung) <b>fe:</b> Frontend (Frontend-orientiert, aber kein "echtes" Plug-In) <b>plugin:</b> Frontend-Erweiterung (Erweiterung, die mittels "Plug-In einfügen" als Inhaltselement auf der Website eingefügt werden kann) <b>misc:</b> Sonstiges (fällt nicht in eine der anderen Kategorien) <b>services:</b> Stellt einen TYPO3-Dienst zur Verfügung <b>templates:</b> Enthält Website-Vorlagen <b>doc:</b> Dokumentation (Anleitungen, FAQs etc.) <b>example:</b> Beispielerweiterung (dient als Beispiel, Machbarkeitsstudie oder ähnliches)

# emconf_dependencies.alttitle
source: Dependencies of other extensions?
de: Abhängigkeiten von anderen Erweiterungen?

# emconf_dependencies.description
source: This is a list of other extension keys which this extension depends on being loaded BEFORE it self.
de: Dies ist eine Liste von Erweiterungen, die zuerst geladen sein müssen, bevor diese Erweiterung selbst geladen werden kann.

# emconf_dependencies.details
source: The EM will manage that dependency while writing the extension list to localconf.php. You cannot install an extension unless its dependencies has been installed already.
de: Der EM kümmert sich um Abhängigkeiten, während er die Erweiterungsliste in die Datei localconf.php schreibt. Sie können keine Erweiterungen installieren, deren Abhängigkeiten nicht vollständig erfüllt sind!

# emconf_conflicts.alttitle
source: Conflicts with other extensions?
de: Konflikte mit anderen Erweiterungen?

# emconf_conflicts.description
source: List of extension keys of extensions with which this extension does not work (and so cannot be enabled before those other extensions are un-installed)
de: Liste der Erweiterungen, die inkompatibel zu dieser Erweiterung sind. Sie können diese Erweiterung also erst laden, wenn Sie die hier aufgeführten Erweiterungen deaktiviert haben.

# emconf_suggests.alttitle
source: Suggested extensions
de: Vorgeschlagene Erweiterungen

# emconf_suggests.description
source: List of extension keys of extensions which you may want to try in conjunction with this extension because they bring added benefits when working together.
de: Eine Liste der Schlüssel von Erweiterungen, die in Verbindung mit dieser Erweiterung zu empfehlen sind, weil sie zusammen weitere Vorteile mit sich bringen.

# emconf_priority.alttitle
source: Requested Loading priority
de: Gewünschte Ladereihenfolge

# emconf_priority.description
source: This tells the EM to try to put the extensions as the very first in the list. Default is last.
de: Weist den EM an zu versuchen, diese Erweiterung als erste zu laden (Standard ist zuletzt).

# emconf_module.alttitle
source: Backend modules included
de: Enthaltene Backend-Module

# emconf_module.description
source: If any subfolders to an extension contains backend modules, those foldernames should be listed here.
de: Wenn ein Unterordner einer Erweiterung ein oder mehrere Backend-Module enthält, sollten diese Ordnernamen hier aufgeführt werden.

# emconf_module.details
source: It allows the EM to know about the existence of the module, which is important because the EM has to update the conf.php file of the module in order to set the correct TYPO3_MOD_PATH constant.
de: Dadurch wird der EM angewiesen, die Konfigurationsdatei conf.php sowie die Konstante TYPO3_MOD_PATH entsprechend anzupassen, was für eine ordnungsgemäße Funktion der Erweiterung entscheidend ist.

# emconf_state.alttitle
source: Development state
de: Entwicklungsstadium

# emconf_state.description
source: Which development state the extension is in.
de: Zeigt an, in welchem Entwicklungsstadium sich die Erweiterung befindet.

# emconf_state.details
source: <b>alpha</b> Very initial development. May do nothing at all. <b>beta</b> Under current development. Should work partly but is not finished yet. <b>stable</b> Stable and used in production. <b>experimental</b> Nobody knows if this is going anywhere yet... Maybe still just an idea. <b>test</b> Test extension, demonstrates concepts etc.
de: <b>alpha</b> Sehr frühes Entwicklungsstadium einer Erweiterung. Bietet vielleicht noch gar keine Funktionalitäten. <b>beta</b> Zur Zeit in Entwicklung. Arbeitet teilweise, ist aber noch nicht fertiggestellt. <b>stable</b> Stabil und ist auf Produktivsystemen lauffähig. <b>experimental</b> Niemand kann sagen, ob diese Entwicklung zu einer Erweiterung führen wird... Vielleicht lediglich eine Idee. <b>test</b> Testerweiterung, demonstriert Konzepte etc.

# emconf_internal.alttitle
source: Internally supported in core
de: Spezielle Unterstützung durch TYPO3-Kern

# emconf_internal.description
source: This flag indicates that the core source code is specifically aware of the extension.
de: Dieses Flagge zeigt an, ob der TYPO3-Kern diese Erweiterung besonders unterstützt.

# emconf_internal.details
source: In other words this flag should convey the message that "this extension could not be written without some core source code modifications". An extension is not internal just because it uses TYPO3 general classes eg. those from t3lib/. True non-internal extensions are characterized by the fact that they could be written without making core source code changes, but relies only on existing classes in TYPO3 and/or other extensions, plus its own scripts in the extension folder.
de: Die Flagge sollte so interpretiert werden, dass die Erweiterung nicht ohne einige grundlegende Änderungen im TYPO3-Kern selbst hätte entwickelt werden können (system-interne Unterstützung). "Normale" Erweiterungen zeichnen sich dadurch aus, dass sie allein mit Hilfe der durch TYPO3 gelieferten Klassen (und gegebenenfalls weiterer Erweiterungen), sowie selbst geschriebener Skripte entwickelt werden können. Für die Entwicklung dieser Erweiterung mussten jedoch zuerst Änderungen oder Erweiterungen am TYPO3-Kern vorgenommen werden.

# emconf_clearCacheOnLoad.alttitle
source: Clear cache when installed
de: Cache nach dem Laden löschen

# emconf_clearCacheOnLoad.description
source: If set, the EM will request the cache to be cleared when this extension is installed.
de: Mit dieser Option wird TYPO3 angewiesen, nach dem Laden der Erweiterung alle Caches zu löschen.

# emconf_modify_tables.alttitle
source: Existing tables modified
de: Veränderte Datenbanktabellen

# emconf_modify_tables.description
source: List of tablenames which are only modified - not fully created - by this extension.
de: Liste der Tabellennamen, welche durch diese Erweiterung lediglich verändert - nicht neu angelegt - werden.

# emconf_modify_tables.details
source: Tables from this list found in the ext_tables.sql file of the extension
de: Auflistung der Tabellen, die in der Datei ext_tables.sql dieser Erweiterung gefunden wurden.

# emconf_doNotLoadInFE.alttitle
source: Load in frontend
de: Im Frontend laden

# emconf_doNotLoadInFE.description
source: "Yes" (default) will load the extension in the frontend and the backend. "No": the extension is loaded only in the backend.
de: Bei Auswahl von "Ja" (Standard), wird die Erweiterung sowohl im Frontend als auch im Backend geladen. Bei "Nein" wird sie nur im Backend geladen.

# emconf_doNotLoadInFE.details
source: Some extensions are only required in the backend. With this flag set, this extension is not loaded in the frontend context, thus speeding up the site.
de: Manche Erweiterungen sind nur im Backend erforderlich. Ist diese Option gesetzt, wird die Erweiterung nicht im Frontend geladen, was die Website performanter macht.

# emconf_private.alttitle
source: Private
de: Privat

# emconf_private.description
source: If set, this version is not shown in the public list in the online repository.
de: Mit dieser Option wird eine Erweiterung als "Privat" gekennzeichnet. Dadurch erscheint sie nicht mehr in der allgemeinen (öffentlichen) Auflistung innerhalb des TER.

# emconf_private.details
source: "Private" uploads requires you to manually enter a special key (which will be shown to you after an upload has been completed) to be able to import and view details for the uploaded extension. This is nice when you are working on something internally which you do not want others to look at. You can set and clear the private flag every time you upload your extension.
de: "Private" Uploads ins TER erfordern, dass Sie einen speziellen Schlüssel (Passwort) angeben, um die Erweiterung zu importieren oder sich Details zu dieser Erweiterung anzeigen zu lassen. Dieser Mechanismus ermöglicht es Ihnen, eine Erweiterung zunächst in einem geschützten, privaten Umfeld zu entwickeln, bevor Sie Ihre Arbeit der Allgemeinheit zugänglich machen. Die Option "Privat" kann mit jedem neuen Upload ins TER geändert werden.

# emconf_download_password.alttitle
source: Download password
de: Passwort zum Herunterladen

# emconf_download_password.description
source: Additional password required for download of private extensions.
de: Zusätzliches Passwort, welches zum Herunterladen der als "Privat" markierten Erweiterungen benötigt wird.

# emconf_download_password.details
source: Anybody who knows the "special key" assigned to the private upload will be able to import it. Specifying an import password allows you to give away the download key for private uploads and also require a password given in addition. The password can be changed later on.
de: Jeder, der den "speziellen Schlüssel" dieser privaten Erweiterung kennt, kann diese Erweiterung in sein TYPO3-System importieren.

# emconf_type.alttitle
source: Installation type
de: Installationstyp

# emconf_type.description
source: The type of the installation
de: Beschreibt die Installationsart

# emconf_type.details
source: The files for an extension are located in a folder named by the extension key. The location of this folder can be either inside typo3conf/ext/, typo3/ext/ or typo3/sysext/. The extension must be programmed so that it automatically detects where it is located and can work from all three locations. <b>Local location "typo3conf/ext/":</b> This is where to put extensions which are local for a particular TYPO3 installation. The typo3conf/ directory is always local, containing local configuration (eg. localconf.php), local modules etc. If you put an extension here it will be available for this TYPO3 installation only. This is a "per-database" way to install an extension. <b>Global location "typo3/ext/":</b> This is where to put extensions which are global for the TYPO3 source code on the web server. These extensions will be available for any TYPO3 installation sharing the source code. When you upgrade your TYPO3 source code you probably want to copy the typo3/ext/ directory from the former source to the new source, overriding the default directory. In this way all global extension you use will be installed inside the new sourcecode. After that you can always enter TYPO3 and upgrade the versions if needed. This is a "per-server" way to install an extension. <b>System location "typo3/sysext/":</b> This is system default extensions which cannot and should not be updated by the EM. They are distributed with the TYPO3 core. <b>Loading precedence</b> Local extensions take precedence which means that if an extension exists both in typo3conf/ext/ and typo3/ext/ the one in typo3conf/ext/ is loaded. Likewise global extension takes predence over system extensions. This means that extensions are loaded in the order of priority local-global-system. In effect you can therefore have, say, a "stable" version of an extension installed in the global dir (typo3/ext/) which is used by all your projects on a server sharing source code, but on a single experimental project you can import the same extension in a newer "experimental" version and for that particular project the locally available extension will be used instead.
de: Die zu einer Erweiterung gehörenden Dateien werden in einem Ordner abgelegt, dessen Name sich von deren Erweiterungsschlüssel ableitet. Dabei kann sich dieser Installationsordner an einer von drei möglichen Stellen befinden, nämlich typo3conf/ext/, typo3/ext/ oder typo3/sysext/. Aus diesem Grund müssen Erweiterungen stets so programmiert werden, dass sie ihren Installationsort automatisch erkennen und somit unabhängig vom Installationsort immer lauffähig sind. Beschreibung der möglichen Installationsarten: <b>Lokal "typo3conf/ext/":</b> An dieser Stelle sollten Erweiterungen installiert werden, die spezifisch für eine bestimmte TYPO3-Installation sind. Der Ordner typo3conf/ ist immer lokal, d.h. er enthält immer lokale Konfigurationseinstellungen (z.B. in localconf.php), lokale Erweiterungen usw. Wenn Sie also hier eine Erweiterung platzieren, steht sie nur dieser TYPO3-Installation zur Verfügung. So wird die Erweiterung quasi pro Datenbank installiert. <b>Global "typo3/ext/":</b> Hier sollten Erweiterungen installiert werden, die global für den TYPO3-Quelltext auf einem Server gelten sollen. Diese Erweiterungen stehen dann allen TYPO3-Installationen zur Verfügung, die sich diesen Quelltext teilen. Wenn der TYPO3-Quelltext aktualisiert werden soll, empfiehlt es sich, das Verzeichnis typo3/ext/ vom alten zum neuen Quelltext zu kopieren und das Standardverzeichnis zu überschreiben. Auf diese Weise werden sämtliche verwendeten, globalen Erweiterungen im neuen Quelltext installiert. Anschließend kann TYPO3 aufgerufen und ggf. eine Aktualisierung der Versionen durchgeführt werden. So wird die Erweiterung quasi pro Server installiert. <b>System "typo3/sysext/":</b> Hierbei handelt es sich um Standardsystemerweiterungen, die nicht über den EM aktualisiert werden können und sollten. Sie gehören zum Lieferumfang des TYPO3-Kerns. <b>Hierarchie</b> Lokale Erweiterungen haben Vorrang, d.h., falls eine Erweiterung sowohl in typo3conf/ext/ als auch in typo3/ext/ vorhanden ist, wird diejenige in typo3conf/ext/ geladen. Darüber hinaus genießen globale Erweiterungen Vorrang vor Systemerweiterungen. Die Prioritätsreihenfolge der Erweiterungen lautet also lokal-global-system. Effektiv ist es daher möglich, beispielsweise eine stabile Version einer Erweiterung im globalen Verzeichnis (typo3/ext/) installiert zu haben, die für alle Projekte auf einem Server verwendet wird, die sich den Quelltext teilen, aber auch in ein experimentelles Projekt eine neuere, "experimentelle" Version der selben Erweiterung zu importieren. Für dieses spezielle Projekt wird dann die lokal verfügbare Erweiterung genutzt.

# emconf_doubleInstall.alttitle
source: Installed twice or more?
de: Mehrfach installiert?

# emconf_doubleInstall.description
source: Tells you if the extensions is installed in more than one of the System, Global or Local locations.
de: Zeigt Ihnen, ob die Erweiterung mehrfach installiert wurde. Mögliche Installationsorte sind dabei: System, global oder lokal.

# emconf_doubleInstall.details
source: Because an extension can reside at three locations, System, Global and Local, this indicates if the extension is found in other locations than the current. In that case you should be aware which one of the extensions is loaded!
de: Weil eine Erweiterung <em>gleichzeitig</em> an bis zu drei verschiedenen Orten (nämlich System, global oder lokal) installiert sein kann, erfahren Sie hier, ob die Erweiterung noch an weiteren Orten gefunden wurde. In diesem Fall sollten Sie genau wissen, welche Erweiterung geladen wird!

# emconf_rootfiles.alttitle
source: Root files
de: Root-Dateien

# emconf_rootfiles.description
source: List of the files in the extension folder. Does not list files in subfolders.
de: Listet alle Dateien innerhalb des Installationsordners der Erweiterung auf. Unterordner werden in dieser Auflistung ignoriert!

# emconf_dbReq.alttitle
source: Database requirements
de: Datenbankanforderungen

# emconf_dbReq.description
source: Shows you the requirements to the database tables and fields, if any.
de: Zeigt die Datenbankanforderungen dieser Erweiterung (Datenbanktabellen und/oder -felder)

# emconf_dbReq.details
source: This will read from the files ext_tables.sql and ext_tables_static+adt.sql and show you which tables, fields and static tables are required with this extension.
de: Die Datenbankanforderungen für Tabellen, Felder und statische Tabellen werden hierbei den Dateien ext_tables.sql und ext_tables_static+adt.sql entnommen.

# emconf_dbStatus.alttitle
source: Database requirements status
de: Status der Datenbankanforderungen

# emconf_dbStatus.description
source: Displays the current status of the database compared to the extension requirements.
de: Vergleicht den derzeitigen Datenbankstatus mit den Anforderungen der Erweiterung.

# emconf_dbStatus.details
source: If the extension is loaded which will display and error message if some tables or fields are not present in the database as they should be!
de: Sollten Datenbanktabellen oder -felder, welche die Erweiterung benötigt, fehlen, wird hier die entsprechende Fehlermeldung ausgegeben.

# emconf_flags.alttitle
source: Flags
de: Flaggen

# emconf_flags.description
source: A list of special codes which tells you something about what parts of TYPO3 the extension touches.
de: Eine Liste mit speziellen Codes, die Ihnen zeigen, welche Teile von TYPO3 durch diese Erweiterung berührt werden.
