Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: de

# .alttitle
source: TYPO3 Core
de: TYPO3-Kern

# .description
source: TYPO3 is a Content Management Framework which consists of a central program core with only limited functionality. To extend this core system there are hundreds of extensions which in combination will provide a very capable system.
de: TYPO3 ist ein Content-Management-System (CMS). Es basiert auf einem Kern mit Basisfunktionalitäten, zu denen insbesondere die Erweiterbarkeit gehört. Es stehen hunderte solcher Erweiterungen zur Verfügung, die in Kombination ein sehr leistungsfähiges System ergeben, welches zudem genau auf Ihre Bedürfnisse zugeschnitten werden kann.

# .details
source: For most people TYPO3 is equivalent to a CMS providing a backend for management of the content and a frontend engine for website display. However TYPO3s core is natively designed to be a general purpose framework for management of database content. The core of TYPO3 delivers a set of principles for storage of this content, user access management, editing of the content, uploading and managing files etc. Many of these principles are expressed as an API (Application Programmers Interface) for use in the <em>extensions</em> which ultimately adds most of the real functionality.
de: Für die meisten Benutzer ist TYPO3 einfach ein CMS mit einem "Backend" zur Verwaltung von Inhalten und einem "Frontend", das die Website anzeigt. Aber der TYPO3-Kern ist eher ein Universalsystem zur Verwaltung von Datenbankinhalten. Der TYPO3-Kern stellt eine Sammlung von Mechanismen zur Verfügung, mit denen diese Inhalte gespeichert und wieder hervorgeholt, die Rechte von Benutzern verwaltet und die Inhalte bearbeitet werden können, Dateien hochgeladen, gespeichert und mit den Inhalten der Datenbank verknüpft werden können usw. Viele dieser Mechanismen stehen in Form von APIs (Application Programming Interface, Programmierschnittstelle) den <em>Erweiterungen</em> zur Verfügung, welche dann die eigentliche Funktionalität bereitstellen.

# .image_descr
source: TYPO3 backend login screen.
de: Anmeldebildschirm für das TYPO3-Backend

# menu_modules.alttitle
source: Backend modules
de: Backend-Module

# menu_modules.description
source: The Backend menu reflects the hierarchy of main- and sub-modules in TYPO3. Click a menu item to access the corresponding module.
de: Das Backend-Menü spiegelt die Hierarchie von Haupt- und Untermodulen in TYPO3 wieder. Klicken Sie einen Menüeintrag an, um das entsprechende Modul zu aktivieren.

# menu_modules.details
source: Backend Users might see different menu items depending on their access permissions. The "Admin" user on a system will always see all modules available. You can configure the backend to display the menu in two alternative versions (useful on smaller screens); As a selector box or list of icons in the top frame of the backend. When you click the little "+" or "-" icons next to the main modules, you can collapse (-) or expand (+) all the sub modules. By selecting the "Expand all" check box, all items are expanded. When the checkbox is unselected again, the menu changes back to the previous folding state. If you click "Expand all" and collapse a main module afterwards, the previous folding state is discarded and "Expand all" is unselected again.
de: Backend-Benutzer können unterschiedliche Zusammenstellungen von Menüeinträgen sehen, abhängig von ihren Aufgaben und Zugriffsrechten. Der "Administrator" des Systems hat immer alle installierten Module zur Verfügung. Das Backend lässt sich so konfigurieren, dass das Menü in zwei anderen Varianten angezeigt wird (sinnvoll für kleinere Bildschirme): entweder als eine aufklappbare Auswahlliste oder als eine Reihe von Symbolen ganz oben im Backend. Durch Anklicken der kleinen Symbole "+" und "-" neben den Hauptmodulen können die Untermodule angezeigt und verdeckt werden. Durch Aktivieren der Option "Alle anzeigen" werden sämtliche Untermodule angezeigt. Wird die Option wieder deaktiviert, kehren die Menüs wieder in den vorherigen Zustand zurück. Wählt man "Alle anzeigen" und verdeckt anschließend ein Hauptmodul, so wird der vorherige Zustand verworfen und "Alle anzeigen" wird deaktiviert.

# _menu_modules.seeAlso
source: be_groups:groupMods, be_users:userMods, _MOD_user_setup:option_noMenuMode, More about Modules | http://typo3.org/documentation/document-library/doc_tut_quickstart/Backend_and_frontend/
de: be_groups:groupMods, be_users:userMods, _MOD_user_setup:option_noMenuMode, Mehr über Module | http://typo3.org/documentation/document-library/doc_tut_quickstart/Backend_and_frontend/

# menu_modules.image_descr
source: This is the range of menu options for a typical backend user. For another backend user it might be different. This screen shot shows how another user has different permissions set and therefore access to other modules only. Also the backend language has been set different for this user.
de: Dies sind Menüeintrage, die etwa ein typischer Backend-Benutzer zur Verfügung hätte. Für einen anderen Backend-Benutzer können die Einträge andere sein. Diese Abbildung zeigt die Einträge für einen Benutzer mit eingeschränkten Aufgaben bzw. Rechten, der deshalb nur Zugriff auf einen Teil der Module hat. Außerdem hat dieser Benutzer eine andere Sprache im Backend eingestellt.

# menu_adminFunction.alttitle
source: Admin Functions
de: Admin-Funktionen

# menu_adminFunction.description
source: The Admin Functions allow administrators to clear caches etc.
de: Die Admin-Funktionen erlauben Administratoren, z.B. den Cache zu löschen usw.

# menu_adminFunction.details
source: TYPO3 has multiple caching systems: <b>Database Cache</b> A very central cache is the database cache table, "cache_hash", which needs to be flushed after certain major changes in the system. You "clear all cache" by clicking the link with the blue icon. After this operation any website content should be re-generated from the sources rather than be delivered from caches. This operation clears <i>all</i> database tables registered as flushable cache tables. <b>Cached PHP configuration files from Extensions</b> TYPO3 also caches small configuration scripts from extensions, "ext_localconf.php" and "ext_tables.php". These files are simply read from all installed extensions and concatenated into temporary PHP scripts found in the typo3temp/Cache/Code/cache_core/ folder. Sometimes you need to remove these files so TYPO3 re-writes them from the originals. This is done by the "Clear temp_CACHED" link. <b>Notice:</b> You should not clear these caches without a second thought. Clearing caches may affect performance on your server negatively for a while. Obviously the cached content has to be regenerated which takes time and under heavy load it might make your server un-available for a while.
de: TYPO3 hat mehrere Cache (Puffer bzw. Zwischenspeicher) -Systeme: <strong>Datenbank-Cache</strong> Der zentrale Cache ist die Datenbank-Cache-Tabelle, "cache_hash", die gelegentlich ausdrücklich geleert werden muss, wenn verschiedene zentrale Stellen des Systems und/oder seiner Konfiguration geändert wurden. Dieser Cache kann mit "Alle Caches löschen" geleert werden. Danach wird jede neu angeforderte Seite der Website aus der Datenbank neu erzeugt, anstatt sie aus dem Cache auszuliefern. Mit dieser Operation werden auch <em>alle</em> Datenbank-Tabellen, die als (entleerbare) Cache-Tabellen markiert sind, geleert. <strong>PHP-Konfigurationsdateien von Erweiterungen</strong> TYPO3 speichert auch die Konfigurationsdateien der Erweiterungen ("ext_localconf.php" und "ext_tables.php") in einem Cache. Diese Dateien werden von allen installierten Erweiterungen gelesen und aneinandergereiht im Ordner typo3conf/ abgelegt, unter den Namen "temp_CACHED_*.php". Manchmal ist es nötig, diese Dateien zu entfernen, so dass sie von TYPO3 aus den Originalen neu erzeugt werden. Dies löst man über "Konfigurations-Cache löschen" aus. <strong>Hinweis:</strong> Leeren Sie die Caches nicht wahllos, denn jedes Löschen beeinflusst die Leistungsfähigkeit Ihrer Website für eine Weile negativ. Die Seiten im Zwischenspeicher müssen neu aufgebaut werden, was deutlich mehr Zeit kostet, als die Seiten einfach aus dem Cache auszuliefern. Führen Sie also Wartungsarbeiten, die das Leeren der Caches erfordern, nicht gerade zu den Spitzenzeiten der Zugriffe auf Ihre Website durch. Unter schwerer Last könnte Ihr Auftritt sonst eine Weile lang erscheinen, als ob er nicht erreichbar sei.

# pagetree.alttitle
source: The Page Tree
de: Der Seitenbaum

# pagetree.description
source: This is the hierarchical organization of pages in TYPO3. Typically websites are build so they reflect the page structure in the page tree directly in the website navigation.
de: Dies ist die hierarchische Anordnung von Seiten in TYPO3. Typischerweise entspricht der hier sichtbare Seitenbaum direkt der Navigation der Website.

# pagetree.details
source: The page tree works like a file system. Each page is like a directory where you can store files. In TYPO3 you store database records inside of each page. Some of these records, typically called "Content Elements", contains the website content of pages. Other records can be from plugins like a glossary or a guestbook and they are only displayed indirectly by a plugin inserted as a Content Element. Some backend users will see only a part of the page tree for a website. This feature allows the administrator to configure backend users with different responsibilities for maintaining branches of the page tree. <b>Navigating the tree</b> Simply click the +/- buttons to expand and contract the branches of the tree. If you click the page icons you should see a context menu pop up. It will contain options specifically for that page. Clicking the title of a page is another option. It will load the right frame of the Web main module with the selected sub-module. The content shown in the right frame will be related to the page clicked.
de: Der Seitenbaum hat auf den ersten Blick Ähnlichkeit mit einem Dateisystem. Es gibt allerdings einen entscheidenden Unterschied: Ordner in einem Dateisystem können nur andere Ordner oder Dateien enthalten, aber keine <em>Inhalte</em>. Diese sind in den Dateien des Dateisystems enthalten. Aber Dateien können <em>keine</em> anderen Dateien oder Ordner enthalten. Im Seitenbaum existiert diese Trennung nicht: <em>jede</em> Seite des Baums besitzt normalerweise Inhalt(e), kann aber jederzeit auch gleichzeitig die Rolle eines Ordners übernehmen: sie kann Kindseiten haben. Bei TYPO3 werden Seiten und die Inhalte der Seiten überwiegend als Datensätze in einer Datenbank gespeichert (Ausnahmen bilden "Assets", also etwa Bilder, Videos, herunterladbares Material usw). Einige der Datensätze, die "Inhaltselemente", enthalten direkt den lesbaren Inhalt der Seiten. Andere Datensätze stammen aus Plug-Ins, wie etwa einem Glossar oder einem Gästebuch, und werden dann indirekt, mit Hilfe des Plug-Ins, als Inhaltselemente eingefügt. Einige Backend-Benutzer können nur einen Teil des Seitenbaums sehen. Dies Merkmal erlaubt Administratoren, die Backend-Benutzer entsprechend ihrer Verantwortlichkeit für nur bestimmte Zweige des Seitenbaums zu konfigurieren. <strong>Handhabung des Baums</strong> Klicken Sie einfach die Symbole +/-, um Zweige des Baums auf- und zuzuklappen. Ein Klick auf das Seitensymbol öffnet ein Kontextmenü mit einer Reihe von Optionen für die Seite. Ein Klick auf den Titel der Seite zeigt ganz rechts das aktive Modul für die angeklickte Seite.

# _pagetree.seeAlso
source: xMOD_csh_corebe:list_module, More about the Page Tree | http://typo3.org/documentation/document-library/doc_tut_quickstart/Pagetree/ Rendering Page trees [Technical] | http://typo3.org/documentation/document-library/doc_core_api/Rendering_page_trees/ Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_01.gif Clicking Icons or Titles? (Animation) | FILE:EXT:welcome/modsub/ani_06.gif Creating pages (Animation) | FILE:EXT:welcome/modsub/ani_07.gif Moving pages (Animation) | FILE:EXT:welcome/modsub/ani_08.gif
de: xMOD_csh_corebe:list_module, Mehr über den Seitenbaum | http://typo3.org/documentation/document-library/doc_tut_quickstart/Pagetree/ Darstellung von Seitenbäumen [Technisch] | http://typo3.org/documentation/document-library/doc_core_api/Rendering_page_trees/ Benutzung des Seitenbaums (Animation) | FILE:EXT:welcome/modsub/ani_01.gif Symbole oder Titel anklicken? (Animation) | FILE:EXT:welcome/modsub/ani_06.gif Seiten erstellen (Animation) | FILE:EXT:welcome/modsub/ani_07.gif Seiten verschieben (Animation) | FILE:EXT:welcome/modsub/ani_08.gif

# pagetree.image_descr
source: An example of a Page Tree in TYPO3. The page tree is available under any of the Web sub-modules in the menu. Clicking the icon of a page displays a context sensitive menu with options for that particular page. Clicking the title of a page in the page tree will load the right frame with the current submodule. The page id is passed to the module so it displays content related to the page you clicked. Holding the mouse pointer over a page icon for a few seconds will display tool-tip information telling you details about the state of the page. Here a page is access restricted and you will be told which group the access is set for by the tool-tip.
de: Ein Beispiel des Seitenbaums in TYPO3. Der Baum wird in allen Untermodulen von "Web" angezeigt. Ein Klick auf das Seitensymbol öffnet ein Kontextmenü mit den für die Seite verfügbaren Optionen. Ein Klick auf den Seitentitel im Baum aktiviert das Modul ganz rechts. Die ID der Seite wird an das Modul übergeben, so dass es Informationen anzeigt, welche die angeklickte Seite betreffen. Lässt man den Mauszeiger einige Zeit über dem Seitensymbol stehen, erscheint ein Kurzinfo mit Statusinformationen zur Seite. Neben der ID sieht man hier, dass die Seite nur für eine Benutzergruppe sichtbar ist.

# filetree.alttitle
source: The Folder Tree
de: Der Verzeichnisbaum

# filetree.description
source: Shows the directory structure of a mounted path on the webserver. You can browse the folder tree like you are used to browse the file system on your own computer.
de: Zeigt die Ordner- und Dateistruktur eines freigegebenen Pfads des Web-Servers. Der Baum lässt sich wie der Baum des Dateisystems handhaben, das Sie von Ihrem Betriebssystem gewohnt sind.

# filetree.details
source: The Folder Tree is available for any sub-module of the File main module in TYPO3. The File module is like a little web-based FTP-client inside of TYPO3 which allows you to upload, rename, copy, move, delete and edit files inside TYPO3. Most users of TYPO3 doesn't need access to the File module and sub-modules in order to upload images on web-pages. They can do this directly when editing Content Elements. But the File module is useful for maintaining collections of files on the server, for example an image archive or files for download. <b>Navigating the Folder Tree</b> You can expand and contract the folder tree by the +/- icons. Clicking a folder icon will display a pop-up menu with options related to that particular folder. Options include copy/cut/paste, rename, upload etc. Clicking the folder title will load the currently active sub-module in the right frame of the backend. The sub-module will typically show files and folders inside the folder you clicked. <b>Granting access to the Folder Tree</b> The administrator needs to allow backend users to access the File modules and in addition make a file mount available to them before they can use the Folder Tree.
de: Der Verzeichnisbaum wird in jedem Untermodul von "Datei" angezeigt. Das Modul "Datei" in TYPO3 entspricht in etwa einem minimalen, Web-basierten FTP-Klienten. Es erlaubt das Hochladen, Umbenennen, Verschieben, Löschen und Bearbeiten von Dateien innerhalb von TYPO3. Die wenigsten Benutzer von TYPO3 benötigen den Zugriff auf das Modul "Datei" und seine Untermodule, um etwa das eine oder andere Bild auf einer Web-Seite anzuzeigen. Sie können dies direkt während der Eingabe von anderem Inhalt bewerkstelligen. Das Modul "Datei" ist jedoch sehr nützlich zur Organisation größerer Ansammlungen von Dateien, etwa einem Bild-Archiv oder einer Ansammlung von herunterladbaren Dateien. <strong>Navigation im Verzeichnisbaum</strong> Der Baum zeigt nur "Ordner" des Dateisystems und keine "Dateien". Die Ordner des Verzeichnisbaums können durch einfachen Klick auf das Symbol +/- geöffnet und geschlossen werden. Ein Klick auf das Symbol eines Ordners öffnet ein Kontextmenü mit zugehörigen Optionen, wie etwa Kopieren, Ausschneiden, Einfügen, Umbenennen, Hochladen usw. Ein Klick auf den Namen des Ordners aktiviert das aktuelle Modul ganz rechts im Backend. Dort werden dann in der Regel die Dateien und Unterordner des geklickten Ordners sichtbar. <strong>Zugriffsrechte auf den Verzeichnisbaum</strong> Administratoren müssen Backend-Benutzern ausdrücklich den Zugriff auf das Modul "Datei" gestatten und außerdem einen Verzeichnisbaum freigeben, in dem sie arbeiten dürfen, bevor der Benutzer in der Lage ist, das Modul zu benutzen.

# _filetree.seeAlso
source: be_groups:groupMods, be_groups:file_mountpoints, be_users:file_mountpoints, Managing files in TYPO3 | http://typo3.org/documentation/document-library/doc_tut_quickstart/Managing_files_in_TY/ Uploading Files | http://typo3.org/documentation/document-library/doc_tut_quickstart/Uploading_images_to/, Details about file mounts | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/, sys_filemounts, xMOD_csh_corebe:filelist_module
de: be_groups:groupMods, be_groups:file_mountpoints, be_users:file_mountpoints, Dateien in TYPO3 verwalten | http://typo3.org/documentation/document-library/doc_tut_quickstart/Managing_files_in_TY/ Dateien hochladen | http://typo3.org/documentation/document-library/doc_tut_quickstart/Uploading_images_to/, Details über Dateifreigaben | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/, sys_filemounts, xMOD_csh_corebe:filelist_module

# filetree.image_descr
source: The Folder Tree of the "fileadmin/" folder. This is mounted by default for "Admin"-users. Other users will have to have a file mount configured for them first. Clicking the icon of a folder displays the context menu of the folder. If you click the folder title in the Folder Tree you will see the sub-module loaded in the right frame. Here it is the File > Filelist module that will display files and folders inside. Clicking the icon of a file will display a context menu for the file.
de: Der Verzeichnisbaum des Ordners "fileadmin/". Administratoren haben standardmäßig auf ihn Zugriff. Anderen Benutzern muss ein Verzeichnisbaum (normalerweise genügt ein Zweig) ausdrücklich zugewiesen werden. Ein Klick auf das Ordnersymbol öffnet das Kontextmenü. Ein weiterer Klick auf den Namen des Ordners aktiviert das Modul ganz rechts. Hier zeigt das Modul "Datei > Dateiliste" Dateien und Ordner, die sich im angeklickten Ordner befinden. Ein weiterer Klick auf das Symbol einer Datei zeigt ein Kontextmenü für diese Datei an.

# tcatree.collapseAll
source: Collapse All
de: Alle einklappen

# tcatree
source: TYPO3 TCA tree
de: TYPO3-TCA-Baum

# tcatree.expandAll
source: Expand All
de: Alle ausklappen

# tcatree.findItem
source: Find Item
de: Element finden

# tcatree.filter.startsWith
source: starts with
de: beginnt mit

# tcatree.filter.contains
source: contains
de: enthält

# list_module.alttitle
source: The Web>List module
de: Das Modul Web > Liste

# list_module.description
source: Listing records located on a page. From here you can copy/cut/paste records around in the system. You can edit records, access the change history of elements etc.
de: Das Modul führt die Datensätze einer Seite auf. Hier können Datensätze per Ausschneiden/Kopieren/Einfügen im System verschoben werden. Man kann die Datensätze bearbeiten, den Änderungsverlauf der Elemente einsehen usw.

# list_module.details
source: The list module is like the file manager in an Operating System; it provides basic access to all "elements" available in the system. In TYPO3 almost all information is stored in the database and managed after the same principles internally. For instance Content Elements representing page content are database records just like backend users are. The Web>List module allows us to create, modify and delete both kinds of records after the same principles. The Web>List module might not be the best "view" of the content on a page for any situation. For instance if you want to manage website content on a page (Content Elements) you should rather use the "Web>Page" module which is designed to display content elements more optimized. But the List module will always give you access to whatever is on the page in a basic way if no better module is available for management. <b>Single-table mode</b> If you click the tabel title in the listing you will enter single-table mode. In this mode you can select additional fields from the table to show in the listing. Also you will get additional editing facilities, for instance you will be able to edit multiple records at a time and even only certain fields from those records. See the screenshot for more details.
de: Das Modul "Web > Liste" ist vergleichbar mit dem Dateimanager eines Dateisystems; es erlaubt den Zugriff auf alle "Elemente" im System. Fast alle Informationen in TYPO3 sind in einer Datenbank gespeichert und werden intern immer nach den gleichen Prinzipien gehandhabt. So sind z.B. Inhaltselemente, der lesbare Inhalt einer Seite, genauso Datensätze wie Backend-Benutzer Datensätze sind. Das Modul "Web > Liste" erlaubt es, beide Arten von Datensätzen nach dem gleichen Verfahren zu erzeugen, zu ändern oder zu löschen. Das Modul "Web > Liste" ist nicht in jeder Situation die beste Sicht auf den Inhalt von Seiten. Will man etwa Seiteninhalte (Inhaltselemente) bearbeiten, dann ist in der Regel das Modul "Web > Seite" besser geeignet, das dafür ausgelegt ist, die Inhalte übersichtlich zu präsentieren und zur Bearbeitung anzubieten. Aber das Modul "Web > Liste" erlaubt immer den Zugriff auf <em>alle</em> Arten von Datensätzen, zumindest in rudimentärer Form, und kann immer benutzt werden, wenn es kein spezialisierteres Modul zur Bearbeitung gibt. <strong>Modus "einzelne Tabelle"</strong> Klickt man den Titel der Tabelle in der Liste an, gelangt man in den Modus "einzelne Tabelle". In diesem Modus kann ausgewählt werden, welche Felder der Tabelle in der Liste gezeigt werden sollen. Zusätzlich erhält man weitere Bearbeitungsmöglichkeiten, z.B. lassen sich mehrere Datensätze auf einmal bearbeiten oder sogar nur ganz bestimmte Felder dieser Datensätze. Siehe die Abbildungen unten.

# _list_module.seeAlso
source: xMOD_csh_corebe:pagetree, xMOD_csh_corebe:list_module_root, xMOD_csh_corebe:filelist_module, xMOD_csh_corebe:TCEforms Selective Editing | http://typo3.org/documentation/document-library/doc_tut_quickstart/Selective_editing/ The List module ("Inside TYPO3") | http://typo3.org/documentation/document-library/doc_core_inside/List_module/,
de: xMOD_csh_corebe:pagetree, xMOD_csh_corebe:list_module_root, xMOD_csh_corebe:filelist_module, xMOD_csh_corebe:TCEforms Selektives Bearbeiten | http://typo3.org/documentation/document-library/doc_tut_quickstart/Selective_editing/ Das Modul "List" ("Inside TYPO3") | http://typo3.org/documentation/document-library/doc_core_inside/List_module/,
