Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: de

# list_module.image_descr
source: Here the page "Cameras" has been clicked in the page tree and in the right frame the Web>List module shows the contents of the page. Here a single content element (Shop Plugin) is inserted in order to display the other items on the page which are three product records in this case. If you enable "Extended mode" and the "Clipboard" you will get additional buttons in the interface to operate on the records shown here. Also notice how you can click any record icon to get a "Clickmenu" for the element. Here you see the single-table mode active for the "Pagecontent" tabel (Content Elements). In the fieldbox the "Hide" field is selected to be included in the listing. If you click any of the edit icons (marked with red border) you will be able to edit [from left to right] a) all listed fields (here "Header" and "Hide"), b) full record or c) a single field (eg. "Hide") for <u>only</u> the selected records (defined by the checkboxes seen).
de: Hier ist die Seite "Cameras" im Seitenbaum aktiviert, ganz rechts zeigt das Modul "Web > Liste" die Datensätze dieser Seite. Es wurde ein einzelnes Inhaltselement eingefügt (Shop-Plug-In) das indirekt weiteren Inhalt auf der Seite darstellt, im gezeigten Beispiel 3 Produktdatensätze. Aktiviert man "Erweiterte Ansicht" und "Zwischenablage anzeigen", erhält man eine Reihe zusätzlicher Bearbeitungssymbole zur Manipulation der Datensätze (rechts oben und unten). Beachten Sie auch das Kontextmenü, das erscheint, wenn Sie ein Datensatz-Symbol anklicken (links oben). Hier ist der Modus "einzelne Tabelle" für die Tabelle "Seiteninhalt" aktiv (die Inhaltselemente enthält). In der Liste der Tabellen-Felder ist das Feld "Hide" (Verbergen) ausgewählt und wird nun in der Liste oben angezeigt. Wenn Sie eines der (rot markierten) Bearbeitungssymbole anklicken, dann können Sie [von links nach rechts] a) ein einzelnes Feld ("Überschrift"/"Header") b) alle gelisteten Felder ("Überschrift"/"Header" und "Verbergen"/"Hide") c) ein einzelnes Feld ("Verbergen"/"Hide") bearbeiten, jeweils für ALLE Datensätze der Liste.

# list_module_noId.alttitle
source: Web>List module with no ID given
de: Modul Web > Liste ohne übergebene ID

# list_module_noId.description
source: The Web>List module must have a page ID passed to it before it can display any content. Please click a page title in the Page Tree.
de: Das Modul Web > Liste benötigt eine Seiten-ID, damit es Inhalt anzeigen kann. Bitte wählen Sie eine Seite im Seitenbaum.

# list_module_root.alttitle
source: Root of the Page Tree
de: Wurzel des Seitenbaums

# list_module_root.description
source: The root of the Page Tree is having id 0 (zero = no page) and the special circumstance is that records in the page tree root can be accessed and edited <i>only</i> by "Admin" users.
de: Die Wurzel des Seitenbaums hat die ID 0. Dies bewirkt, dass <em>nur</em> Administratoren Datensätze in der Wurzel anlegen und bearbeiten können.

# list_module_root.details
source: Only records from certain database tables are allowed to be created in the page tree root. This includes Backend Users, Backend Groups, File Mount records, Language records etc., and you cannot create Content Elements or Frontend Users in the root of the Page Tree. It also works the other way around; For example you cannot create Backend Users anywhere in the page tree. Usually records that are located in the page tree root are somehow "global" for the whole TYPO3 installation and doesn't make sense inside a specific branch of the page tree.
de: Nur Datensätze ganz bestimmter Tabellen können in der Wurzel des Seitenbaums angelegt werden. Dazu gehören Backend-Benutzer und -Gruppen, Verzeichnisfreigaben, Sprachendatensätze usw. Es lassen sich aber keine Inhaltselemente oder Frontend-Benutzer in der Wurzel anlegen. Andersherum gilt ähnliches, so können Sie etwa Backend-Benutzer nicht irgendwo im Seitenbaum anlegen. Datensätze in der Wurzel des Seitenbaums haben "globale" Bedeutung für die ganze TYPO3-Installation und sind daher irgendwo anders im Seitenbaum nicht sinnvoll.

# _list_module_root.seeAlso
source: xMOD_csh_corebe:list_module The List module ("Inside TYPO3") | http://typo3.org/documentation/document-library/doc_core_inside/List_module/
de: xMOD_csh_corebe:list_module Das Modul "Liste" ("Inside TYPO3") | http://typo3.org/documentation/document-library/doc_core_inside/List_module/

# list_module_root.image_descr
source: Example of records in the page tree root; Backend users, groups, filemounts and website languages. When "Admin"-users wants to create a new record in the page tree root they will see a limited number of record types to create. This reflects which tables are configured to be created in the page tree root.
de: Beispiele für Datensätze in der Wurzel des Seitenbaums: Backend-Benutzer, -Gruppen, Verzeichnisfreigaben und Sprachen der Website. Wenn Administratoren neue Datensätze in der Wurzel anlegen wollen, dann sehen sie eine beschränkte Auswahl an Datensatztypen. Das spiegelt die Tabellen wieder, die in der Wurzel erlaubt sind.

# list_clipboard.alttitle
source: TYPO3 Clipboard
de: TYPO3-Zwischenablage

# list_clipboard.description
source: The clipboard is an internal registry where records and files can be "stored" temporarily. Usually the clipboard is used for copy/cut/paste operations internally of one or more elements.
de: Die Zwischenablage ist eine interne Datenbank, in der Datensätze und Dateien zeitweise "gespeichert" werden können. Normalerweise wird die Zwischenablage zum internen Kopieren/Ausschneiden/Einfügen eines oder mehrerer Elemente verwendet.

# _list_clipboard.seeAlso
source: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filelist_clipboard, Using the clipboard | http://typo3.org/documentation/document-library/doc_tut_quickstart/Using_the_List_modul/ Numeric Clipboard pads | http://typo3.org/documentation/document-library/doc_tut_quickstart/The_numeric_clipboar/ Clipboard details [Technical] | http://typo3.org/documentation/document-library/doc_core_inside/Clipboard/, Accessing clipboard in scripts [Technical] | http://typo3.org/documentation/document-library/doc_core_api/Accessing_the_clipbo/
de: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filelist_clipboard, Verwendung der Zwischenablage | http://typo3.org/documentation/document-library/doc_tut_quickstart/Using_the_List_modul/ Nummerische Zwischenablagen | http://typo3.org/documentation/document-library/doc_tut_quickstart/The_numeric_clipboar/ Details zur Zwischenablage [Technisch] | http://typo3.org/documentation/document-library/doc_core_inside/Clipboard/, Zugriff auf Zwischenablagen in Skripts [Technisch] | http://typo3.org/documentation/document-library/doc_core_api/Accessing_the_clipbo/

# list_clipboard.image_descr
source: Whenever you use the copy/cut/paste functions in the clickmenus you will actually use the clipboard to store the element internally in TYPO3. If you select one of the numeric clipboard pads you will be able to store more than a single element on the clipboard at a time. In the record listings you will then see checkboxes next to the elements by which you can select/deselect elements for the clipboard.
de: Bei jeder Nutzung der Funktionen zum Kopieren/Ausschneiden/Einfügen der Kontextmenüs wird die Zwischenablage zum Speichern der Elemente innerhalb von TYPO3 verwendet. In den Datensatzübersichten finden sich dann Markierungsfelder neben den Elementen, über die Elemente für die Zwischenablage ausgewählt bzw. abgewählt werden können.

# list_searchbox.alttitle
source: Search Box
de: Suchformular

# list_searchbox.description
source: By this search box you can do a free text search in all the listed records. You can also search recursively in sub-pages by selecting a number of levels to search in the selector box to the right of the search field.
de: Mit Hilfe dieses Suchformulars können Sie eine Volltextsuche in allen Datensätzen auf dieser Seite durchführen. Sie können auch rekursiv in Unterseiten suchen, indem Sie im Auswahlfeld zur Rechten die Anzahl der zu durchsuchenden Ebenen auswählen.

# list_options.alttitle
source: List module options
de: Optionen des Moduls "Liste"

# list_options.description
source: Enable additional options like the "Extended view" mode to see additional control buttons for each record in the listing or the "Clipboard" to see the clipboard and its content.
de: Aktivieren Sie weitere Optionen wie den Modus "Erweiterte Ansicht", der Ihnen zusätzliche Bedienelemente für jeden Datensatz anzeigt, oder die "Zwischenablage", um sie und den Inhalt anzuzeigen.

# list_options.image_descr
source: The options checkboxes. Selecting "Extended view" will enable the control buttons in the record lists.
de: Die Markierungsfelder. Durch Auswahl von "Erweiterte Ansicht" werden die Bedienelemente in den Datensatzlisten aktiviert.

# new_regular.alttitle
source: Create new record
de: Neuen Datensatz erstellen

# new_regular.description
source: This list shows the types of records (database tables) you can create on the page. Click a table name to select the type.
de: Diese Liste zeigt die Typen von Datensätzen, die Sie auf der Seite erstellen können. Klicken Sie auf einen Namen, um diesen Typ auszuwählen.

# new_regular.image_descr
source: The selection of records a user can create on this particular page. The selection depends on the users permissions and the page type. For example a SysFolder page type can contain any kind of record while regular pages can contain only some types (like content elements).
de: Auswahl an Datensätzen, die der Benutzer auf dieser Seite erstellen kann. Sie ist abhängig von den Rechten des Benutzers und vom Seitentyp. Zum Beispiel kann ein SysOrdner jeden Typ Datensatz enthalten, während normale Seiten nur einige enthalten können (wie etwa Inhaltselemente).

# new_pages.alttitle
source: Create new page wizard
de: Assistent "Neue Seite erstellen"

# new_pages.description
source: Creating a new page means you have to find a position for it in the page tree. This wizard helps you find this position easily by clicking the flashing arrow pointing to the position you want.
de: Um eine neue Seite zu erstellen, legen Sie zuerst ihre Position im Seitenbaum fest. Dieser Assistent hilft Ihnen dabei: Klicken Sie einfach auf den Pfeil an der Stelle, an der Sie Ihre Seite einfügen möchten.

# _new_pages.seeAlso
source: xMOD_csh_corebe:new_regular, xMOD_csh_corebe:new_ce, How to create a new page | http://typo3.org/documentation/document-library/doc_tut_quickstart/New_page/
de: xMOD_csh_corebe:new_regular, xMOD_csh_corebe:new_ce, Anleitung zum Erstellen einer neuen Seite | http://typo3.org/documentation/document-library/doc_tut_quickstart/New_page/

# new_pages.image_descr
source: Between each page in the tree you find small icons that point out a place for a new page. Select a position by clicking one of these icons. To access the "Create new page wizard" in the first place, just click the link in the Create new record dialog.
de: Zwischen allen Seiten im Seitenbaum finden Sie kleine Symbole, die auf eine mögliche Position für Ihre neue Seite zeigen. Wählen Sie eine Position, indem Sie auf eines dieser Symbole klicken. Um den Assistenten "Neue Seite erstellen" aufzurufen, klicken Sie auf den Link im Dialog "Neuen Datensatz erstellen".

# new_ce.alttitle
source: Create new Content Element Wizard
de: Assistent "Neues Inhaltselement erstellen"

# new_ce.description
source: Content Elements come in many flavors and inserting new content on a page means you have to select the right element type. This wizard helps you to pick a main type of element before you actually begin to enter content.
de: Inhaltselemente gibt es in einer Reihe unterschiedlicher Typen. Das Hinzufügen neuen Inhalts zu einer Seite erfordert daher die Auswahl des richtigen Elementtyps. Dieser Assistent hilft Ihnen dabei. Danach können Sie mit der Eingabe des eigentlichen Inhalts beginnen.

# new_ce.details
source: Selecting an element type here will just preset the content element with certain values. You can always change the values later and if you cannot find exactly the type you need you can just pick the one that comes closest to your need, then adjust the details later.
de: Den Elementtyp, den Sie hier auswählen, können Sie später noch beliebig ändern. Falls Sie also nicht gleich den zutreffenden Typ gefunden haben, können Sie erst denjenigen auswählen, der dem gewünschten am nächsten zu kommen scheint, und die Einzelheiten später anpassen.

# _new_ce.seeAlso
source: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regular, How to create new page content | http://typo3.org/documentation/document-library/doc_tut_quickstart/New_page/ More about Content Element types | http://typo3.org/documentation/document-library/doc_tut_quickstart/Content_element_type/ Adding Custom elements [Technical] | http://typo3.org/documentation/document-library/doc_core_api/Adding_elements_to_t/
de: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regular, Anleitung zum Erstellen neuen Seiteninhalts | http://typo3.org/documentation/document-library/doc_tut_quickstart/New_page/ Mehr über Inhaltselementstypen | http://typo3.org/documentation/document-library/doc_tut_quickstart/Content_element_type/ Benutzerdefinierte Elemente hinzufügen [Technisch] | http://typo3.org/documentation/document-library/doc_core_api/Adding_elements_to_t/

# new_ce.image_descr
source: The Content Element wizard presents a set of preset types. Just select one by clicking its title. After selecting the type you will (often) have to select a position of the element among the other existing Content Elements on the page. You can access the Content Element wizard from the Create new record dialog.
de: Der Assistent für Inhaltselemente führt einen Satz verschiedener Elementtypen auf. Wählen Sie einen durch einen Klick aus. Nach der Auswahl des Typs ist es (oft) erforderlich, für das Element eine Position innerhalb der bereits vorhandenen Elemente auf der Seite festzulegen. Auf den Assistenten "Neues Inhaltselement erstellen" kann über den Dialog "Neuen Datensatz erstellen" zugegriffen werden.

# move_el_pages.alttitle
source: Move page wizard
de: Assistent "Seite verschieben"

# move_el_pages.description
source: By this wizard you can visually re-position (or copy) a page inside TYPO3. The element you move is shown in the top.
de: Mit Hilfe dieses Assistenten können Sie eine Seite innerhalb von TYPO3 über eine grafische Ansicht neu platzieren (oder kopieren). Das jeweilige Element wird im folgenden Formular oben angezeigt.

# move_el_pages.details
source: As an alternative to using the regular Copy/Cut/Paste functions in the clickmenus of records you can also use the move-page wizard. It lets you re-position a page by a visual view of the page tree rather than using the concept of "Paste into" and "Paste after".
de: Alternativ zu den regulären Funktionen Kopieren, Ausschneiden und Einfügen in den Menüs der Datensätze, können Sie auch den Assistenten "Seite verschieben" verwenden. Damit ist es möglich, die Position einer Seite über eine grafische Ansicht des Seitenbaums zu ändern, statt über das "Einfügen in"- bzw. "Einfügen hinter"-Konzept.

# _move_el_pages.seeAlso
source: xMOD_csh_corebe:move_el_cs, xMOD_csh_corebe:new_pages, Moving pages | http://typo3.org/documentation/document-library/doc_tut_quickstart/Move_page/
de: xMOD_csh_corebe:move_el_cs, xMOD_csh_corebe:new_pages, Seiten verschieben | http://typo3.org/documentation/document-library/doc_tut_quickstart/Move_page/

# move_el_pages.image_descr
source: The wizard works like when you create new pages with the wizard; You position the element by the grey arrows. To access the "Move page wizard" you open the clickmenu of the page, select "More options..." and then "Move page". Alternatively you can click the "Move page" icon in the "Extended view" of the Web>List module.
de: Der Assistent funktioniert wie beim Erstellen neuer Seiten: Die Position des Elements wird mit den grauen Pfeilen festgelegt. Um den Assistenten "Seite verschieben" aufzurufen, wählen Sie "Weitere Einstellungen..." und dann "Seite verschieben" aus. Alternativ kann das Symbol "Seite verschieben" in der "Erweiterten Ansicht" des Moduls "Web > Liste" verwendet werden.

# move_el_cs.alttitle
source: Move Content Element Wizard
de: Assistent "Inhaltselement verschieben"

# move_el_cs.description
source: By this wizard you can visually re-position (or copy) a Content Element inside TYPO3. The element you move is shown in the top.
de: Mit Hilfe dieses Assistenten können Sie ein Inhaltselement innerhalb von TYPO3 über eine grafische Ansicht neu platzieren (oder kopieren). Das jeweilige Element wird im folgenden Formular oben angezeigt.

# move_el_cs.details
source: By the grey icons in the content element list you can point out the new position of the content element. If you need to move the element to another page, simply browse the page tree in the bottom of the wizard.
de: Die neue Position des Inhaltselements können Sie über die grauen Pfeile in der Inhaltsübersicht festlegen. Soll das Element auf eine andere Seite verschoben werden, wählen Sie diese einfach im Seitenbaum im unteren Bereich des Assistenten aus.

# move_el_cs.image_descr
source: The wizard works like when you create new Content Elements with the wizard; You position the element by the grey arrows. To access the "Move Content Element Wizard" you click the "Move element" icon in the "Extended view" of the Web>List module.
de: Der Assistent funktioniert wie beim Erstellen neuer Inhaltselemente: Die Position des Elements wird mit den grauen Pfeilen festgelegt. Um den Assistenten "Inhaltselement verschieben" aufzurufen, verwenden Sie das Symbol "Seite verschieben" in der "Erweiterten Ansicht" des Moduls "Web > Liste".

# history_log.alttitle
source: History log
de: Änderungsverlauf

# history_log.description
source: The History log gives you a visual overview of the changes that has happened to the element over the last editing operations. You can roll back changes to any state by using the icons in the interface.
de: Das Verlaufsprotokoll verschafft Ihnen einen grafischen Überblick der Änderungen, die bei den letzten Bearbeitungsvorgängen am Element vorgenommen wurden. Mit Hilfe der Bedienungselemente kann jeder beliebige Stand wiederhergestellt werden.

# history_log.details
source: By default 20 states of history data is preserved in TYPO3 and after a week it expires. The history is very useful for tracking changes to a record since you can see which user did what at which point in time - and roll back any changes you didn't like. If you click the roll-back pencil you will revert the element to the state it had at that particular time. If you click the Info icon you will see in detail what the difference is from current time to this state of the element. <b>Configuring levels and expire times [for admins]</b> If you want to extend the number of history states to above the default 20 you can easily do so using Page TSconfig - meaning that it can even depend on the branch of the page tree where the record is stored! See link below. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
de: Standardmäßig werden die Daten von 20 Bearbeitungsständen im Verlauf vorgehalten. Sie verfallen nach einer Woche. Die Verlaufsfunktion ist sehr nützlich, wenn man Änderungen an einem Datensatz nachvollziehen will, da man sehen kann, wer was zu welchem Zeitpunkt getan hat und diese Änderungen ggf. rückgängigmachen kann. Wählt man den Wiederherstellen-Bleistift aus, so wird das Element auf den Stand zurückgesetzt, den es zu diesem bestimmten Zeitpunkt hatte. Mit Hilfe des Informationssymbols lassen sich die Unterschiede zwischen dem aktuellen und dem ausgewählten Stand detailliert anzeigen. <b>Konfigurieren der Ebenen und Verfallszeiten [für Administratoren]</b> Soll die Anzahl der vorgehaltenen Verlaufszustände auf über 20 erhöht werden, so ist dies einfach über Seiten-TSconfig möglich - d.h. es kann sogar von der Position abhängen, die das Element im Seitenbaum einnimmt. Siehe unteren Link. <b>Hinweis:</b> Sind keine roten und grünen Werte zu sehen, unterstützt der Server, auf dem TYPO3 betrieben wird, die Erstellung von Unterschiedsansichten nicht oder er wurde nicht ordnungsgemäß eingerichtet.

# _history_log.seeAlso
source: xMOD_csh_corebe:history_sum, Configuring History using Page TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/MOD/ Undo/History article | http://typo3.org/documentation/tips-tricks/the-undohistory-feature/
de: xMOD_csh_corebe:history_sum, Konfiguration des Verlaufs mit Seiten-TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/MOD/ Artikel zum Rückgängigmachen/Verlauf | http://typo3.org/documentation/tips-tricks/the-undohistory-feature/

# history_log.image_descr
source: You can access the History/Undo log from the Web>List module when in "Extended view" mode. Alternatively you can access it under "More options..." in the clickmenu of an element. The History log shows visually the changes between each step of editing.
de: Der Änderungsverlauf kann über das Modul "Web > Liste" in der "Erweiterten Ansicht" aufgerufen werden. Alternativ ist er auch im Menü "Weitere Einstellungen" des Kontextmenüs der Elemente zu finden. Der Änderungsverlauf zeigt die bei jeder Bearbeitung vorgenommenen Änderungen grafisch an.

# history_sum.alttitle
source: History Summary
de: Änderungsverlauf Zusammenfassung

# history_sum.description
source: This shows the total difference between the selected state in history to the current state of this element.
de: Zeigt die kumulierten Änderungen zwischen dem gewählten Zeitpunkt im Verlauf und dem aktuellen Stand an.

# history_sum.details
source: You can browse forth and back in the history using the arrow buttons in the upper left corner. You can also save a state in history by the little "disk-icon". Finally you can revert either the whole record to this state in history by the revert icon in the top <em>or</em> you can revert only a single field if you like to by clicking the revert icon displayed for each field. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
de: Mit Hilfe der Pfeilschaltflächen links oben kann man sich innerhalb des Verlaufs vor und zurück bewegen. Darüber hinaus kann mit dem kleinen Diskettensymbol ein Stand innerhalb des Verlaufes gespeichert werden. Schließlich lässt sich entweder der gesamte Datensatz auf den entsprechenden Stand durch Auswahl des Symbols "Zurücksetzen" ganz oben zurücksetzen, oder auch nur ein einzelnes Feld durch Auswahl des Symbols für das Feld. <b>Hinweis:</b> Sind keine roten und grünen Werte zu sehen, unterstützt der Server, auf dem TYPO3 betrieben wird, nicht die Erstellung von Unterschiedsansichten oder er wurde nicht ordnungsgemäß eingerichtet.

# _history_sum.seeAlso
source: xMOD_csh_corebe:history_entry, Undo/History article | http://typo3.org/documentation/tips-tricks/the-undohistory-feature/
de: xMOD_csh_corebe:history_entry, Artikel zum Rückgängigmachen/Verlauf | http://typo3.org/documentation/tips-tricks/the-undohistory-feature/

# history_sum.image_descr
source: The Info view of a state in history shows the "sum" of changes from current time to that point in history for the element.
de: Die Informationsanzeige eines Zeitpunkts innerhalb des Verlaufs zeigt die "Summe" aller Änderungen vom gewählten Zeitpunkt bis zur aktuellen Zeit an.

# history_entry.alttitle
source: Log entry history
de: Verlauf des Protokolleintrags
