Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_*_groups.xlf
Languages: de

# .description
source: This is the Backend administration user groups available for the Backend users. These determine the access credentials for the Backend users.
de: Dies sind die Backend-Benutzergruppen. Sie bestimmen Zugriffsrechte und weitere Einstellungen für zugeordnete Backend-Benutzer.

# .details
source: Groups contain the main permission settings you can set for a backend user. Many users can be members of the same group and thus share permissions. When a user is a member of many groups (including sub-groups) then the permission settings are added together so that the more groups a user is a member of, the more access is granted to him.
de: Backend-Benutzergruppen legen die Grundzugriffsrechte und Einstellungen für zugeordnete Benutzer fest. Viele Benutzer können Mitglied in ein und der selben Gruppe sein und haben dann alle die gleichen Rechte. Einzelnen Benutzern können auch weitere Rechte eingeräumt werden. Eine Gruppe darf andere Gruppen als Untergruppe besitzen, dann werden die Rechte der Untergruppe den Rechten der Obergruppe hinzugefügt. Eine Gruppe "Chef-Redakteure" könnte zum Beispiel eine Untergruppe "Redakteure" haben. Dann wäre ein Mitglied der Gruppe "Chef-Redakteure" automatisch mit allen Rechten eines Redakteurs ausgestattet. Ein Backend-Benutzer kann Mitglied in mehr als einer Gruppe sein. Dann werden die Rechte aller Gruppenmitgliedschaften für diesen Benutzer einfach vereinigt, einschließlich eventueller Untergruppen. Je mehr Gruppen der Benutzer angehört, desto mehr Rechte erhält er.

# _.seeAlso
source: be_users, "Inside TYPO3" about users / groups | http://typo3.org/documentation/document-library/doc_core_inside/Users_and_groups/, How to set up a backend user | http://typo3.org/documentation/document-library/doc_core_inside/Setting_up_a_new_use/, Setting up groups (from "Getting Started") | http://typo3.org/documentation/document-library/doc_tut_quickstart/Groups/
de: be_users, "Inside TYPO3" about users / groups | http://typo3.org/documentation/document-library/doc_core_inside/Users_and_groups/, How to set up a backend user | http://typo3.org/documentation/document-library/doc_core_inside/Setting_up_a_new_use/, Setting up groups (from "Getting Started") | http://typo3.org/documentation/document-library/doc_tut_quickstart/Groups/ (nur auf Englisch verfügbar)

# .image_descr
source: Backend Usergroups are found in the root of the page tree where only "admin" users can edit them. The usergroups with red icons in this image are the ones with Access Lists enabled. The blue are just plain usergroups. This usergroup has Access Lists enabled. In the Access Lists you specify which modules, tables, database fields etc. the group members can access in TYPO3.
de: Backend-Benutzergruppen finden sich in der Wurzel des Seitenbaums, und können nur von "Admin"-Benutzern bearbeitet werden. Die Gruppen mit roten Symbolen in dieser Abbildung sind diejenigen, die ihre Rechte an die Benutzer weitergeben. Blaue Symbole sind einfache Gruppen, die die Rechte nicht weitergeben (für jede Gruppe konfigurierbar). In den Rechten wird festgelegt, auf welche Module, Tabellen, Datenbankfelder usw. von den Gruppenmitgliedern zugegriffen werden darf.

# title.description
source: Name of the Backend usergroup. The name should be descriptive and can always be changed later.
de: Name der Backend-Benutzergruppe. Er sollte beschreibend sein und kann jederzeit geändert werden.

# title.details
source: Backend Usergroups are identified by their "uid" field value (integer) and therefore the title can always be changed. The "uid" can never be changed for a user group.
de: Intern werden die Benutzer über das Feld "uid" der Benutzergruppe zugeordnet. Deshalb ist es jederzeit möglich, den Gruppennamen zu ändern, ohne die Zuordnung zu Benutzern zu verändern. Die "uid" der Gruppe ändert sich dagegen niemals. Überall, wo die Gruppe angezeigt wird, z.B. bei der Zuordnung von Benutzern zu Gruppen, sehen Sie den Gruppennamen statt der "uid".

# title.image_descr
source: The usergroup title is shown in the record lists.
de: Der Gruppenname wird z.B. in Datensatzlisten angezeigt.

# db_mountpoints.description
source: Define page tree root points for the group members.
de: Ausgangspunkte im Seitenbaum für Gruppenmitglieder.

# db_mountpoints.details
source: The page tree in TYPO3 must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a "Database mount" or "DB mount". DB mounts <i>may</i> be inherited by the users which are members of this group. This depends on whether the user is configured to include the mounts set in the member groups. However it's recommended to use backend user groups like this to configure mounts. Especially if they need to be shared among many users.
de: Für jeden Backend-Benutzer müssen eine oder mehrere Freigaben für den Seitenbaum festgelegt werden. Die Benutzer können dann diese Seite(n) und alle Kindseiten bearbeiten. Fügen Sie hier eine oder mehrere solcher Startseiten für die Gruppenmitglieder ein. Diese werden den Benutzern dann jeweils als Wurzelseiten eines Teilbaums präsentiert. Dies wird als "Datenbankfreigabe" oder kurz "DB-Freigabe" bezeichnet. DB-Freigaben <i>können</i> an die Mitglieder der Gruppe vererbt werden. Das hängt davon ab, ob beim Benutzer das Ererben der Freigaben von der Gruppe aktiviert wurde. Es wird jedoch dringend empfohlen, Benutzergruppen zur Verwaltung der Freigaben zu benutzen, anstatt sie für jeden einzelnen Benutzer gesondert einzustellen. Das gilt besonders, wenn mehrere Benutzer gemeinschaftlich an den gleichen Teilbäumen arbeiten.

# db_mountpoints.image_descr
source: Here a page is added as a "DB mount"... ... and in the page tree of member users this will become the starting point for the page tree.
de: Hier wurde eine Seite als "DB-Freigabe" hinzugefügt ... ... und im Seitenbaum der Gruppenmitglieder erscheint diese Seite als Wurzel des Seitenbaums.

# file_mountpoints.description
source: Define startpoints for the file folder tree.
de: Ausgangspunkte im Verzeichnisbaum für Gruppenmitglieder.

# file_mountpoints.details
source: The file folder tree is used by all File-submodules to navigate the file folders on the webserver. If you want users to access the servers file system through TYPO3 they need at least one File Mount (and access to eg. File > Filelist module). You can mount a path in "fileadmin/" relative to the TYPO3 installation or you can mount an absolute path somewhere else on the server (outside webroot!). The last requires that $TYPO3_CONF_VARS[BE][lockRootPath] is defined. The path you mount is defined by the Filemount record you refer to by this field. So a File Mount just points to another record inside of which the details are configured. See screen shots below. "admin" users always have the "fileadmin/" folder mounted by default. Notice; as with 'DB mounts' the file folder mounts may be inherited by the users which are members of this group.
de: Der Verzeichnisbaum wird von allen Dateiuntermodulen benutzt, um auf Verzeichnisse und Dateien des Webservers zuzugreifen. Wenn Sie Benutzern den Zugriff auf das Server-Dateisystem mittels TYPO3 gestatten wollen, müssen Sie mindestens ein "Verzeichnisfreigabe" für diese Benutzer festlegen (außerdem benötigen diese Benutzer Zugang zum Modul Datei > Dateiliste). Wie bei "DB-Freigaben" auch, können die "Verzeichnisfreigaben" von Gruppenmitgliedern geerbt werden, wenn das für den Benutzer aktiviert wurde. Oft reicht es, einen oder mehrere Pfade im Verzeichnis "fileadmin/", relativ zur TYPO3-Installation, freizugeben. Sie können aber auch einen absoluten Pfad zu einem Verzeichnis irgendwo auf dem Server (außerhalb des Web-Bereichs!) freigeben. Dazu muss $TYPO3_CONF_VARS[BE][lockRootPath] (im Installationsprogramm) definiert sein. Der eigentliche Pfad, den Sie freigeben, wird durch die zugehörige "Verzeichnisfreigabe" näher beschrieben, auf die Sie hier verweisen. Die Verzeichnisfreigabe verweist also nur auf einen anderen Datensatz und erst in dem verwiesenen Datensatz werden die Einzelheiten festgelegt. Vergleichen Sie die Abbildungen unten. Für "Admin"-Benutzer wird stets das Verzeichnis "fileadmin/" automatisch freigegeben.

# _file_mountpoints.seeAlso
source: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, More about File Mounts | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/
de: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, Mehr Informationen über Dateifreigaben | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/

# file_mountpoints.image_descr
source: The File Mounts are references to records from the "Filemounts" table. In the Filemount record you define whether the path should be absolute (must be within $TYPO3_CONF_VARS[BE][lockRootPath]) or relative to "fileadmin/". In this case the Filemount points to "fileadmin/user_upload/" This is the page tree of the "admin" user. Notice the folder "user_upload" which is the folder referred to by the File Mount record. This shows the mounted folder as seen by a user who was member of the group. Filemount records are also created in the page tree root.
de: Die Verzeichnisfreigaben sind Verweise auf Datensätze der "Verzeichnisfreigaben"-Tabelle. Im "Verzeichnisfreigabe"-Datensatz legen Sie fest, ob der Pfad absolut sein soll (er muss dann im $TYPO3_CONF_VARS[BE][lockRootPath] Verzeichnis sein), oder ob er relativ zu "fileadmin/" sein soll. Im Bild zeigt die Verzeichnisfreigabe auf "fileadmin/user_upload/". Dies ist der Verzeichnisbaum eines "Admin"-Benutzers. Beachten Sie den Ordner "user_upload/", der in der Verzeichnisfreigabe konfiguriert ist und auf den die Verzeichnisfreigabe verweist. Dies Bild zeigt den freigegebenen Order aus Sicht eines Gruppenmitglieds. Die zur Einbindung verfügbaren Verzeichnisfreigaben werden in der Wurzel des Seitenbaums von "Admin"-Benutzern eingerichtet.

# fileoper_perms.description
source: Select file operation permissions for the group members.
de: Legt Rechte für Dateioperationen für Gruppenmitglieder fest.

# fileoper_perms.details
source: These settings relate to the functions found in the File>Filelist module as well as general upload of files. <strong>Notice</strong> that these settings apply to all members of this group and extend the users permissions accordingly.
de: Diese Einstellungen beziehen sich auf die im Modul Datei>Dateiliste sowie auf das allgemeine Hochladen von Dateien. <strong>Beachten</strong> Sie, dass diese Einstellungen für alle Mitglieder dieser Gruppe gelten und die Benutzerrechte entsprechend erweitern.

# pagetypes_select.description
source: Select which 'Types' of Pages the members may set.
de: Erlaubte Seitentypen für Gruppenmitglieder.

# pagetypes_select.details
source: This option limits the number of valid choices for the user when he is about to select a page type. Choice of Page types (doktype) for a page is associated with a) a special icon for the page, b) permitted tables on the page (see $PAGES_TYPES global variable) and c) if the page is a web page or "system folder" type.
de: Diese Option schränkt die verfügbare Auswahl beim Festlegen des Typs einer Seite ein. Die Auswahl des Typs einer Seite (doktype) beeinflusst a) ein spezielles Symbol für Seiten dieses Typs b) erlaubte Tabellen auf der Seite (siehe die globale Variable $PAGES_TYPES) c) ob die Seite eine normale, sichtbare Web-Seite ist oder vom Typ "Systemorder", der als Behälter für verschiedene Datensätze dient, aber niemals als Web-Seite angezeigt wird.

# pagetypes_select.image_descr
source: The list of typical page types available in a CMS context. Selecting Page types for a usergroup defines which of these options can be selected by member users.
de: Die Liste der typisch in einem CMS-Kontext verfügbaren Seitentypen. Die hier festgelegte Auswahl schränkt alle Gruppenmitglieder entsprechend ein.

# tables_modify.description
source: Select which tables the members may modify.
de: Tabellen, die von Gruppenmitgliedern modifiziert werden dürfen.

# tables_modify.details
source: An important part of setting permissions is to define which database tables a user is allowed to modify. Tables allowed for modification is automatically also allowed for selection and thus you don't need to set tables entered here in the "Tables (listing)" box. <strong>Notice</strong> that this list adds to the fields selected in other member groups of a user.
de: Einer der wichtigsten Aspekte der Zugriffsrechte ist die Festlegung, welche der Datenbanktabellen von Gruppenmitgliedern verändert werden dürfen. Die beiden wichtigsten Tabellen sind "Seiten" (pages) und "Seiteninhalt" (tt_content). Ohne Änderungsrechte an diesen beiden Tabellen kann ein Benutzer keine sichtbaren Inhalte pflegen. Tabellen mit Recht zur Änderung sind automatisch auch sichtbar und müssen nicht nochmals im Feld "Tabellen (Anzeige)" gewählt werden. Wie bei anderen Rechten auch, werden die Rechte hier vereinigt mit den Änderungsrechten anderer Benutzergruppen, denen ein Benutzer angehört.

# tables_modify.image_descr
source: The screen shot above shows how the "Create new record" dialog looks for a user limited to editing only "Page" and "Pagecontent" elements. The two tables are simply added to the list of "Tables (modify)" in the group Access Lists. This is (an example of) the full amount of elements that can be created on the page by the "admin" user for whom there are no restrictions.
de: Hier sieht man den Dialog "Neuer Datensatz" für einen Benutzer, der nur "Seiten" und "Seiteninhalte" ändern darf. Für diese Gruppe ist nur die Änderung der Tabellen "Seiten" und "Seiteninhalte" erlaubt. Aber Änderungsrechte an weiteren Tabellen aus anderen Gruppenzugehörigkeiten eines Benutzers werden respektiert, auch wenn das natürlich hier nicht sichtbar ist. Dies ist der volle Umfang von Seiteninhalten (ein Beispiel), die von einem "Admin"-Benutzer einer Seite hinzugefügt werden können, weil Administratoren keinen Beschränkungen unterliegen.

# tables_select.description
source: Select which tables the members may see in record lists ('modify' tables does not need to be re-entered here!).
de: Tabellen, die von Gruppenmitgliedern eingesehen werden dürfen.

# tables_select.details
source: This determines which tables - in addition to those selected in the "Tables (modify)" box - may be viewed and listed for the member users. He is not able to <em>edit</em> the table - only select the records and view the content. This list is not very important. It's a pretty rare situation that a user may select tables but not modify them.
de: Dieses Feld bestimmt, welche Tabellen - neben denen, die auch verändert werden dürfen - von Gruppenmitgliedern gelistet bzw. gesehen werden dürfen. Benutzer können diese Tabellen nicht verändern, nur deren Datensätze listen und die Inhalte einsehen. Diese Liste ist nicht sonderlich wichtig. Es kommt selten vor, dass Benutzer Tabelleninhalte sehen dürfen, ohne sie zumindest auch ändern zu dürfen. Eine Ausnahme bildet das Modul TemplaVoilà (TV). Die Tabellen "TemplaVoilà-Vorlagenobjekt" und "TemplaVoilà-Datenstruktur" werden normalerweise nur von Administratoren verändert. Damit aber normale Redakteure beim Erzeugen von Seiten Datenstrukturen und Vorlagen auswählen können, muss ihnen hier das Recht zur Ansicht eingeräumt werden.

# non_exclude_fields.description
source: Certain table fields are not available by default. Those fields can be explicitly enabled for the group members here.
de: Viele Tabellenfelder sind per Vorgabe nicht verfügbar. Diese Felder können hier für Gruppenmitglieder ausdrücklich verfügbar gemacht werden.

# non_exclude_fields.details
source: "Allowed excludefields" allows you to detail the permissions granted to tables. By default all these fields are not available to users but must be specifically enabled by being selected here. One application of this is that pages are usually hidden by default and that the hidden field is not available for a user unless he has been granted access by this list of "Allowed excludefields". So the user may create a new page, but cannot un-hide the page - unless of course he has been assigned the "Page: Hide page" exclude field through one of his member groups. Of course it does not make any sense to add fields from tables which are not included in the list of tables allowed to be modified.
de: "Ausdrücklich erlaubte Felder" erlaubt eine feinfühlige Steuerung der Zugriffsrechte auf Tabellen. Standardmäßig stehen diese Felder Benutzern nicht zur Verfügung. Sie müssen explizit aktiviert werden, indem sie hier ausgewählt werden. Eine mögliche Anwendung ist, dass Seiten standardmäßig verborgen werden und das Feld Verbergen nur Benutzern zugänglich ist, für die dies explizit über "Erlaubte Ausnahmefelder" festgelegt wurde. Die Benutzer können also Seiten erstellen, aber nicht sichtbar machen - es sei denn, ihnen wurde über eine Gruppenmitgliedschaft das Ausnahmefeld "Seite: Seite verbergen" zugewiesen. Es ist natürlich nicht sinnvoll, Felder von Tabellen hinzuzufügen, auf die kein Zugriff erlaubt wurde.

# _non_exclude_fields.seeAlso
source: be_groups:inc_access_lists, Examples from "Getting Started" | http://typo3.org/documentation/document-library/doc_tut_quickstart/Groups/
de: be_groups:inc_access_lists, Beispiele aus "Getting Started" | http://typo3.org/documentation/document-library/doc_tut_quickstart/Groups/

# hidden.description
source: Disables a user group.
de: Deaktiviert eine Benutzergruppe.

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them.
de: Deaktiviert man eine Benutzergruppe, so unterbindet dies die Vererbung sämtlicher Eigenschaften der Gruppe an alle ihre Mitglieder.

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
de: Gibt den Host an, von dem aus sich der Benutzer anmelden muss.

# lockToDomain.details
source: A TYPO3 system may host multiple websites on multiple domains. Therefore this option secures that users can login only from a certain host name. Setting this to for example "www.my-domain.com" will require a user to be logged in from that domain if membership of this group should be gained. Otherwise the group will be ignored for the user.
de: Ein TYPO3-System kann mehrere Websites in mehreren Domänen enthalten. Diese Option stellt sicher, dass sich Benutzer nur von einem bestimmten Host anmelden können. Gibt man hier z.B. "www.meine-domäne.com" ein, so muss der Benutzer sich von dieser Domäne aus anmelden, um Mitgliedschaft in dieser Gruppe zu erhalten. Andernfalls wird die Gruppe für diesen Benutzer ignoriert.

# groupMods.description
source: Select available backend modules for the group members.
de: Legt fest, welche Backend-Module von den Gruppenmitgliedern genutzt werden können.

# groupMods.details
source: This determines which 'menu items' are available for the group members. This list of modules is added to any modules selected in other member groups of a user as well as the corresponding field of the user himself.
de: Diese Einstellung legt fest, welche "Menüeinträge" den Gruppenmitgliedern zur Verfügung stehen. Diese Liste von Modulen wird der aus bereits vorhandenen aus anderen Gruppen und dem entsprechenden Feld des Benutzers selbst hinzugefügt.

# _groupMods.seeAlso
source: be_users:userMods, be_groups:inc_access_lists, Backend Interface | http://typo3.org/documentation/document-library/doc_core_inside/Backend_interface/
de: be_users:userMods, be_groups:inc_access_lists, Backend-Oberfläche| http://typo3.org/documentation/document-library/doc_core_inside/Backend_interface/

# groupMods.image_descr
source: The Backend Modules available for a user is reflected in the menu items of the backend. For most regular users only modules in the Web and File main modules are enabled. Typically "Web > Page" is used for editing of page content. This is the assignment of Backend Modules to the user from the screen shot above. All four Web sub-modules and the two User sub-modules are configured here. However the File > Filelist module must have been configured for another member group of this user (or inside the user profile itself which is also possible). The Help modules are all accessible by default and does not require explicit access.
de: Die einem Benutzer zur Verfügung stehenden Backend-Module spiegeln sich in den Menüeinträgen des Backends wieder. Bei den meisten Benutzern sind nur Module der Hauptmodule Web und Datei aktiviert. Gemeinhin wird "Web > Seite" zur Bearbeitung von Seiteninhalten verwendet. Hierbei handelt es sich um die Zuweisung von Backend-Modulen zum Benutzer aus dem obigen Bildschirmfoto. Es sind alle vier Web-Untermodule und die beiden Benutzer-Untermodule eingerichtet. Das Modul "Datei > Dateiliste" muss jedoch in einer anderen Gruppe konfiguriert worden sein, in der dieser Benutzer Mitglied ist (oder im Profil des Benutzers selbst). Zugriff auf die Hilfe-Module ist standardmäßig immer aktiviert und muss nicht explizit aktiviert werden.

# inc_access_lists.description
source: Select whether the Access Lists for Page type, Tables, Module and Allowed excludefield are enabled for this group.
de: Legt fest, ob die Zugriffslisten für Seitenart, Tabellen, Module und erlaubte Ausnahmefelder für diese Gruppe aktiv sind.

# inc_access_lists.details
source: If this option is disabled the Access Lists cannot be configured for the group. When Access Lists are disabled the icon for the group is blue while it is red when Access Lists are enabled.
de: Ist diese Option deaktiviert, so können für diese Gruppe keine Zugriffslisten konfiguriert werden. Wenn die Zugriffslisten deaktiviert, ist das Symbol für die Gruppe blau, sonst rot.

# description.description
source: Enter a short description of the user group, what it is for and who should be members. This is for internal use only.
de: Geben Sie eine Kurzbeschreibung der Benutzergruppe ein, aus der sich erkennen lässt, wozu sie dient und wer Mitglied sein sollte. Nur für internen Gebrauch.

# TSconfig.description
source: User TSconfig: Additional configuration through TypoScript style values (Advanced).
de: Benutzer-TSconfig: Erweiterte Konfiguration über Werte im TypoScript-Stil (für Fortgeschrittene).
