Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_pages.xlf
Languages: de

# .description
source: A 'Page' record usually represents a webpage in TYPO3. All pages have an id-number by which they can be linked and referenced. The 'Page' record does not itself contain the content of the page - for this purpose you should create 'Page content' records (Content Elements).
de: Ein Datensatz "Seite" repräsentiert üblicherweise eine Webseite in TYPO3. Alle Seiten haben eine ID-Nummer, über die sie verlinkt und referenziert werden können. Ein Seitendatensatz enthält nicht selbst den Inhalt der Seite - für diesen Zweck sollten Sie "Seiteninhalte" erstellen.

# .details
source: The pages table is the very backbone in TYPO3. All records editable by the mainstream modules in TYPO3 must 'belong' to a page. It's exactly like files and folders on your computers harddrive. <b>The page tree</b> The pages are organized in a tree structure which is not only a very handy way of organizing in general but also a optimal reflection of how you should organize the pages on your website. And thus you'll normally find that the page tree is a reflection of the website navigation itself. <p>uid, pid and the pagetree root</b> Technically all database elements has a field 'uid' which is a unique identification number. Further they must have a field 'pid' which holds the uid-number of the page (page id) to which they belong. If the 'pid' field is zero the record is found in the so called 'root'. Only administrators are allowed access to the root and furthermore table records must be configured to either belonging to a page or being found in the root. <b>Storage of database records</b> Depending on the 'Type' of the page, it may also represent a general storage for database elements in TYPO3. In that case it is not necessarily available as a webpage but only internally in the page tree as a place to store items such as users, subscriptions etc. Such pages are typically of the type "SysFolder".
de: Die Seitentabelle ist das Rückgrat von TYPO3. Alle Datensätze der Standardmodule müssen zu einer Seite "gehören". Dies entspricht in etwa Dateien und Ordnern auf der Festplatte Ihres PCs. Mit einem wesentlichen Unterschied: Ordner der Festplatte sind <b>nur</b> Behälter für Dateien. Aber "Seiten" im Web und TYPO3 sind gleichzeitig "Dateien" <b>und</b> "Ordner". Jede beliebige Seite kann Unterseiten besitzen. <b>Der Seitenbaum</b> Die Seiten sind in einer Baumstruktur angeordnet, was nicht nur ein handlicher Weg der Organisation ganz allgemein ist, sondern auch der Art und Weise entspricht, wie Sie die Seiten Ihrer Website anordnen sollten. Daher entspricht der Seitenbaum üblicherweise auch der Website-Navigation. <b>uid, pid und die Wurzel des Baums</b> Technisch gesehen haben alle Daten(bank)elemente ein Feld "uid", das eine eindeutige Identifikation enthält (eine Zahl, die von TYPO3 vollautomatisch erzeugt und verwaltet wird und die Sie praktisch nie zu Gesicht bekommen). Zusätzlich müssen alle Datenelemente ein Feld "pid" besitzen, welches die "uid" der Seite ("page id") enthält, zu der sie gehören (TYPO3 handhabt das automatisch). Falls das Feld "pid" gleich 0 ist, so befindet sich der Datensatz in der Wurzel ("root") des Baums. Nur Administratoren ist der Zugriff auf die Wurzel gestattet und Tabelleneinträge müssen entweder einer Seite angehören oder der Wurzel. <b>Speichern von Datensätzen</b> In Abhängigkeit vom "Typ" der Seite kann eine Seite auch einen allgemeinen Speicher für beliebige Daten(bank)objekte in TYPO3 darstellen. In diesem Fall ist sie nicht zwangsläufig als Web-Seite verfügbar, sondern nur intern im Seitenbaum als Speicherort für Objekte wie Benutzer, Abonnnements, Domänen usw. Solche Seiten haben in der Regel den Typ "SysOrdner".

# _.seeAlso
source: xMOD_csh_corebe:pagetree, tt_content, About pages | http://typo3.org/documentation/document-library/doc_tut_quickstart/Pagetree/
de: xMOD_csh_corebe:pagetree, tt_content, Über Seiten | http://typo3.org/documentation/document-library/doc_tut_quickstart/Pagetree/

# .image_descr
source: The most basic fields of a page is the hidden flag, the type of page ("doktype") and the page title. Other fields are also available but typically added by extensions in TYPO3. Pages are arranged in a page tree in TYPO3. The page from the editing form in the previous screenshot was the "Intro" page from this page tree. As you can see it belongs in the root of the page tree and has a number of "child" pages under it.
de: Die wichtigsten Felder einer "Seite" sind: die Markierung "verborgen" ("hidden"), der Typ der Seite ("doktype") und der Seitentitel. Es können weitere Felder existieren, die aber typischerweise durch TYPO3- Erweiterungen hinzugefügt werden. Seiten sind in TYPO3 in einem Baum organisiert. Die gezeigte Seite des Bearbeitungsformulars im Bild ist die Seite "Intro" des Seitenbaums. Wie Sie sehen können ist sie der Wurzel des Baums zugeordnet und besitzt eine Reihe von "Kindseiten".

# title.description
source: Enter the title of the page or folder. You must enter a page title. The field is required.
de: Geben Sie den Titel der Seite ein! Dieses Feld ist ein Pflichtfeld.

# title.details
source: The page title is used to represent the page visually in the system, for example in the page tree. Also the page title is used by default for navigation links on webpages. You can always change a page title without affecting links to a page. This is because pages are always referenced by their "uid" number, not their title. You can use any characters in the page title.
de: Der Seitentitel repräsentiert die Seite im System, z.B. im Seitenbaum. Außerdem wird der Titel als Standardtext für die Navigation von Seite zu Seite verwendet. Der Titel kann jederzeit geändert werden, ohne die Navigation selbst zu verändern. Intern werden die Seiten über ihre "uid" referenziert, statt über den Titel, der geänderte Titel wird aber überall sofort sichtbar. In diesem Feld sind beliebige Zeichen erlaubt, Sie sollten aber einen kurzen, prägnanten und möglichst eindeutigen Titel eingeben.

# title.image_descr
source: The field for the page title has a little "required" icon next to it; You must supply a page title and you cannot save the new page unless you enter a title for it.
de: Das Feld für den Titel der Seite ist mit einem kleinen "Pflichtfeld"-Symbol ausgezeichnet: Sie <b>müssen</b> einen Seitentitel eingeben, sonst können Sie die Seite nicht speichern! Möglichst kurz, prägnant und eindeutig.

# doktype.description
source: Select the page type. This affects whether the page represents a visible webpage or is used for other purposes.
de: Wählen Sie den Seitentyp aus. Dies hat Einfluss darauf, ob die Seite als normale Web-Seite dargestellt oder für andere Zwecke genutzt wird.

# doktype.details
source: The 'Standard' type represents a webpage. 'SysFolder' represents a non-webpage - a folder acting as a storage for records of your choice. 'Recycler' is a garbage bin. <b>Notice:</b> Each type usually has a specific icon attached. Also certain types may not be available for a user (so you may experience that some of the options are not available for you!). And finally each type is configured to allow only certain table records in the page (SysFolder will allow any record if you have any problems). <b>$PAGES_TYPES [Technical]</b> The restrictions that apply to each page type is defined in the global array $PAGES_TYPES. Here it is defined which tables are allowed on a page. When extensions adds tables to TYPO3 they may need to register their tables in $PAGES_TYPES so they can be created on standard pages.
de: "Standard" repräsentiert eine normale Web-Seite. "SysOrdner" ist eine Seite, die niemals als Web-Seite angezeigt wird, sondern als Behälter ("Container") für beliebige Daten dient. "Papierkorb". Seiten und Datensätze im Papierkorb werden auf den Web-Seiten nicht angezeigt. Sie sind jedoch noch nicht endgültig gelöscht, sondern können zurück an eine geeignete Stelle verschoben werden. <b>Hinweis:</b> Jedem Typ ist ein spezielles Symbol zugewiesen. Manche Typen stehen einem Anwender möglicherweise auch nicht zur Verfügung (Sie werden eventuell feststellen, dass einige Optionen nicht zur Auswahl stehen!). Beachten Sie außerdem, dass jeder Seitentyp nur bestimmte Inhalte/Datensätze erlaubt. (Im Zweifel erlaubt "SysOrdner" beliebige Daten.) <b>[Technisch] $PAGES_TYPES</b> Die Einschränkungen zu jedem Seitentyp sind im globalen Array $PAGES_TYPES definiert. Dort ist festgelegt, welche Tabellen auf den Seiten eines Typs erlaubt sind. Wenn Erweiterungen neue Tabellen zu TYPO3 hinzufügen ist es eventuell erforderlich, dass sie ihre Tabellen in $PAGES_TYPES registrieren, so dass Daten für diese Tabellen auf normalen Seiten hinzugefügt werden können.

# _doktype.seeAlso
source: be_groups:pagetypes_select, About $PAGES_TYPES | http://typo3.org/documentation/document-library/doc_core_api/PAGES_TYPES/
de: be_groups:pagetypes_select, Über $PAGES_TYPES | http://typo3.org/documentation/document-library/doc_core_api/PAGES_TYPES/

# doktype.image_descr
source: This snippet of the page tree shows regular pages which usually have the yellow icons in top of this screenshot. You also see a Garbage bin page. Any records stored in a garbage bin should be regarded as waste and therefore not shown on the website etc. Finally the gray folders are "SysFolders". They cannot be viewed as regular webpages but serve as storage pages for database records of some kind.
de: Dieser Ausschnitt des Seitenbaums zeigt einige normale Seiten (schwach gelbe Symbole, im oberen Teil). Der Papierkorb ("Garbage") mit seinem besonderen Symbol ist ebenfalls sichtbar. Die Seiten im Papierkorb werden auf der Website nicht angezeigt und sind Kandidaten für eine endgültige Löschung. Im unteren Teil sehen Sie (graue) "SysOrdner". Diese werden ebenfalls niemals als Web-Seiten angezeigt, sondern ermöglichen die Speicherung beliebiger Daten.

# TSconfig.description
source: Page TypoScript configuration.
de: Spezielle TypoScript-Konfiguration dieser Seite.

# TSconfig.details
source: Basically 'TypoScript' is a concept for entering values in a tree-structure. This is known especially in relation to creating templates for TYPO3 websites. However the same principle for entering the hierarchy of values is used here to configure various features in relation to the backend, functions in modules, the Rich Text Editor etc. The resulting 'TSconfig' for a page is actually an accumulation of all 'TSconfig' values from the root of the page tree and outwards to the current page. And thus all subpages are affected as well. A print of the page TSconfig is available from the 'Page TSconfig' menu in the 'Web>Info' module (requires the extension "info_pagetsconfig" to be installed).
de: Grundsätzlich ist "TypoScript" ein Konzept zur Konfiguration von Werten in einer Baumstruktur. Es wird vor allem für die Konfiguration von TYPO3-Websites verwendet. Hier wird das gleiche Prinzip der Eingabe von Werten in einer Hierarchie verwendet, um verschiedene Eigenschaften in Bezug auf das Backend, Funktionen in Modulen, dem "Rich Text Editor" usw. einzustellen. Das endgültige "TSconfig" für eine Seite ist die Summe aller "TSconfig"-Werte von der Wurzel des Seitenbaums bis zur aktuellen Seite. So werden alle Kindseiten der aktuellen Seite ebenfalls beeinflusst, sie erben die Konfiguration ihrer Vaterseite. Eine Darstellung des wirksamen Seiten-"TSconfig" können Sie über das Menü "Seiten-TSconfig" im Modul "Web > Info" einsehen (wenn die Erweiterung "info_pagetsconfig" installiert ist).

# TSconfig.syntax
source: Basic TypoScript syntax <em>without</em> 'Conditions' and 'Constants'. It's recommended that only admin-users are allowed access to this field!
de: Einfache TypoScript-Syntax <em>ohne</em> "Konditionen" und "Konstanten". Es wird dringend empfohlen, dass nur erfahrene Administratoren Zugriff auf dieses Feld erhalten!

# _TSconfig.seeAlso
source: _MOD_web_info:tsconfig_hierarchy, More about Page TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/Page_TSconfig/
de: _MOD_web_info:tsconfig_hierarchy, Mehr über Seiten-TSconfig | http://typo3.org/documentation/document-library/doc_core_tsconfig/Page_TSconfig/

# TSconfig.image_descr
source: Page TSconfig customizing the Rich Text Editors behaviour in this branch of the page tree. The cool thing about Page TSconfig is that the configuration is specific for that page and subpages since the configuration settings are inherited down the page tree.
de: Seiten-TSconfig zur Anpassung des Rich-Text-Editor-Verhaltens in diesem Zweig des Seitenbaums. Eine pfiffige Eigenschaft des Seiten-TSconfig ist, dass die Konfiguration für die aktuelle Seite und alle Kindseiten gilt: Kindseiten erben die Konfiguration von Vaterseiten.

# php_tree_stop.description
source: Stops backend rendering of the page tree in navigation and lists.
de: Stoppt die Darstellung des Seitenbaums in der Navigation und Listen.

# php_tree_stop.details
source: If you set this flag the page tree in the navigation frame will not expand that branch. Rather you will see a red "+" which indicates that the tree stopped here due to this flag being set. The point with this flag is to prevent descendence into a branch that might have an unusual amount of subpages (hundreds). You can click the red "+" and the page will become a temporary mount point in the navigation frame.
de: Ist dieser Schalter aktiviert, ist im Seitenbaum im Navigations-Frame dieser Ast nicht mehr aufgeklappt darstellbar. Stattdessen ist ein rotes "+" zu sehen, das darauf hinweist, dass dieser Schalter aktiviert ist. Der Sinn der Sache ist, zu verhindern, dass Äste mit ungewöhnlich vielen Kindseiten (hunderte) angezeigt werden und dabei ungewöhlich viel Zeit und Resourcen verbrauchen. Wird das rote "+" Zeichen angeklickt, wird die Seite als "Temporärer Einstiegspunkt" im Navigations-Frame an Stelle des ganzen Seitenbaums dargestellt.

# php_tree_stop.image_descr
source: Here the "Stop page tree" flag is set. It is a palette field under "TSconfig". In the pagetree the setting is reflected with the red "+" and it is not possible to expand that branch of the tree. If you click the red "+" you will get the page mounted temporarily in the navigation frame.
de: Hier ist der Schalter "Seitenbaum stoppen" gesetzt. Er bfindet sich unterhalb des Feldes "TSconfig". Im Seitenbaum ist der gesetzte Schalter sichtbar durch das rote "+" und der Ast des Baums kann nicht mehr aufgeklappt werden. Nach Anklicken des roten "+" wird der Ast als "Temporärer Einstiegspunkt" an Stelle des Seitenbaums dargestellt.

# storage_pid.description
source: A General Storage Folder is meant to be a global page for storage of general database elements of a website. That could be for templates, frontend users etc. which does not really relate to a single page but more to the whole site.
de: Legen Sie fest, welche "Allgemeinen Datensatzsammlungen" von dieser Seite verwendet werden sollen.

# storage_pid.details
source: It is recommended that applications support "General Storage pages" so that they look for records in the sites general storage folder by default and that they should be specifically configured to look elsewhere. A General Record Storage Page is typically a page of the "SysFolder" type.
de: Eine "Allgemeine Datensatzsammlung" ist eine globale Seite zur Aufbewahrung von Daten aller Art. Das könnten Templates sein, oder Frontend Benutzer usw., die eher zur gesamten Website gehören, als zu einer einzelnen Seite. Es wird dringend empfohlen, dass Anwendungen das Konzept der "Allgemeinen Datensatzsammlung" unterstützen, so dass sie standardmäßig ihre Daten dort suchen und nur durch spezielle Konfiguration dazu gebracht werden, anderswo danach zu suchen. Seiten, die als "Allgemeine Datensatzsammlung" dienen, sind oft vom Typ "SysOrdner".

# _storage_pid.seeAlso
source: The Storage Folder | http://typo3.org/documentation/document-library/doc_tut_ftb1/The_Storage_Folder/
de: Der Speicherordner | http://typo3.org/documentation/document-library/doc_tut_ftb1/The_Storage_Folder/

# editlock.description
source: If set, non-Admin users cannot edit the page properties or any records on the page (except subpages). They cannot create new records or pages on the page either.
de: Bewirkt, dass Benutzer, die nicht Administratoren sind, weder die Seiteneigenschaften noch Seiteninhalte bearbeiten können. Sie können auch keine neuen Seiteninhalte und keine neuen Kindseiten erzeugen. Existierende Kindseiten können sie aber immer noch bearbeiten.

# fe_login_mode.description
source: The Login Mode disables the ability to "be logged in" at this page.
de: Über den Anmeldemodus kann für diese Seite die Möglichkeit deaktiviert werden, "angemeldet zu sein".

# fe_login_mode.details
source: Usually, if the user logs into TYPO3's Frontend the session gets carried around and for each page that user visits, it's calculated whether there is content that the user can see. By disabling the login, this check does not happen anymore. So the content is the same for all states whether logged in or not or for different FE user groups. This again results in being able to send cache headers.
de: Wenn sich ein Benutzer am TYPO3-Frontend anmeldet, wird die Sitzung normalerweise stets "mitgenommen" und bei jeder Seite überprüft, welche Inhalte der Benutzer sehen kann. Bei Deaktivierung der Anmeldung findet diese Überprüfung nicht mehr statt. Die Inhalte sind dann unabhängig von Anmeldestatus und Mitgliedschaft in verschiedenen Benutzergruppen. Dies ermöglicht das Senden zwischengespeicherter Header.
