Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: de

# history_entry.description
source: This view displays the changes made to the content element for the log entry you clicked. The red and green values in the text shows the previous/new values of the record.
de: In dieser Ansicht werden die an einem Inhaltselement vorgenommenen Änderungen für den ausgewählten Protokolleintrag angezeigt. Die rot und grün markierten Textteile zeigen die vorherigen und neuen Werte des Datensatzes an.

# history_entry.details
source: <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
de: <b>Hinweis:</b> Sind keine roten und grünen Werte zu sehen, unterstützt der Server, auf dem TYPO3 betrieben wird, nicht die Erstellung von Unterschiedsansichten oder er wurde nicht ordnungsgemäß eingerichtet.

# TCEforms.alttitle
source: TYPO3 Editing Forms
de: TYPO3-Bearbeitungs-Formulare

# TCEforms.description
source: All records in TYPO3 is edited through a standardized form interface like the one you see here. No matter if you edit pages, content elements, guestbook items or user records you will use the same familiar interface.
de: Alle Datensätze in TYPO3 werden mit einer einheitlichen Oberfläche wie der, die Sie hier sehen, bearbeitet. Egal ob Sie Seiten, Inhaltselemente, Gästebuch-Einträge oder Benutzer-Daten bearbeiten, können Sie die gleiche, vertraute Oberfläche verwenden.

# TCEforms.details
source: <b>Saving content</b> Just press one of the save-buttons in the top of bottom of the form. There are some variants allowing you to "Save and close document" or "Save document and View page". The latter will save the document and open a new window where the affected page is shown (be sure to disable pop-up blockers for this function!) <b>Secondary options (palettes)</b> Fields in the editing forms are prioritized so that certain fields of generally lesser interest is moved to a so called "palette". By default it means that the fields appears in the top frame when you enter the field to which the secondary fields are associated. But you can also enable the fields to be shown in the main form which is more convenient some times - just select the "Show secondary options" checkbox (bottom of page). <b>Editing multiple records at a time</b> From the Web>List module you can activate editing of multiple records at a time. This is done when you list a single table and enable multiple columns for display (see Web>List module for details) - then icons will link you to a form with multiple records displayed, possibly with only certain fields available for editing. <b>Frontend Editing</b> Another way of editing records in TYPO3 is using the website frontend. Depending on your user credentials you will see small pencil icons in the frontend. When you click these you will be guided to a form where you can also change the content. <b>Customize the forms [for Admins]</b> You can customize the TCEforms in many ways using User TSconfig and Page TSconfig. See links below.
de: <b>Inhalt speichern</b> Klicken Sie einfach auf eine der Speichern-Schaltflächen oben im Formular. Sie können das "Dokument speichern", das "Dokument speichern und schließen" oder das "Dokument speichern und Web-Seite anzeigen". Letztere Funktion speichert das Dokument und ruft ein neues Fenster auf, in dem die Seite angezeigt wird. (Stellen Sie sicher, dass Sie Ihren Popup-Blocker deaktiviert haben, falls Sie einen verwenden und diese Funktion nutzen möchten.) <b>Zweite Optionspalette</b> Die Felder der Formulare haben unterschiedliche Prioritäten, so dass Felder, die allgemein von geringerem Interesse sind, in eine "Optionspalette" ausgelagert werden. Das bedeutet, dass diese Felder nur erscheinen, wenn Sie das jeweilige Symbol für "Weitere Optionen..." anklicken. Sie können aber auch die Option "Zweite Optionspalette anzeigen" unten auf der Seite aktivieren, so dass die Felder immer angezeigt werden. Das kann manchmal komfortabler sein. <b>Mehrere Datensätze gleichzeitig bearbeiten</b> Im Modul "Web > Liste" können Sie das gleichzeitige Bearbeiten mehrerer Datensätze aktivieren. Wählen Sie dazu eine Tabelle aus ("Nur diese Tabelle anzeigen") und aktivieren Sie eine oder mehrere Felder zur Ansicht ("Felder setzen"; Details siehe "Web > Liste"). Sie sehen dann über jeder Felderspalte Symbole, mit denen Sie den Wert dieses Feldes in den Datensätzen der Seite bearbeiten können. Möglicherweise ist das gewählte Feld nicht für alle Datensätze verfügbar. <b>Frontend-Bearbeitung</b> Eine andere Möglichkeit, Datensätze in TYPO3 zu bearbeiten, ist die Benutzung des Website-Frontends. Abhängig von Ihren Benutzerrechten sehen Sie, wenn Sie angemeldet sind, kleine Stiftsymbole im Frontend. Wenn Sie auf diese klicken, erscheint ein Formular, mit dessen Hilfe Sie den jeweiligen Inhalt bearbeiten können. <b>Individualisierung der Formulare [für Administratoren]</b> Sie können die Formulare (TCEForms) individualisieren, indem Sie Benutzer-TSconfig oder Seiten-TSconfig verwenden. Siehe nachstehende Links.

# _TCEforms.seeAlso
source: Editing pages | http://typo3.org/documentation/document-library/doc_tut_quickstart/Edit_page/ Frontend Editing | http://typo3.org/documentation/document-library/doc_tut_quickstart/Frontend_editing/, xMOD_csh_corebe:list_module User TSconfig related to forms | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/ Page TSconfig related to forms | http://typo3.org/documentation/document-library/doc_core_tsconfig/RTE/ Linking to the edit forms [Technical] | http://typo3.org/documentation/document-library/doc_core_api/Links_to_edit_record/
de: Seiten bearbeiten | http://typo3.org/documentation/document-library/doc_tut_quickstart/Edit_page/ Bearbeitung im Frontend | http://typo3.org/documentation/document-library/doc_tut_quickstart/Frontend_editing/, xMOD_csh_corebe:list_module Benutzer-TSconfig für Formulare | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/ Seiten-TSconfig für Formulare | http://typo3.org/documentation/document-library/doc_core_tsconfig/RTE/ Verlinken auf Bearbeitungsformulare [Technisch] | http://typo3.org/documentation/document-library/doc_core_api/Links_to_edit_record/

# TCEforms.image_descr
source: This is how a typical record is edited in TYPO3. The form display is standardized for all types of records. You will always see the same buttons in the top for saving or closing. In the blue bar you will see the type of record (table name) and the ID number that each record has (uid). Here the record is a page with ID "2" and the title "Content Elements". In the bottom of the editing page you will find additional options for the interface. You can select "Show field descriptions" if you want a small text shown for each element that explains what it is used for. Also "Show secondary options" is very important since it will show additional form fields in the main forms (from "palettes"). Here "Show secondary options (palettes)" is enabled. The result is that a number of additional fields of "lower priority" is shown under the "Pagetitle" field. The "additional fields" from the example above is located in a so called "palette" which is normally shown in the top frame when "Show secondary options" is disabled. Whether you prefer the one or the other solution is your choice. This is an example of three Content Elements being edited at the same time. You can edit multiple records by using the links from the Web>List module in single-table mode. Notice that not only are three records shown at the same time - it is also a limited number of fields shown for editing, here "Header" and "Hide". You can combine this almost any way you like. This is of course very useful if you need to edit only the header of multiple records.
de: So wird ein Datensatz in TYPO3 typischerweise bearbeitet. Das Bearbeitungsformular ist für alle Typen von Datensätzen einheitlich. Sie haben im oberen Bereich immer die gleichen Schaltflächen zum Speichern oder Schließen zur Verfügung. Darunter sehen Sie den Typ des jeweiligen Datensatzes, den Sie gerade bearbeiten, und seine ID (uid). Hier handelt es sich um eine Seite mit der ID "2" und dem Titel "Content Elements". Unten auf jeder Seite finden Sie zusätzliche Optionen. Im Bild sehen Sie die Option "Feldbeschreibungen anzeigen", die Ihnen einen kurzen Text an jedem Feld anzeigt und seine Funktion erklärt. (In neueren Versionen von TYPO3 nutzen Sie statt dessen die enthaltene kontextabhängige Hilfe.) Die Option "Zweite Optionspalette anzeigen" ist wichtig, denn mit Ihr können Sie zusätzliche Formularfelder anzeigen, die zur besseren Übersicht normalerweise ausgeblendet sind. Hier ist die Option "Zweite Optionspalette anzeigen" aktiviert. Deshalb werden zusätzliche, weniger wichtige Felder unter dem Seitentitel angezeigt. Die zusätzlichen Felder aus dem Beispiel oberhalb befinden sich in der sogenannten "Palette", die normalerweise unter dem jeweiligen Feld, zu dem die Palette gehört, angezeigt wird. (Im Bild - aus einer älteren TYPO3-Version - wurde die Palette im oberen Rahmen angezeigt.) Dieses Beispiel zeigt, wie drei Inhaltselemente gleichzeitig bearbeitet werden. Sie können mehrere Elemente gleichzeitig bearbeiten, indem Sie im Modul "Web > Liste" eine einzelne Tabelle auswählen. Beachten Sie auch, dass nicht einfach drei vollständige Elemente gleichzeitig gezeigt werden, sondern dass Sie die Auswahl der zu bearbeitenden Felder festlegen können. Hier wurden "Überschrift" und "Verbergen" gewählt. Sie können eine beliebige Auswahl treffen, was sehr nützlich ist, wenn Sie etwa nur die Überschriften mehrerer Datensätze bearbeiten möchten.

# TCEforms_docSelector.alttitle
source: Document Selector
de: Geöffnete Dokumente

# TCEforms_docSelector.description
source: Here you can switch between "open documents" in TYPO3.
de: Hier können Sie zwischen Ihren geöffneten Dokumenten umschalten.

# TCEforms_cacheSelector.alttitle
source: Forms Menu
de: Formularmenü

# TCEforms_cacheSelector.description
source: This is alternative ways to select "Save"/"Close" operations for records. You can also select "clear-cache" operations if you are allowed access to them.
de: Hierbei handelt es sich um eine alternative Methode zur Auswahl der Vorgänge "Speichern" und "Schließen" für Datensätze. Sind entsprechende Rechte vorhanden, können auch Befehle zum Löschen des Cache ausgewählt werden.

# TCEforms_cacheSelector.details
source: Clearing the cache for pages and clearing all cache can be done from this menu as well. If you wonder why content on the frontend webpage seems to be different from what is in the database you might need to clear the page cache by using one of these options. If cache options are not available for you, you should ask your administrator to enable it for you. (Admins: See link below to TSconfig.)
de: Von diesem Menü aus ist es auch möglich, den Seiten-Cache oder alle Caches zu leeren. Falls Sie sich fragen, warum der Inhalt des Frontends nicht mit dem der Datenbank übereinzustimmen scheint, ist vielleicht ein Leeren des Caches mit einer dieser Optionen erforderlich. Falls keine Befehle für den Cache zur Verfügung stehen, wenden Sie sich bitte an den Administrator. (Administratoren: Siehe unteren Link zu TSconfig.)

# _TCEforms_cacheSelector.seeAlso
source: User TSconfig (See "clearCache.pages/.all") | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/
de: Benutzer-TSconfig (Siehe "clearCache.pages/.all") | http://typo3.org/documentation/document-library/doc_core_tsconfig/OPTIONS/

# perm_module.alttitle
source: Viewing page permissions
de: Seitenrechte anzeigen

# perm_module.description
source: This view will tell you about the page permissions in the page tree.
de: Diese Anzeige stellt Informationen über die Zugriffsrechte auf Seiten im Seitenbaum bereit.

# perm_module.details
source: There are two modes you can select: <b>User overview:</b> This will show you the permissions for <em>your</em> login. So the green/red indicators will reflect the combined user/group/everyone permissions that apply to your login! If there is a grey background behind the indicators it tells you that you are the owner of the page. <b>Permissions</b> Shows the permissions settings for owner / group / everybody. You will be able to edit these settings by clicking the edit icon next to the page title. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
de: Es stehen zwei Modi zur Auswahl: <b>Benutzerübersicht:</b> Zeigt die Zugriffsrechte für <em>Ihre</em> Anmeldung. Die roten und grünen Indikatoren spiegeln dann die kombinierten Zugriffsrechte für Benutzer/Gruppe/Alle wieder, die gerade für Sie gelten! Ein grauer Hintergrund hinter den Indikatoren zeigt an, dass Sie Besitzer der Seite sind. <b>Zugriffsrechte</b> Zeigt die Zugriffsrechte für den Besitzer/eine Gruppe/Alle an. Die Einstellungen können über das Symbol "Bearbeiten" neben dem Seitentitel angepasst werden. Nur der Besitzer einer Seite und Administratoren können die Zugriffsrechte für eine Seite ändern.

# _perm_module.seeAlso
source: xMOD_csh_corebe:perm_module_setting, User Management Howto | http://typo3.org/documentation/document-library/doc_tut_quickstart/Setting_up_user_perm/ Permission system in TYPO3 [Technical] | http://typo3.org/documentation/document-library/doc_core_inside/Access_Control_optio/, _MOD_user_setup:option_helpText
de: xMOD_csh_corebe:perm_module_setting, Anleitung zur Benutzerverwaltung | http://typo3.org/documentation/document-library/doc_tut_quickstart/Setting_up_user_perm/ Berechtigungssystem in TYPO3 [Technisch] | http://typo3.org/documentation/document-library/doc_core_inside/Access_Control_optio/, _MOD_user_setup:option_helpText

# perm_module_setting.alttitle
source: Setting permissions for a page
de: Seitenrechte setzen

# perm_module_setting.description
source: Select the owner user and group plus the permissions for each in the matrix. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
de: Wählen Sie den Besitzerbenutzer und die -gruppe sowie die Rechte für diese in der Tabelle aus. Nur der Besitzer einer Seite (oder ein Admin-Benutzer) kann die Rechte für eine Seite anpassen.

# perm_module_setting.details
source: Setting permissions is done in five categories for owner / group / everybody so it works much like permissions for files and folders in many operating systems. <b>Show page</b> If set, a user can see the page and its content in the backend. The user can also copy the content but not move, delete or edit. <b>Edit content</b> Allows users to add, delete, change and move records (other than page records) on this page. This permission must be given if users should be allowed to create Content Elements etc. on the page. <b>Edit page</b> Allows a user to edit the page record itself. This could be changing the page title or moving the page to another location. <b>Delete page</b> If set, a user is allowed to delete the page and the content on the page. <b>New pages</b> Allows users to create sub-pages to this page.
de: Seitenrechte können in fünf Kategorien für den Besitzer/eine Gruppe/Alle gesetzt werden. Dieses System hat also eine große Ähnlichkeit mit den Rechten, auf Dateien und Ordner zuzugreifen, die man in vielen Betriebssystemen einstellen kann. <b>Seite anzeigen</b> Falls erlaubt, kann der Benutzer die Seite und ihren Inhalt im Backend sehen. Der Benutzer kann den Inhalt kopieren, ihn aber nicht verschieben, löschen oder bearbeiten. <b>Inhalt bearbeiten</b> Erlaubt dem Benutzer, auf dieser Seite Datensätze (Inhaltselemente, nicht aber Seiten) hinzuzufügen, zu löschen, zu ändern und zu verschieben. Dieses Zugriffsrecht muss eingestellt sein, wenn Benutzer Inhaltselemente etc. auf der Seite erstellen können sollen. <b>Seite bearbeiten</b> Erlaubt einem Benutzer, die Seite an sich zu bearbeiten. Das ermöglicht es etwa, den Seitentitel zu ändern oder die Seite an eine andere Position zu verschieben. <b>Seite löschen</b> Wenn gesetzt, kann ein Benutzer die Seite und den Inhalt der Seite löschen. <b>Neue Seite</b> Erlaubt Benutzern, Unterseiten in der aktuellen Seite zu erstellen.

# _perm_module_setting.seeAlso
source: xMOD_csh_corebe:perm_module, User Management Howto | http://typo3.org/documentation/document-library/doc_tut_quickstart/Setting_up_user_perm/
de: xMOD_csh_corebe:perm_module, Anleitung zur Benutzer-Verwaltung | http://typo3.org/documentation/document-library/doc_tut_quickstart/Setting_up_user_perm/

# perm_module_setting.image_descr
source: In this matrix you can set permissions for owner, group and everybody in the five categories available.
de: In dieser Tabelle können Zugriffsrechte für Besitzer, Gruppe und Alle in den fünf verfügbaren Kategorien gesetzt werden.

# filelist_module.alttitle
source: File > Filelist module
de: Modul "Datei > Dateiliste"

# filelist_module.description
source: Shows the files and folders from the folder title you have clicked in the folder tree. Click the icons of the files and folders to perform various actions on the elements.
de: Zeigt die Dateien und Ordner aus dem Ordner, den Sie im Ordnerbaum angeklickt haben. Klicken Sie auf die Symbole der Dateien und Ordner, um unterschiedliche Aktionen durchzuführen.

# filelist_module.details
source: The File > Filelist module provides the main interface to the web-based "FTP-features" in TYPO3. Clicking a folder in the navigation frame will display the files in that folder in the list frame to the right. If you click the icon of a file you will see a menu pop up with menu items related to the file or folder. This enables you to edit, rename and copy files to name a few. <b>The "TEMP" folder</b> There is a special folder, the "TEMP" folder. This is meant to be used for temporary uploads of files that are going to be attached to TYPO3 records later. Content in the TEMP folder should be possible to flush once in a while when the folder becomes too crowded with files. So don't store persistent data in there! The actual folder name is actually "_temp_". The interface will just interprete this with "TEMP" in bold. The same applies to folders named "_recycler_" - they will be trash cans in the folder tree.
de: Das Modul "Datei > Dateiliste" stellt die Oberfläche für Web-basierte FTP-Funktionen in TYPO3 zur Verfügung. Nach einem Klick auf einen Ordner im Ordnerbaum wird der Inhalt zur Rechten angezeigt. Wenn Sie auf das Symbol einer Datei oder eines Ordners klicken, erscheint ein Kontextmenü, mit dem Sie sie/ihn bearbeiten, umbenennen und kopieren können. <b>Der "TEMP"-Ordner</b> Der "TEMP-Ordner" ist ein besonderer Ordner: Sie können ihn benutzen, um Dateien temporär zu speichern, bevor Sie sie später in einem Datensatz verlinken. Der Inhalt des TEMP-Ordners sollte gelöscht werden können, wenn der Ordner zu voll wird. Speichern Sie deshalb keine Dateien dort, die Sie verlinkt haben! Der tatsächliche Name des Ordners ist eigentlich "_temp_". Die Oberfläche von TYPO3 zeigt Ihnen dies als "TEMP" in Fettdruck an. Dasselbe gilt für Ordner mit dem Namen "_recycler_" - sie werden als Papierkorb im Ordnerbaum angezeigt.

# filelist_module.image_descr
source: Here the content of the TEMP folder is shown in the list frame. You can see the filetype, the modification time, size of the file. If you click the filename you will open the file in the browser (if the path is in the web-root). When you click a file icon you see a context menu appear over it. Here you can perform file operations on the item.
de: Hier wird der Inhalt des TEMP-Ordners angezeigt. Sie können folgende Informationen zu den Dateien sehen: den Dateityp, das Änderungsdatum, die Dateigröße, die Lese- und Schreibrechte von TYPO3 (LS = Lesen/Schreiben). Zusätzlich (nicht im Bild) wird daneben u.U. noch die Anzahl der Links auf die Datei angegeben (Ref. = Referenzen). Indem Sie auf den Dateinamen klicken, öffnen Sie die Datei im Browser (falls der Pfad unterhalb der Wurzel Ihrer Domain liegt). Wenn Sie auf ein Dateisymbol klicken, erscheint ein Kontextmenü über ihm. Hier können Sie unterschiedliche Dateioperationen durchführen.

# filelist_clipboard.alttitle
source: Filelist Clipboard
de: Dateiliste Zwischenablage

# filelist_clipboard.description
source: The TYPO3 clipboard works for files as well as for database records (see the Web>List module). You only need to enable the clipboard if you want to use the numeric clipboard pads.
de: Die TYPO3-Zwischenablage kann für Dateien wie für Datensätze verwendet werden (siehe Modul "Web > Liste"). Wenn Sie die Zwischenablage aktivieren, stehen Ihnen unterschiedliche Ablagen zur Verfügung: Die Ablage "Normal" und drei zusätzliche, durchnummerierte Ablagen.

# _filelist_clipboard.seeAlso
source: xMOD_csh_corebe:list_clipboard, About the Clipboard [Technical] | http://typo3.org/documentation/document-library/doc_core_inside/Clipboard/
de: xMOD_csh_corebe:list_clipboard, Über die Zwischenablage [Technisch] | http://typo3.org/documentation/document-library/doc_core_inside/Clipboard/

# filelist_clipboard.image_descr
source: This shows the "Normal" pad on the clipboard. Here an image is now stored. The "Thumbnails" button of the clipboard is enabled so you will see the image icon. When the numeric clipboard pads are enabled you will be able to place multiple items on the clipboard at one time. If the items selected are found in the current folder you can also see the selection reflected in the checkboxes of the items. To paste the contents into a file folder you use the paste icons available in the Filelist module.
de: Hier sehen Sie die Ablage "Normal", in der ein Bild gespeichert ist. Die Option "Vorschaubilder anzeigen" ist aktiviert, so dass Sie eine Miniaturansicht des Bildes sehen. Wenn eine der drei nummerierten Ablagen aktiviert ist, können Sie mehrere Dateien und Ordner gleichzeitig zur Ablage hinzufügen. Befinden sich die hinzugefügten Dateien bzw. Ordner im aktuellen Ordner, sehen Sie sie in der rechten Spalte ausgewählt. Um die Dateien oder Ordner einzufügen, benutzen Sie das Symbol "Einfügen" über der rechten Spalte im Submodul "Dateiliste".

# filelist_options.alttitle
source: File > Filelist options
de: "Datei > Dateiliste" Optionen

# filelist_options.description
source: You can enable the display of image thumbnails and show the clipboard if you need to copy/cut/paste multiple files or folders at a time.
de: Sie können für Bilder die Anzeige von Vorschaubildern aktivieren und die Zwischenablage anzeigen, wenn Sie mehrere Dateien oder Ordner gleichzeitig kopieren, ausschneiden oder einfügen möchten.

# filelist_options.image_descr
source: Enabling thumbnails means that all image file types will be displayed with their thumbnails. This makes it easy to browse an archive of files.
de: Wenn Sie Vorschaubilder aktivieren, werden alle Bilder mit einem Miniaturbild angezeigt. Das macht es einfach, Ordner nach bestimmten Dateien zu durchsuchen.

# file_edit.alttitle
source: Editing a file
de: Datei bearbeiten

# file_edit.description
source: You can edit the contents of a text file with this dialog.
de: Hier können Sie den Inhalt einer textbasierten Datei bearbeiten.

# file_edit.image_descr
source: The editing form for a file is this simple textarea field. It's nothing fancy and experienced coders will miss such as TAB-functionality, but it can edit a stylesheet if badly needed...
de: Die Eingabemaske zum Bearbeiten ist dieses Textfeld. Es ist nichts ausgefallenes und erfahrene Programmierer werden so etwas wie Tabulatoren vermissen, aber mit ihm können Sie ein Stylesheet bearbeiten, wenn es nötig ist...

# file_newfolder.alttitle
source: Creating a new folder
de: Neuen Ordner erstellen
