Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lang/*.locallang_csh_em.xlf
Languages: de

# .alttitle
source: Tools > Extension Manager (EM)
de: Tools > Erweiterungs-Manager

# .description
source: The Extension Manager controls import, installation and upgrading of Extensions in TYPO3.
de: Der Erweiterungs-Manager kontrolliert den Import, die Installation, das Aktualisieren und Zurücksetzen auf einen alten Stand sowie die Verwaltung von TYPO3-Erweiterungen.

# .details
source: TYPO3 can be extended in nearly any direction without loosing backwards compatibility. The Extension API provides a powerful framework for easily adding, removing, installing and developing such extensions to TYPO3. This is in particular powered by the Extension Manager (EM) inside TYPO3. "Extensions" is a term in TYPO3 which covers two other terms, plugins and modules. A plugin is something that plays a role on the website itself. For example a board, guestbook, shop etc. It is normally enclosed in a PHP class and invoked through a USER or USER_INT cObject from TypoScript. A plugin is an extension in the frontend. A module is a backend application which has it's own position in the administration menu. It requires backend login and works inside the framework of the backend. We might also call something a module if it exploits any connectivity of an existing module, that is if it simply adds itself to the function menu of existing modules. A module is an extension in the backend.
de: TYPO3 kann in nahezu jede Richtung erweitert werden, ohne dabei seine Abwärtskompatibilität zu verlieren. Die Erweiterungs (Extension) -API bietet ein sehr mächtiges System, um auf einfache Art TYPO3-Erweiterungen zu installieren, zu deinstallieren und zu entwickeln. Bei diesen Aufgaben unterstützt Sie vor allem der Erweiterungs-Manager (EM). "Erweiterung" ist dabei ein Oberbegriff für "Plug-In" und "Modul": Ein <b>Plug-In</b> stellt eine Erweiterung dar, welche einen direkten Bezug zum Erscheinungsbild und/oder den Funktionalitäten des Frontends (also der mit TYPO3 erstellten Website selbst) hat. Darunter fallen also Gästebücher, Shops, Bildergalerien und so weiter. Solche Plug-Ins sind normalerweise in einer PHP-Klasse angesiedelt und werden durch USER- oder USER_INT-cObjects innerhalb von TypoScript aufgerufen. <em>Plug-Ins sind Frontend-Erweiterungen.</em> Ein <b>Modul</b> ist eine Anwendung, die innerhalb des Backends eigene Funktionalitäten zur Verfügung stellt oder bestehende Module erweitert. Module haben häufig einen eigenen Menüpunkt innerhalb des Backends wie zum Beispiel die Protokolldateianalyse, DB-Verwaltungswerkzeuge und so weiter. <em>Module sind Backend-Erweiterungen.</em>

# _.seeAlso
source: xMOD_csh_corebe, Core / Extension Architecture | http://typo3.org/documentation/document-library/doc_core_inside/This_document-1/ Managing Extensions | http://typo3.org/documentation/document-library/doc_core_inside/Backend_user_setup/
de: xMOD_csh_corebe, Kern-/Erweiterungsarchitektur | http://typo3.org/documentation/document-library/doc_core_inside/This_document-1/ Erweiterungen verwalten | http://typo3.org/documentation/document-library/doc_core_inside/Backend_user_setup/

# loaded.alttitle
source: Loaded Extensions
de: Derzeit geladene Erweiterungen

# loaded.description
source: "Loaded extensions" are currently running on the system. This list shows you which extensions are loaded and in which order. "Shy" extensions are also loaded but "hidden" in this list because they are system related and generally you should just leave them alone unless you know what you are doing.
de: "Geladene Erweiterungen" werden gerade auf Ihrem TYPO3-Server ausgeführt. Diese Liste zeigt Ihnen, welche Erweiterungen ausgeführt werden und in welcher Reihenfolge sie geladen wurden. "Ausgeblendete" Erweiterungen sind ebenfalls geladen, werden in dieser Liste aber "verborgen", weil sie zumeist systemspezifisch sind und von Ihnen im Normalfall nicht verändert werden sollten - es sei denn, Sie wissen sehr genau, was Sie tun.

# loaded.details
source: The extensions in this list are shown in the order they are found in $TYPO3_CONF_VARS[EXT][extList]. To de-install an extension you simply click the green "-" icon. If there are no dependencies requiring the extension it will be removed from the list of installed extensions. The "Rq" extensions in the loaded extensions list are "required extensions". These are related so deeply to the system that you cannot disable them from the Extension Manager.
de: Die Erweiterungen in dieser Liste werden in der Reihenfolge angezeigt, wie sie in der Systemvariablen $TYPO3_CONF_VARS[EXT][extList] aufgeführt sind. Um eine Erweiterung zu deinstallieren, klicken Sie einfach auf das entsprechende grüne "-"-Symbol. Sofern für diese Erweiterung keine Abhängigkeiten zu anderen Erweiterungen bestehen, wird sie sofort aus der Liste der geladenen Erweiterungen entfernt. Die "Rq"-Erweiterungen in dieser Liste werden für die ordnungsgemäße Funktion des TYPO3-Gesamtsystems benötigt ("Rq" steht für den englischen Ausdruck für benötigt, "required"). Diese Erweiterungen sind so tief im System verwurzelt, dass sie nicht mit Hilfe des Erweiterungs-Managers deinstalliert werden können.

# loaded.image_descr
source: The list of loaded extensions shown in the loading order.
de: Die Liste der geladenen Erweiterungen in der Reihenfolge ihrer Installation.

# avail.alttitle
source: Available Extensions
de: Vefügbare Erweiterungen

# avail.description
source: Available extensions are extensions which are present in the extension folders. You can install any of the available extensions in this list. When you install an extension it will be loaded by TYPO3 from that moment. In this list the extensions with dark background are installed (loaded) - the others just available (not loaded), ready to be installed on your request.
de: "Vefügbare Erweiterungen" sind solche Erweiterungen, die an einem der drei möglichen Speicherorte für Erweiterungen vorhanden sind, d.h. als lokale Dateien auf dem Server vorliegen. Jede der hier aufgeführten Erweiterungen kann mit einem Mausklick ganz einfach installiert und ab diesem Zeitpunkt genutzt werden. Die in der Abbildung dunkel hinterlegten Erweiterungen sind bereits geladen, die anderen stehen zur Installation zur Verfügung.

# avail.details
source: You can install an extension by clicking the gray "+" icon in this list. If you want to de-install an extension you click the green "-" icon. When you click the install button ("+") you will most often end in a dialog where you have to confirm the creation of database tables and fields or maybe you will be asked to "clear all cache". The Extension Manager automatically handles these requirements for you which makes it extremely easy to install new extensions.
de: Durch einen Mausklick auf das graue "+"-Symbol können Sie jede dieser Erweiterungen installieren und mit einem Mausklick auf das grüne "-"-Symbol deinstallieren. Nach einem Klick auf das Installationssymbol ("+") wird Ihnen im Rahmen des Installationsprozesses häufig ein Installationsmenü für diese Erweiterung angezeigt. Hier müssen Sie z.B. das Anlegen neuer Datenbanktabellen und -felder oder das "Löschen aller Caches" bestätigen. Der Erweiterungs-Manager übernimmt dann im Anschluss all diese Aufgaben und macht es Ihnen somit sehr einfach, neue Erweiterungen zu installieren.

# avail.image_descr
source: The list of available extension on the server. The list is compiled from extensions found in the "local", "global" and "system" extension folders. If you click the install icon ("+") of an extension you might end in a dialog like this. In this case a new database table is required. The Extension Manager will automatically detect that it does not exist yet and suggest that you create it. The creation automatically takes place as well, simply by accepting the changes when pressing "Make updates".
de: Die Liste der verfügbaren Erweiterungen dieses TYPO3-Servers. Diese Liste wird aus all denjenigen Erweiterungen zusammengestellt, die sich in den Erweiterungsordnern "Lokal", "Global" und "System" befinden. Nach einem Klick auf das Installationssymbol ("+") wird Ihnen unter Umständen solch ein Installationsmenü angezeigt. In diesem Fall benötigt die Erweiterung eine eigene Datenbanktabelle. Der Erweiterungs-Manager erkennt automatisch, dass die Tabelle noch nicht existiert und schlägt vor, diese anzulegen. Nach Betätigen der Schaltfläche "Aktualisierungen durchführen" werden alle notwendigen Änderungen automatisch durchgeführt.

# import.alttitle
source: Importing Extensions
de: Erweiterungen importieren

# import.description
source: This is the process of bringing the files of an extension to the servers filesystem. You can do this either by importing from a repository at a URL (usually from TER; TYPO3 Extension Repository at typo3.org) or by uploading a "t3x" file which someone else created from the Extension Manager on another server.
de: Durch diesen Prozess werden Erweiterungen auf Ihren TYPO3-Server gespielt, d.h. Dateien kopiert. Sie können Erweiterungen entweder von einer URL (normalerweise aus dem TER, dem TYPO3-Extension-Repository auf typo3.org) oder aus einer lokal vorliegenden "t3x"-Datei importieren. t3x (TYPO3 Extension) -Dateien entstehen durch den Export einer Erweiterung aus einem anderen TYPO3-Server.

# import.details
source: <b>Import from TER</b> To connect to the TER you simply click the button "Connect to online repository". This will request the URL shown in the text above the button and the URL should return a list of available extension you can import. If you know what you are looking for then enter a search word in the look-up box. In particular this helps you to look up a specific extension key. The connection to TER will be much faster if you use this since less data is sent over the wire! <b>Upload from file</b> For private projects the exchange of extensions is easily done by sending "t3x" files from system to system. In one TYPO3 installation you simply go to the menu "Backup/Delete" of an extension and download a "Backup" of the extension. The fileformat is a serialized PHP array, compressed if possible. This file can then be uploaded in the Extension Manager of another TYPO3 system where you want to import it.
de: <b>Import aus dem TER</b> Um eine Verbindung mit dem TER herzustellen, müssen Sie lediglich auf die Schaltfläche "Mit Online-Bibliothek verbinden" drücken. Das veranlasst TYPO3 dazu, sich mit der im Feld angezeigten URL zu verbinden und eine Liste der dort verfügbaren Erweiterungen zurückzuliefern. Wenn Sie bereits wissen, für welche Erweiterung Sie sich interessieren, sollten Sie das Suchfeld ausfüllen - Sie verkürzen dadurch die Antwortzeit des TER auf ein Minimum, weil lediglich ein Bruchteil der Informationen übertragen werden muss! <b>Upload aus einer Datei</b> Im Falle privater Projekte erfolgt der Austausch von Erweiterungen auf einfache Weise durch die Übertragung von "t3x"-Dateien von einem System zum anderen. Bei der einen TYPO3-Installation ruft man einfach das Menü "Backup/Löschen" einer Erweiterung auf und lädt ein "Backup" der Erweiterung herunter. Beim Dateiformat handelt es sich um einen serialisierten PHP-Array, wenn möglich komprimiert. Diese Datei kann anschließend in den Erweiterungs-Manager eines anderen TYPO3-Systems hochgeladen werden, in das man sie importieren möchte.

# import.image_descr
source: The "Import" screen. Before you connect to the online repository you might like to configure typo3.org username and password since that will be used to also select "Member" extensions in TER, if any. You can also enable "Get own/member/selected extensions only" if you want to limit the list further.
de: Der Bildschirm "Import". Bevor Sie Erweiterungen aus dem TER importieren, sollten Sie zuerst Ihre typo3.org-Anmeldedaten angeben, denn nur dadurch erhalten Sie Zugriff auf Erweiterungen, deren "Mitglied" Sie sind. Sie können die sehr lange Liste auch weiter verkürzen, in dem Sie die Option "Nur eigene/Mitglieder/ausgewählte Erweiterungen anzeigen" wählen.

# import_ter.alttitle
source: Extensions in TER
de: Erweiterungen im TER

# import_ter.description
source: Extensions in this list are online for immediate download from the TYPO3 Extension Repository (TER). Extensions with dark background are those already on your server - the others must be imported from the repository to your server before you can use them. If you want to use an extension from the repository, you should simply click the "import" button with the red arrow left to the extension.
de: Die in dieser Liste aufgeführten Erweiterungen stehen zum sofortigen Herunterladen bereit. Die dunkel hinterlegten Erweiterungen befinden sich bereits auf Ihrem Server, die anderen müssen erst noch heruntergeladen werden, bevor Sie sie verwenden können. Klicken Sie einfach auf die Schaltfläche "Import" mit dem roten Pfeil neben der Erweiterung, wenn Sie eine dieser Erweiterungen benutzen möchten.

# import_ter.details
source: <b>Import Extensions</b> If an extension does not yet exist on your server you will see the icon with the red arrow next to that extension. A single click and the extension will be downloaded and the files extracted on your server. The download directory is seen if you move the mouse over the icon (in the tool-tip text). <b>Update Extensions</b> You can update extensions that are always on your system by clicking the icon with the green arrows. The update icon will appear if the "minor" version number (middle digit) has been incremented. This means that extensions updated on the dev-version number (the third digit) will not be shown as "ready for update". (You can configure TYPO3 to do that though!). <b>Seeing details about an extension in TER</b> You can also click the title of an extension to see details about it. That will also allow you to perform a more detailed update operation where you can select version number and download location (local/global/system). You can also ask to have the most recent translations downloaded.
de: <b>Erweiterungen importieren</b> Wenn sich eine Erweiterung noch nicht auf Ihrem lokalen Server befindet, erscheint ein roter Pfeil neben dem Namen der Erweiterung (das Importsymbol). Durch einen Mausklick auf dieses Importsymbol wird die im TER komprimiert vorliegende Erweiterung auf Ihren Server kopiert und entpackt. Die Stelle, an welche die Erweiterung dabei kopiert wird, sehen Sie, wenn Sie mit der Maus über das Symbol fahren (als Kurzinfo). <b>Erweiterungen aktualisieren</b> Wenn sich neben dem Namen einer Erweiterung ein grüner Doppelpfeil (das Symbol "Aktualisieren") erscheint, so liegt für diese bereits installierte Erweiterung eine neuere Version (also eine Aktualisierung) vor. Dabei erscheint das Symbol "Aktualisieren" immer dann, wenn sich bei Versionnummer x.y.z die erste oder die mittlere Ziffer erhöht hat (erste Ziffer stellt die Major-Version dar, die mittlere Ziffer symbolisiert die Minor-Version und die letzte Ziffer steht für die Entwicklungsversion). Entwicklungsversionen erscheinen standardmäßig also nicht als Aktualisierung, Sie können TYPO3 aber so konfigurieren, dass auch solche Aktualisierungen installiert werden können. <b>Detailansicht zu Erweiterungen im TER</b> Sie können auch direkt auf den Namen der Erweiterung klicken, wenn Sie zur Detailansicht für die Erweiterung gelangen möchten. Innerhalb der Deteilansicht ist es auch möglich, den Aktualisierungsvorgang genauer zu konfigurieren (in dem Sie etwa eine bestimmte Version der Erweiterung auswählen oder den Installationsort (lokal/global/system) festlegen). Außerdem können Sie auch die aktuellsten Übersetzungen der Sprachdateien herunterladen lassen.

# import_ter.image_descr
source: List of extensions from TER. The red arrow icon is the "Import" link (for new extensions), the green arrow icon is the "Update" link (for an extension that is already on your server). If an extension is already available in the most recent version you will not see any icon at all to the left of the extension. If you clicked the title of an extension you will request the repository for details about the extension. This also allows you to select a specific version for import. You can also select the install location (global/local) and you can request to have the most recent translations merged into the extension upon retrieval.
de: Liste der im TER verfügbaren Erweiterungen. Der rote Pfeil ist das Import-Symbol (für neue Erweiterungen), der grüne Doppelpfeil ist das Symbol "Aktualisieren" (für bereits vorhandene Erweiterungen). Sollten Sie schon die aktuellste Version einer Erweiterung installiert haben, erscheint an dieser Stelle überhaupt kein Symbol. Wenn Sie den Namen einer Erweiterungen anklicken, gelangen Sie zur Detailansicht dieser Erweiterung. Hier können Sie auch eine spezielle Version der Erweiterung auswählen, den Installationsort (lokal/global/system) festlegen oder die aktuellen Übersetzungen der Sprachdateien herunterladen.

# info.alttitle
source: Extension Details
de: Details zur Erweiterung

# info.description
source: Shows details about the extension.
de: Zeigt Ihnen Detailinformationen zu dieser Erweiterung.

# info.details
source: In this view some of the details are simply a display of the information from the "ext_emconf.php" file in the extension. The "emconf" file contains meta data for the Extension Manager. The Extension Manager will also go a bit further and perform some analysis of the scripts in the extension. The list will include the findings of this analysis and if any errors were found they will be displayed. Usually these errors will not prevent the extension from working but more likely point out some theoretical problems that the extension developer should address.
de: In dieser Ansicht werden zum Teil einfach Informationen aus der Datei "ext_emconf.php" angezeigt, in welcher jede Erweiterung Metainformationen für den Erweiterungs-Manager gespeichert hat. Der Erweiterungs-Manager geht aber noch einen Schritt weiter und analysiert dazu alle Skripte der Erweiterung. Das Ergebnis dieser Analyse wird hier ebenfalls angezeigt. Sollten Fehler aufgeführt sein, so bedeutet dies nicht zwangsläufig, dass die Erweiterung nicht funktionsfähig ist! Zumeist weisen diese Fehlermeldungen auf Probleme <em>theroretischer</em> Natur hin, derer sich der Entwickler dieser Erweiterung annehmen sollte.

# info.image_descr
source: The details view of an extension displays live statistics from analysis as well as static data from the "ext_emconf.php" file.
de: Die Detailansicht einer Erweiterung zeigt die Ergebnisse des Analyselaufs als auch die Auswertung der statischen Informationen aus der Datei "ext_emconf.php" an.

# backup_delete.alttitle
source: Backup Extension as a file
de: Erweiterung exportieren

# backup_delete.description
source: Click the "Download" link here and you will download the extension as a file containing a serialized PHP array, a hash and everything possibly compressed if the server supports it. Save the file with a filename ending on "t3x".
de: Durch Anklicken des Links "Herunterladen" erzeugt der Server eine Exportdatei, die Sie anschließend auf Ihrem Rechner speichern können (als Dateiendung sollten Sie dabei "t3x" wählen). In dieser Datei befinden sich ein serialisiertes PHP-Array, ein Hash und alle anderen zur Erweiterung gehörenden Dateien, die - sofern dies der Server unterstützt - beim Export bereits komprimiert wurden.

# backup_delete.image_descr
source: "Backup" of extensions - also very useful for exchange of extensions between members of a workgroup.
de: "Backup" oder "Export" von Erweiterungen. Sie können diese Exportdateien auch dazu verwenden, um verschiedene Entwicklungsstände einer Erweiterung mit Mitgliedern einer Arbeitsgruppe auszutauschen.

# upload.alttitle
source: Upload an Extension to the repository (TER)
de: Erweiterung ins TER hochladen

# upload.description
source: Here you can upload an extension to TER. In order to do so you must enter your TYPO3.org username and password in the form. In addition each extension has an upload password you need to add as well. You should also make sure you registered / own the extension key!
de: Hier können Sie Ihre selbst entwickelten Erweiterungen ins TER hochladen. Zuvor müssen Sie sich aber zunächst eine Anmeldung bei typo3.org besorgen (durch einfaches Anmelden auf dieser Website). Damit Sie eine Erweiterung hochladen können, müssen Sie auf der Website einen Erweiterungsschlüssel ("extension key") beantragen bzw. registrieren. Zusätzlich besitzt jede Erweiterung auch noch ein sog. Hochladepasswort, welches Sie beim Hochladen Ihrer Erweiterung selbst bestimmen.

# upload.details
source: <b>Changelog</b> In the changelog field you enter the changes made or the reason for the upload. This will be displayed in the list of new extensions. <b>Version numbers</b> Select a method for incrementation of the version number. For new "versions" of your extension you should select "sub" or "main" which will display your extension in the list of new extensions. For maintenance uploads you select "dev".
de: <b>Änderungsprotokoll</b> Geben Sie hier bitte die an, welche Veränderungen vorgenommen wurden und warum Sie diese geänderte Version ins TER stellen. Diese Angaben erscheinen auf der TYPO3-Website innerhalb der Liste der neuen Erweiterungen (http://www.typo3.org/extensions/). <b>Versionsnummern</b> Bestimmen Sie, wie die Versionsnummer dieser Erweiterung erhöht werden soll. Für "neue" Versionen sollten Sie die Werte "sub" oder "main" erhöhen - dadurch erscheint diese Version in der Liste der neuen Erweiterungen. Sollten Sie lediglich kleine Fehler beseitigt haben, wählen Sie bitte den Wert "dev".

# _upload.seeAlso
source: _MOD_tools_em:settings, Register Extension Keys | http://typo3.org/extensions/register-extension-keys/
de: _MOD_tools_em:settings, Erweiterungsschlüssel registrieren | http://typo3.org/extensions/register-extension-keys/

# upload.image_descr
source: The upload form for extensions. The extension is submitted to the selected repository, usually TYPO3.org (default).
de: Das Hochladeformular für Erweiterungen. Die Erweiterung wird in das gewählte Depot (normalerweise das TER auf typo3.org) hochgeladen.

# editfiles.alttitle
source: Editing scripts in an extension
de: Skripte einer Erweiterung editieren

# editfiles.description
source: The Extension Manager can be used for editing scripts in extensions. This feature is mostly for emergencies since a webbrowser is not the ideal tool for programming.
de: Der Erweiterungs-Manager kann auch dazu verwendet werden, die Skripte einer Erweiterung zu editieren. Das sollte aber lediglich als Notbehelf gesehen werden, denn ein Web-Browser ist nicht gerade ein ideales Hilfsmittel zum Programmieren.

# editfiles.details
source: <b>Notice:</b> Before editing of extension scripts can be performed you have to disable the configuration option "TYPO3_CONF_VARS[EXT][noEdit]" in "localconf.php".
de: <b>Hinweis:</b> Bevor Sie solche Skripte editieren können, müssen Sie erst die Option "TYPO3_CONF_VARS[EXT][noEdit]" in der Datei "localconf.php" deaktivieren.

# editfiles.image_descr
source: Some file types - like PHP scripts - can be edited by a textarea field inside the Extension Manager.
de: Einige Dateitypen - wie zum Beispiel PHP-Dateien - können direkt in einem Textfeld innerhalb des EM editiert werden.

# settings.alttitle
source: Extension Manager Settings
de: Einstellungen
