Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/workspaces/Resources/Private/Language/*.locallang_db.xlf
Languages: de

# sys_filemounts.tabs.staging
source: Staging
de: Stufen

# sys_workspace.custom_stages
source: Custom stages:
de: Benutzerdefinierte Stufen:

# sys_workspace_stage.responsible_persons
source: Responsible persons:
de: Verantwortliche Benutzer:

# sys_workspace_stage.default_mailcomment
source: Default mail comment:
de: Standardkommentar für E-Mails:

# sys_workspace_stage.parentid
source: UID of parent record:
de: UID des Stammdatensatzes:

# sys_workspace_stage.parenttable
source: Parent table:
de: Stammtabelle:

# sys_workspace_stage
source: Workspace Stage
de: Arbeitsumgebungsstufe

# tabs.notification_settings
source: Notification settings
de: Benachrichtigungseinstellungen

# sys_workspace.edit_notification_mode
source: Edit stage: Recipient suggestion checkboxes
de: Stufe Bearbeiten: Checkboxen für Empfängervorschläge

# sys_workspace.notification_mode.0
source: All are selected per default (can be changed)
de: Alle sind standardmäßig ausgewählt (anpassen möglich)

# sys_workspace.notification_mode.1
source: Some are selected per default (defaults cannot be unchecked)
de: Einige sind standardmäßig ausgewählt (abwählen nicht möglich)

# sys_workspace.notification_mode.2
source: All are selected per default (cannot be changed)
de: Alle standardmäßig ausgewählt (anpassen nicht möglich)

# sys_workspace.edit_notification_defaults
source: Edit stage: default notification mail recipients
de: Stufe Bearbeiten: Standardempfänger für Benachrichtigungen per E-Mail

# sys_workspace.edit_allow_notificaton_settings
source: Allow notification settings during stage change back to edit stage
de: Ändern der Benachrichtigungseinstellungen bei Rückstufung auf Bearbeiten erlauben

# sys_workspace.publish_notification_mode
source: Ready to publish stage: Recipient suggestion checkboxes
de: Stufe Bereit für Veröffentlichung: Checkboxen für Empfängervorschläge

# sys_workspace.publish_notification_defaults
source: Ready to publish stage: default notification mail recipients
de: Stufe Bereit für Veröffentlichung: Standardempfänger für Benachrichtigungen per E-Mail

# sys_workspace.publish_allow_notificaton_settings
source: Allow notification settings during stage change to ready to publish
de: Ändern der Benachrichtigungseinstellungen bei Hochstufung auf "Bereit für Veröffentlichung" erlauben

# tabs.general
source: General
de: Allgemein

# sys_workspace_stage.notification_mode
source: Recipient suggestion checkboxes
de: Checkboxen für Empfängervorschläge

# sys_workspace_stage.notification_defaults
source: Default notification mail recipients
de: Standardempfänger für Benachrichtigungen per E-Mail

# sys_workspace_stage.allow_notificaton_settings
source: Allow notification settings during stage change
de: Ändern der Benachrichtigungseinstellungen bei Stufenänderung erlauben
