Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/workspaces/Resources/Private/Language/*.locallang.xlf
Languages: de

# legend.label
source: Legend:
de: Legende:

# legend.edited
source: edited
de: bearbeitet

# legend.moved
source: moved
de: verschoben

# legend.deleted
source: deleted
de: gelöscht

# legend.new
source: created
de: erstellt

# legend.hidden
source: hidden
de: verborgen

# title
source: Workspaces
de: Arbeitsumgebungen

source: cancel
de: abbrechen

source: choose Mass Action
de: Stapelverarbeitung auswählen

source: choose Action
de: Aktion auswählen

source: item
de: Element

source: items
de: Elemente

source: Records to display
de: Datensätze anzeigen

source: review and publish
de: prüfen und veröffentlichen

source: Workspace List
de: Liste der Arbeitsumgebungen

# editorInLive
source: You are in LIVE workspace. You have to select a draft workspace before you can review and publish changes.
de: Sie befinden sich in der LIVE-Arbeitsumgebung. Wählen Sie eine Entwurfs-Arbeitsumgebung aus um Änderungen überprüfen und veröffentlichen können.

# actionSendToStage
source: Send to stage
de: An Stufe senden

# publish_execute_action_option
source: Publish to LIVE
de: LIVE veröffentlichen

source: Close
de: Schließen

# runMassAction.done
source: Done processing %d elements
de: %d Elemente erfolgreich verarbeitet

# runMassAction.init
source: init
de: Initialisieren

# tooltip.publishAll
source: Really publish entire workspace?
de: Die gesamte Arbeitsumgebung tatsächlich veröffentlichen?

# tooltip.swapAll
source: Really swap entire workspace?
de: Die gesamte Arbeitsumgebung tatsächlich tauschen?

# tooltip.discardAll
source: Do you really want to discard changes from the whole workspace?
de: Sämtliche Änderungen in der Arbeitsumgebung tatsächlich verwerfen?

# tooltip.affectWholeWorkspace
source: Please note that this will affect all changes in the current workspace, which may be more than you are currently seeing on your screen.
de: Bitte beachten Sie, dass das alle Änderungen in der aktuellen Arbeitsumgebung betrifft. Das können mehr sein, als im Moment angezeigt werden!

# tooltip.generatePagePreview
source: Generate page preview
de: Seitenvorschau erstellen

source: Preview Link
de: Vorschau-Link

# error.noResponse
source: The server did not send any response whether the action was successful.
de: Der Server hat keine Rückmeldung gesendet, ob die Aktion erfolgreich war.

source: Row details...
de: Zeilendetails...

# column.difference
source: Difference
de: Unterschied

# column.changeDate
source: Modification
de: Änderung

# column.stage
source: Current Stage
de: Aktuelle Stufe

# column.actions
source: Actions
de: Aktionen

# column.wsPath
source: Path
de: Pfad

# column.wsTitle
source: Changed
de: Geändert

# column.uid
source: WS-Id
de: Arbeitsumgebungs-ID

# column.workspaceName
source: Workspace
de: Arbeitsumgebung

# column.livePath
source: Live-Path
de: Live-Pfad

# column.liveTitle
source: Live-Title
de: Live-Titel

# column.wsSwapColumn
source: Swap workspace
de: Arbeitsumgebung austauschen

# tooltip.viewElementAction
source: Preview element
de: Elementvorschau

# tooltip.editElementAction
source: Edit element
de: Element bearbeiten

# tooltip.openPage
source: Open version of page
de: Seitenversion öffnen

# tooltip.sendToPrevStage
source: Send record to previous Stage
de: Datensatz an vorherige Stufe senden

# tooltip.sendToNextStage
source: Send record to next Stage
de: Datensatz an nächste Stufe senden

# tooltip.discardVersion
source: Discard workspace version of record.
de: Entwurfversion des Datensatzes verwerfen.

# tooltip.swap
source: Swap live and workspace versions of record
de: Live- und Arbeitsumgebungsversion austauschen

# window.discard.title
source: Discard workspace version of record.
de: Entwurfversion des Datensatzes verwerfen.

# window.discardAll.title
source: Discard all workspace version of current page.
de: Alle Entwurfsversionen der aktuellen Seite verwerfen.

# window.discard.message
source: Do you really want to discard this version from workspace?
de: Diese Version tatsächlich aus der Arbeitsumgebung verwerfen?

# window.discardAll.message
source: Do you really want to discard all versions from page?
de: Tatsächlich alle Versionen von dieser Seite verwerfen?

# window.swap.title
source: Swap version
de: Version austauschen

# window.swap.message
source: Do you really want to swap this version?
de: Diese Version tatsächlich austauschen?

# window.massAction.title
source: Prepare to start mass action
de: Stapelverarbeitung ausführen

# error.stageId.integer
source: StageId is supposed to be an integer
de: Die Arbeitsumgebungs-ID sollte eine Ganzzahl sein

# error.stageId.invalid
source: The stage to be used seems to be invalid and cannot be used. Please consider to use the update wizard in the install tool to fix this.
de: Die ausgewählte Stufe scheint unültig zu sein und kann nicht genutzt werden. Bitte verwenden Sie den Update-Assistenten im Install Tool um dies zu reparieren.

# error.sendToNextStage.noRecordFound
source: The record element could not be found.
de: Das Element konnte nicht gefunden werden.

# error.sendToPrevStage.noPreviousStage
source: The record element is already in editing stage, there is no previous stage.
de: Das Element befindet sich bereits in der Stufe Bearbeiten. Es existiert keine vorherige Stufe.

# window.sendToNextStageWindow.itemsWillBeSentTo
source: The selected element(s) will be sent to
de: Die ausgewählten Elemente werden an folgende Stufe gesandt:

# window.sendToNextStageWindow.sendMailTo
source: Send mail to
de: E-Mail senden an

# window.sendToNextStageWindow.additionalRecipients
source: Additional recipients
de: Weitere Empfänger

# window.sendToNextStageWindow.comments
source: Comments
de: Kommentare

# error.getStageTitle.stageNotFound
source: Stage not found
de: Stufe nicht gefunden

# warning.oldStyleWorkspaceInUser
source: It seems that you're still using old-style workspace. Please use the update scripts in the TYPO3 Install Tool to run the necessary updates. If you continue using this module without migrating your workspace you might loose data.
de: Scheinbar verwenden Sie eine veraltete Version der Arbeitsumgebungen. Bitte nutzen Sie den Update-Assistenten im Install Tool um dieses Problem zu beheben. Wenn Sie mit der veralteten Version fortfahren zu arbeiten könnte dies zu Datenverlust führen.

# info.newpage
source: New Page!
de: Neue Seite!

# info.newpage.detail
source: The previewed page has been created in a workspace and has no live counterpart.
de: Die Vorschauseite wurde in einer Arbeitsumgebung erstellt und hat kein Live-Pendant.

# preview.visualPreview
source: Visual preview
de: Visuelle Vorschau

# preview.listView
source: List view
de: Listenansicht

# preview.livePreviewDetail
source: Click this element to hide the workspace version and see the live version of the page.
de: Dieses Element anklicken, um die Entwurfsversion zu verbergen und die Live-Version der Seite zu sehen.

# preview.workspacePreview
source: Workspace
de: Arbeitsumgebung

# preview.workspacePreviewDetail
source: Click this element to hide the live version and see the workspace version of the page.
de: Dieses Element anklicken, um die Live-Version zu verbergen und die Entwurfsversion der Seite zu sehen.

# preview.modeSlider
source: Slider
de: Schieberegler

# preview.modeVbox
source: Vertical
de: Vertikal

# label_doaction_publish
source: Publish
de: Veröffentlichen

# label_doaction_swap
source: Swap
de: Austauschen

# label_doaction_discard
source: Discard
de: Verwerfen

# label_doaction_generatePreviewLink
source: Generate Workspace Preview Link
de: Vorschau-Link für Arbeitsumgebung erzeugen

# info.elementAlreadyModified
source: Element is in workspace stage "%s", modifications will send it back to "%s".
de: Element ist in der Arbeitsumgebungsstufe "%s", Änderungen werden zurückgesandt zur Stufe "%s".

source: Live Workspace
de: Live-Arbeitsumgebung

source: Workspace version
de: Entwurfsversion

# current_step
source: <b>Current stage step</b>: {0} (<b>{1}</b>/{2})
de: <b>Aktueller Schritt in derzeitiger Stufe</b>: {0} (<b>{1}</b>/{2})

# path
source: <b>Path</b>: {0}
de: <b>Pfad</b>: {0}

# stage
source: Stage {0}
de: Stufe {0}

# comments
source: User comments for <b>step {0} of stage</b> "{1}"
de: Benutzerkommentare für <b>Schritt {0} von Stufe</b> "{1}"
