Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/cms/*.locallang_csh_webinfo.xlf
Languages: de

# pagetree_overview.alttitle
source: Pagetree Overview
de: Seitenbaumübersicht

# pagetree_overview.description
source: The Pagetree Overview shows information related to pages for a branch of the page tree. This includes start- and stop-times, cache settings etc.
de: Die Seitenbaumübersicht liefert Informationen zu Seiten eines Bereiches des Seitenbaums. Darin enthalten sind unter anderem die Anzahl von Datensätzen, Seiteneinstellungen (z.B. Alias), Start- und Stoppzeiten für die Darstellung, Cache-Einstellungen usw.

# pagetree_overview.image_descr
source: One of the features of the Pagetree Overview module is that you can see what types of records are found on pages in a branch. Here record counts are shown for a page tree branch 2 levels down.
de: Ein Beispiel für eine Funktion der Seitenbaumübersicht ist die Möglichkeit, die Typen der Datensätze anzuzeigen, die auf bestimmten Seiten enthalten sind. In diesem Fall wird die Anzahl der Datensätze für den Teilbereich des Seitenbaumes in der 2. Ebene und tiefer angezeigt.

# func_0.alttitle
source: Basic Settings
de: Basiseinstellungen

# func_0.description
source: Displays a selection of fields from page records which are regarded as foundational settings for pages. That includes aliases, start- and stop times, access restriction information etc.
de: Stellt eine Auswahl von Feldern bestimmter Seiten dar, die grundsätzliche Einstellungen für Seiten enthalten. Dazu gehören Aliase, Start- und Stoppzeiten, Zugriffsbeschränkungen usw.

# func_0.details
source: The Basic Settings view resembles the Cache and Age view quite a lot. They are different only by the selection of fields they show. <b>Batch editing page fields</b> You will find multiple edit-icons around the interface. All edit icons in head lines will bring you to an editing dialog where you can change exactly that field for all listed tables! Very useful for batch-editing of say all "Start" times. If you click the edit icon at the ID numbers of pages you will get straight to the regular editing of a whole page record.
de: Die Ansicht der Basiseinstellungen ähnelt stark der von Cache und Alter. Sie unterscheiden sich lediglich durch die Auswahl der Felder, die sie anzeigen. <b>Bearbeitung mehrerer Felder gleichzeitig</b> In dieser Ansicht finden Sie Bearbeitungssymbole für die mehrfache Bearbeitung. Die Symbole in den Zeilen der Überschriften führen in einen Bearbeitungsmodus, in dem man genau dieses Feld für alle aufgeführten Tabellen bearbeiten kann! Dies ist sehr nützlich, um etwa alle Start-Zeiten der Seiten zu verändern. Wenn man auf das Bearbeitungssymbol der ID-Nummern klickt, gelangt man direkt zur normalen Ansicht zur Bearbeitung des gesamten Seitendatensatzes.

# func_0.image_descr
source: The Basic Settings view offers a very convenient overview of page aliases, start times and access restriction settings in the tree branch. If you click an edit-icon in the header you will be able to edit that field for all listed pages.
de: Die Ansicht der Basiseinstellungen bietet einen bequemen Überblick über die Aliase, Startzeiten und Zugriffsbeschränkungen im Zweig des Seitenbaums. Wenn man auf ein Bearbeitungssymbol in der Überschrift klickt, kann man das entsprechende Feld für alle aufgelisteten Seiten bearbeiten (in diesem Fall das Feld "Access"). So sieht das gleichzeitige Bearbeiten mehrerer Einträge aus - jeweils nur ein Feld je Datensatz!

# func_1.alttitle
source: Record Overview
de: Datensatzübersicht

# func_1.description
source: Record overview gives you an indispensable overview of the distribution of records in the page tree. Each database table in the system is represented with a column and for each page you can see the number of records from that table located on the page.
de: Die Datensatzübersicht gibt einen guten Überblick über die Verteilung bestimmter Datensätzen innerhalb des Seitenbaumes. Jede Datenbanktabelle des Systems wird in einer eigenen Spalte dargestellt, jeweils mit der Anzahl der Datensätze dieser Tabelle, die auf der Seite enhalten sind.

# func_1.details
source: <b>Notice:</b> Be careful with the level-setting. A high level-setting may cause the module to respond very slowly if there are many pages and many records in the database as well! <b>Tree stop?</b> Notice the red "+" next to a page in the page tree? This is due to a setting for that page record which means that the page tree will not expand for this page. Typically this is set for protection when there are a large amount of subpages underneath (hundreds of pages typically). If you click the icon/title the overview will jump to make this page the new root of the overview.
de: <b>Hinweis:</b> Achten Sie auf die Ebeneneinstellung. Wenn Sie beispielsweise die Anzeige von "3 Ebenen" auswählen, kann das System eventuell sehr langsam reagieren, falls viele Seiten und entsprechend viele Datensätze in der Datenbank enthalten sind! <b>Teilansicht</b> Haben Sie das kleine rote "+" neben einigen Seiten im Seitenbaum bemerkt? Der Grund dafür ist eine Einstellung für bestimmte Seiten, die Sie daran hindern, den Seitenbaum für ihre Unterseiten aufzuklappen. Normalerweise wird diese Einstellung als Schutzmaßnahme verwendet, wenn sich unterhalb der Seiten sehr viele weitere Seiten befinden (normalerweise mehrere Hundert). Wenn Sie auf das Symbol/den Titel klicken, wird für die Übersicht diese Seite als neuer Ausgangspunkt verwendet.

# func_1.image_descr
source: You can easily see the distribution of Content Elements on a page. You can also see where Template Records - and basically any record! - are located in the page tree!
de: Beachten Sie, wie einfach Sie einen Überblick über die Verteilung der Inhaltselemente auf den Seiten bekommen. Sie können ebenfalls sehen, wo sich Vorlagendatensätze - grundsätzlich jede Art von Datensätzen - im Seitenbaum befinden.

# func_2.alttitle
source: Cache and Age
de: Cache und Alter

# func_2.description
source: Displays a selection of fields from page records related to page caching and time settings.
de: Zeigt eine Auswahl an Feldern aus Seitendatensätzen, die Informationen zum Caching der Seite und deren zeitlicher Steuerung enthalten.

# func_2.image_descr
source: The "Cache and Age" view. Here you see the "TSconfig" column. The overview exposes that these two pages include some Page TSconfig code!
de: Die Ansicht "Cache und Alter". Hier sehen Sie die Spalte "TSconfig". Die Übersicht zeigt, dass diese beiden Seiten TSconfig-Code enhalten!

# stat.alttitle
source: Page Hit statistics
de: Statistik der Seitenzugriffe

# stat.description
source: Displays website hit statistics for a branch of the page tree. Based on the simple, internal MySQL statistics table which records page impressions and sessions only.
de: Zeigt eine Zugriffsstatistik für einen bestimmten Teilbereich des Seitenbaumes. Basiert auf einer einfachen, internen Statistiktabelle, die lediglich Seitenaufrufe und Sitzungen protokolliert.

# stat.details
source: <b>Notice:</b> This function requires the extension "Simple hit statistics" (sys_stat) to be installed. Also you must configure TypoScript to register page hits in the statistics database table.
de: <b>Hinweis:</b> Diese Funktion benötigt die Erweiterung "Simple hit statistics" (sys_stat). Außerdem muss über TypoScript das Protokollieren der Seitenaufrufe aktiviert werden.

# lang.details
source: The overview uses colors to signal the availability and fall back situation for a given page. Here is a description for each color code: <b>Green background:</b> Page is translated and viewable in this language. For translations it means that an active page overlay record is present. <b>Red background:</b> Page <em>cannot</em> be viewed in this language and you will see an error message if you try. Menus should automatically filter out links to pages with this translation. <b>Gray background (not available for default language):</b> Page will fall back to the specified fallback mode for content. Depends on configuration. (sys_language_mode = content_fallback is recommended for most flexible fallback, sys_language_mode = strict will prevent this and issue an error instead!) <b>The pages "Localization settings:"</b> It is the "Localization settings" of the page record that determines the modes above. In the column of the default translation each of these settings are represented by a "N" (Hide page if no translation for current language exists) or a "D" (Hide default translation of page). As you can see the page "Startpage" has the N flag set and therefore any access to the german version of that page will be blocked with an error message because there is no translation in german. By default "german access" to a non-translated page will just show the english content. There is also a page with the D flag ("[Dummy]"). The D flag means that the page is only available in one of the translations, in this case Danish. So any attempt to access the page in the default language or german will show an error message. So, when the "Localization settings" checkboxes for a page are used, you will get an error message when you try to request a page which has been blocked. This is a feature. The trick is not to create links to those pages. Menus generated from HMENU objects will always take "sys_language" into account and display only pages which can be accessed for that language. But combined with the "localization settings" of pages which may block page access this becomes a problem with pages which are <em>not</em> translated (has gray background); You might get menu items which links to non-accessible pages. The problem basically is that "&L=xx" is different from internal "sys_language". You would like to avoid that and to do so you should configure "sys_language_mode" to "content_fallback". If you do that sys_language will <em>always</em> follow what "&L=" instructs it to and your menus will be right. At the same time you will get the default content displayed if no translation exists (because content selection falls back). Finally, the number found in each column tells you how many content elements are found in the specified language.
de: In der Übersicht werden Farben zur Kennzeichnung der Verfügbarkeit und Ausweichsituation verwendet. Die Farben haben folgende Bedeutungen: <b>Grüner Hintergrund:</b> Die Seite wurde übersetzt und kann in dieser Sprache angesehen werden. Für Übersetzungen bedeutet dies, dass ein aktiver Overlay-Datensatz für die Seite vorhanden ist. <b>Roter Hintergrund:</b> Die Seite kann <em>nicht</em> in dieser Sprache angeschaut werden, und es wird bei dem Versuch eine Fehlermeldung angezeigt. Menüs sollten Links auf diese Seite mit dieser Übersetzung automatisch ausfiltern. <b>Grauer Hintergrund (nicht bei Standardsprache):</b> Für die Seite wird der angegebene Ausweichmodus verwendet. Hängt von der Konfiguration ab. (Die Einstellung sys_language_mode = content_fallback wird für das flexibelste Verhalten empfohlen, sys_language_mode = strict verhindert dies und zeigt einen Fehler an.) <b>Die "Lokalisierungseinstellunge" der Seite:</b> Die o.g. Modi werden durch die "Lokalisierungseinstellungen" des Seitendatensatzes bestimmt. In der Spalte der Standardübersetzung werden diese Einstellungen durch ein "N" (Seite verbergen, wenn für die aktuelle Sprache keine Übersetzung vorhanden ist) oder ein "D" (Standardübersetzung der Seite verbergen) repräsentiert. Wie man sieht, ist bei der Seite "Startpage" die Flagge N gesetzt, daher wird der Zugriff auf die deutsche Version dieser Seite blockiert, da es keine deutsche Übersetzung gibt. Standardmäßig wird bei "deutschem Zugriff" auf eine nicht übersetzte Seite einfach der englische Inhalt angezeigt. Es gibt auch eine Seite mit der Flagge D ("[Dummy]"). Die Flagge D bedeutet, dass die Seite nur in einer der Sprachen verfügbar ist, in diesem Falle Dänisch. Daher wird jeder Versuch, die Seite in der Standardsprache oder Deutsch anzuzeigen, zu einer Fehlermeldung führen. Wenn also die Markierungsfelder der "Lokalisierungseinstellungen" für eine Seite eingesetzt werden, erhält man eine Fehlermeldung beim Zugriffsversuch auf eine blockierte Seite. Dies ist eine beabsichtigte Funktionalität. Wichtig ist, keine Links auf solche Seiten zu erstellen. Mit Hilfe von HMENU-Objekten erzeugte Menüs berücksichtigen stets "sys_language" und zeigen nur Seiten an, auf die für eine Sprache zugegriffen werden kann. Kombiniert mit den "Lokalisierungseinstellungen" einer Seite, über die Zugriff auf eine Seite blockiert werden kann, führt dies jedoch zu Schwierigkeiten bei Seiten, die <em>nicht</em> übersetzt wurden (mit einem grauen Hintergrund versehen sind). Es kann dazu kommen, dass Menüeinträge Links auf Seiten enthalten, auf die nicht zugegriffen werden kann. Das Problem liegt im Grunde darin, dass "&L=xx" sich vom internen "sys_language" unterscheidet. Sie sollten das vermeiden und dazu "sys_language_mode" auf "content_fallback" setzen. Dann befolgt "sys_language" <em>immer</em> die über "&L=" gegebene Anweisung und die Menüs sind korrekt. Gleichzeitig wird der Standardinhalt angezeigt, falls keine Übersetzung vorhanden ist (weil die Inhaltsauswahl dem Ausweichweg folgt). Schließlich zeigt die Zahl in jeder Spalte an, wie viele Elemente in der angegebenen Sprache gefunden wurden.

# lang.image_descr
source: Localization overview in the Web>Info module. Use the buttons to edit, view and create new page translation headers. Use the regular page module to put localized content on the pages. The "Localization settings" that affect availability of pages in the various languages.
de: Übersetzungsübersicht innerhalb des Moduls Web>Info. Benutzen Sie die Schaltflächen, um Übersetzungen von Seitenüberschriften anzuzeigen, zu bearbeiten oder neu zu erstellen. Verwenden Sie das normale Seitenmodul, um Inhalte zu übersetzen. Die "Lokalisierungseinstellungen" beeinflussen die Verfügbarkeit der Seiten in den verschiedenen Sprachen.

# func_hits.alttitle
source: Statistic Views
de: Statistikansichten

# func_hits.description
source: You can select between three views of the statistics in the selector box; "Page hits", "Total hits", "Hits in main sections". Use the right selector box to select the depth of the overview in the pagetree.
de: Es stehen drei unterschiedlichen Statistikansichten zur Wahl: "Seitenzugriffe", "Zugriffe insgesamt" und "Zugriffe auf Hauptbereiche". Benutzen Sie das Auswahlfeld, um die Anzeigetiefe der Übersicht zu bestimmen.

# func_hits.details
source: You can view the page hit statistics 30 days back. Each day is shown in its own column. For each page in the page tree you can see the page hits each day as a number formatted like [page hits]/[user sessions]. So if the number is "286/34" it means that the page had 286 page hits that day and that there were at least 34 unique visitors (measured by at least two hits by a user accepting a cookie from the site). This is an overview of the meaning of each view mode: <b>Page hits</b> This shows page hits/sessions for each page. <b>Total hits</b> This will show statistics for only pages that have a Template Record (with Root-flag set) on it. This means that page hits are shown as totals for a whole website. <b>Hits in main sections</b> Will show the total number of page hits/sessions within main sections of a website. A "main section" is all subpages to a page on the first level of a website (defined by a Template Record with the Root flag set)
de: Die Seitenzugriffsstatistik liefert eine Übersicht der letzten 30 Tage. Jeder Tag wird dabei in einer eigenen Spalte dargestellt. Für jede Seite innerhalb des Seitenbaums werden dabei die Seitenzugriffe durch eine Zahl im Format [Seitenzugriffe]/[Benutzersitzungen] dargestellt. Also bedeutet "286/34" bespielsweise, dass die Seite an diesem Tag 286 Zugriffe von mindestens 34 unterschiedlichen Besuchern hatte (Benutzersitzungen werden dabei anhand von Cookies unterschieden). Die Bedeutung der einzelnen Ansichten: <b>Seitenzugriffe</b> Zeigt Seitenzugriffe/Benutzersitzungen für jede Seite. <b>Zugriffe insgesamt</b> Zeigt Statistiken nur für diejenigen Seiten, welche einen Template-Datensatz (mit gesetzter Root-Flagge) haben. Alle Seitenzugriffe werden hier also für die gesamte Website aufsummiert angezeigt. <b>Zugriffe auf Hauptbereiche</b> Zeigt die Anzahl der Seitenzugriffe/Benutzersitzungen innerhalb der Hauptbereiche der Website. Ein "Hauptbereich" umfasst dabei alle Unterseiten einer Seite der ersten Ebene des Seitenbaums (definiert durch einen Template-Datensatz mit gesetzter Root-Flagge). In der Abbbildung wären das also zum Beispiel alle Seiten unterhalb von "TypoScript examples".

# lang.alttitle
source: Localization overview
de: Übersetzungsübersicht

# lang.description
source: Gives an overview of which pages in the page tree are translated to the system languages installed.
de: Zeigt eine Übersicht der Seiten, welche in die installierten Systemsprachen übersetzt wurden.
