Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/cms/*.locallang_csh_weblayout.xlf
Languages: de

# .alttitle
source: Web > Page Module
de: Web > Seite

# .description
source: The page module is activated from the backend menu and is the primary module for all basic CMS operations you need to perform when maintaining website content.
de: Das Modul "Seite" wird aus dem Backend-Menü heraus angewählt und ist das wichtigste Modul für alle grundlegenden CMS-Operationen, die für die Pflege einer Website erforderlich sind.

# .details
source: Selecting the module will display the page tree. Click the title of the page you wish to edit content on, and in the right frame you will see the content of the page displayed by the Page module. The page module has various modes of display of content; <b>Columns</b> The columns view will show Content Elements listed in the columns and in the order that they will appear on the website. A panel of buttons will allow you to hide/unhide, move and edit the elements easily. <b>QuickEdit</b> In QuickEdit the first element on the page will be loaded into a form right away. It will depend on the implementation of your website as well as your general preferences if you like this mode more than the columns view. <b>Languages</b> If your site supports multiple languages and uses the "one-tree-fits-all" concept for localization you will need this mode to control the translations of the content elements on a page. <b>Page information</b> The page information view shows some statistical data about a page. This includes hit statistics if available. <b>General options</b> In the top of the Page module you will find a row of icons that will bring you right to various features such as History/Undo (1), Create new content element (2), Move page (3), Create new page (4) and Edit page properties (5). See image below. <b>Defining number of displayed columns [Admin]</b> Administrators can configure the Page module to display only the content columns that the website uses. This is done by Page TSconfig (so it can be configured per branch in the page tree!) and this particular option has the object path "mod.web_layout.tt_content.colPos_list". For instance "mod.web_layout.tt_content.colPos_list = 0,3" will set the display of the "Normal" and "Border" columns only. There are many other options for customization of the Page module in the object path "mod.web_layout" and Administrators should refer to the "TSconfig" reference linked to below.
de: Bei Auswahl dieses Moduls wird der Seitenbaum angezeigt. Ein Klick auf den Titel der zu bearbeitenden Seite, und ganz rechts wird der Inhalt der Seite kompakt angezeigt. Die Darstellung entspricht <em>nicht</em> dem Aussehen auf der Website, sondern bietet eine Übersicht und erlaubt eine einfache Bearbeitung. Dazu bietet das Modul "Seite" verschiedene Ansichten: <strong>Spalten</strong> Der Begriff "Spalte" ist nicht zu wörtlich zu nehmen: es handelt sich eher um logische Bereiche einer Seite der Website. Man kann zwar davon ausgehen, dass die Spalte "Normal" im zentralen Bereich einer Seite dargestellt wird, aber die anderen Spalten/Bereiche können durchaus an anderen Stellen erscheinen als ihr Name erwarten lässt. Wenden Sie sich an den Administrator. In der Spaltenansicht werden die Inhaltselemente einerseits in Spalten (Bereichen) und andererseits in der Reihenfolge angezeigt, in der sie auf der Website erscheinen. Ein Satz großer Schaltflächen erlaubt es, die vier wichtigsten Operationen vorzunehmen: Man kann mit "Seitentitel bearbeiten" die Seite selbst (ihre grundsätzlichen Einstellungen) bearbeiten, die ganze Seite (mit allem Inhalt) im Seitenbaum verschieben, die ganze Seite (und allen Inhalt) löschen sowie ein neues Inhaltselement am Ende der Seite hinzufügen. Eine Reihe von Symbolen direkt über jedem Inhaltselement eröffnen weitere Möglichkeiten, wie etwa das Bearbeiten, Verbergen/Anzeigen und Löschen eines einzelnen Elements. Weitere Symbole an verschiedenen Stellen erlauben noch mehr Möglichkeiten. Schieben Sie die Maus über ein Symbol, um eine kurze Beschreibung der Option zu erhalten. Die sehr häufig benötigte Möglichkeit der Änderung eines einzelnen Elements mit allen Optionen ist erreichbar, indem man einfach auf die Textvorschau klickt. <strong>Schnelleingabe</strong> In dieser Sicht wird das jeweils erste Inhaltselement automatisch in einem Formular zur direkten Bearbeitung angezeigt. Ganz unten befindet sich außerdem eine Übersicht über die vorhandenen Inhaltselemente. Dort können andere Elemente zur Bearbeitung ausgewählt, neue Elemente eingeschoben oder angehängt werden. Es kann durchaus sein, dass Sie diese Sicht bevorzugen, das hängt aber, neben Ihrer persönlichen Sicht, ein wenig von der Art und Weise ab, in der die Website angelegt ist. <strong>Sprachen</strong> Wenn die Website in mehreren Sprachen angeboten wird und das Konzept "alles-in-einem-Baum" für die Lokalisierung verfolgt, wird dieser Modus zur Handhabung der Übersetzungen benötigt. <strong>Seiteninformationen</strong> Diese Sicht zeigt einige statistische Daten der Seite. Auch Trefferstatistiken werden hier gezeigt, wenn eine entsprechende Erweiterung (z.B. AWStats) installiert ist. <strong>Allgemeine Optionen</strong> Im oberen Bereich des Moduls "Seite" befindet sich eine weitere Reihe von Symbolen, die weitere Möglichkeiten bieten: (1) einen Verlauf der Änderungen zeigen und rückgängig machen (2) die Erzeugung eines neuen Inhaltselements (3) das Verschieben einer kompletten Seite (4) das Erzeugen einer neuen Seite (5) die Bearbeitung der Seiteneigenschaften Siehe die Abbildung unten. <strong>Anzahl der Spalten festlegen [Technisch]</strong> Nicht alle Websites benutzen alle der vier vordefinierten Spalten. Erfahrene Administratoren (bzw. die Entwickler des Auftritts) können das Modul "Seite" leicht so konfigurieren, dass nur die Spalten sichtbar werden, welche die Website benötigt. Dies geschieht im "TSconfig" einer Seite (so dass verschiedene Zweige des Auftritts unterschiedlich viele Spalten haben können!). Die Seiten-"TSconfig" für die Beschränkung auf die Spalten "Normal" und "Rand" sieht etwa so aus: <em>mod.web_layout.tt_content.colPos_list = 0,3</em> Es gibt eine große Anzahl weiterer Möglichkeiten zur Konfiguration einzelner Seiten und ihrer Kindseiten. Bitte konsultieren Sie die "TSconfig"-Referenz, den Querverweis finden Sie unten.

# _.seeAlso
source: Configuring the Page module [Technical] | http://typo3.org/documentation/document-library/doc_core_tsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, About the page module | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Editing a page | http://typo3.org/documentation/document-library/doc_tut_quickstart/Edit_page/ The Page Module (Animation) | Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
de: Konfiguration des Moduls "Seite" [technisch] | http://typo3.org/documentation/document-library/doc_core_tsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, Über das Modul "Seite" | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Bearbeiten einer Seite | http://typo3.org/documentation/document-library/doc_tut_quickstart/Edit_page/ Das Modul "Seite" (Animation) | Verwendung des Seitenbaums (Animation) | FILE:EXT:welcome/modsub/ani_05.gif

# .image_descr
source: Click the Page module, then the title of a page in the page tree. The page module is now activated in the right frame, showing the content of the page you clicked in the page tree. These buttons are direct links to the History/Undo function (1), Create new content element wizard (2), Move page wizard (3), Create new page wizard (4) and Edit page properties form (5). See the links for more details.
de: Klicken Sie auf das Modul "Seite", dann auf den Titel der zu bearbeitenden Seite. Das Modul "Seite" ist nun aktiv und zeigt Ihnen ganz rechts eine Inhaltsübersicht der gewünschten Seite. Diese Symbole aktivieren umgehend (1) Verlauf/Rückgängig, (2) den Assistenten für ein neues Inhaltselement, (3) den Assistenten zum Verschieben der Seite, (4) den Assistenten zum Erzeugen einer neuen Seite und (5) das Formular zur Bearbeitung der Seite selbst. Weitere Informationen siehe unten.

# quickEdit.alttitle
source: Quick Edit
de: Schnelleingabe

# quickEdit.description
source: The Quick Editor gives you direct access to the form fields of the page content.
de: Die Schnelleingabe bietet den direkten Zugiff auf die Formularfelder von Inhaltselementen.

# quickEdit.details
source: The Quick Editor is designed to cut down the number of clicks involved in getting to edit the page content. Simply by clicking the page title in the page tree you've got the first content element in the normal column loaded in the list frame. In the toolbar in the top you can select the other content elements on the page in the selector box.
de: Die Schnelleingabe ist dafür ausgelegt, die Anzahl von Klicks zur Bearbeitung von Inhaltselementen zu minimieren. Schon bei der Auswahl einer Seite aus dem Seitenbaum wird das erste Element des Inhalts der Spalte "Normal" zur direkten Bearbeitung angeboten. Am oberen Rand des Formulars können Änderungen gespeichert oder verworfen werden. Am unteren Ende des Formulars lassen sich schnell andere Elemente zur direkten Bearbeitung auswählen.

# quickEdit.image_descr
source: The QuickEdit view cuts of one extra click by bringing the user directly to the editing form after clicking a page title in the page tree. The record shown is always the first content element from the Normal column.
de: Die Schnelleingabe spart einen Klick und bietet Ihnen sofort das Bearbeitungsformular an, wenn Sie eine Seite im Seitenbaum aktivieren. Das zunächst angebotene Element ist immer das erste Element in der Spalte "Normal".

# quickEdit_selElement.alttitle
source: Content Elements
de: Inhaltselemente

# quickEdit_selElement.description
source: This is an overview of the content elements on this page in QuickEdit mode. Select another element to edit or click a "New" icon to create a new content element.
de: Dies ist eine Übersicht der Inhaltselemente dieser Seite im Modus Schnelleingabe. Wählen Sie ein anderes Element zur Bearbeitung oder klicken Sie eines der "Neu"-Symbole an, um ein neues Element an der ensprechenden Stelle einzufügen.

# quickEdit_selElement.image_descr
source: Overview of page content elements in the QuickEdit view. In the bottom there are links to two wizards: The "Move Content Element Wizard" and the "Create new Content Element Wizard". See the links below.
de: Übersicht der Seitenelemente im Modus Schnelleingabe. Ganz unten können zwei Assistenten gestartet werden: "Inhaltselement verschieben" und "Neues Inhaltselement anlegen". Siehe unten.

# columns_1.alttitle
source: Listing by Column
de: Spaltenansicht

# columns_1.description
source: In the "Columns" view you can control the content of the web page as it is positioned in columns.
de: Gezeigt wird der Inhalt der Web-Seite angeordnet in Spalten (Bereiche).

# columns_2.alttitle
source: Listing by Language
de: Überblick nach Sprachen

# columns_2.description
source: In the "Languages" view you can control the content of the web page as it is divided into languages and columns.
de: In dieser Sicht können Sie den Inhalt der Web-Seite sehen, angeordnet sowohl in Spalten (Bereichen) als auch in Sprachen.

# _columns_2.seeAlso
source: Article about localization | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/
de: Artikel zum Thema Lokalisierung (englisch) | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/

# columns_3.alttitle
source: Page Information
de: Seiteninformationen

# columns_3.description
source: In the "Page Information" view you can see various statistics about a page.
de: Im Modus Seiteninformationen lassen sich verschiedene Statistiken zur Web-Seite einsehen.

# columns_3.details
source: The page information reveals information such as the date of creation and last modification of the page and its content. You can also see the subtitle, keywords and descriptions. This information is often used on websites for meta data or searching.
de: Die Seiteninformationen zeigen Informationen wie etwa das Erstellungsdatum, das Datum der letzten Änderung der Seite und der Inhaltselemente. Untertitel, Schlüsselworte und Beschreibungen sind ebenfals sichtbar. Diese Informationen (die Metadaten) werden oft zur Suche benutzt.

# language_list.alttitle
source: Language view
de: Sprachenansicht

# language_list.description
source: This view will display the available translations of the page content side-by-side. It enables users to create a new translation of a page.
de: Diese Sicht zeigt die verfügbaren Übersetzungen der Seiteninhalte nebeneinander. Hier lassen sich neue Übersetzungen der Inhalte leicht bearbeiten.

# language_list.image_descr
source: In the Language view you can select to create a new translation of the page if one does not exist already. The available languages must be defined first by language records created in the root of the page tree. This example shows how page content for three languages is shown side-by-side in the Page module. In the top of the Page module you can also select between the available translations... ... and if you select any of the additional languages (here "Danish" and "German") you will see the default language displayed side-by-side with the selected language
de: In der Sprachenansicht können Sie eine Sprache zur Eingabe auswählen, falls sie noch nicht vorhanden ist. Die verfügbaren Sprachen müssen aber zuvor in der Wurzel des Seitenbaums eingerichtet worden sein. Dieses Beispiel zeigt den Inhalt der Seite für drei Sprachen nebeneinander. Oben im Seitenmodul kann zwischen den verfügbaren Übersetzungen gewählt werden... ...und wenn man eine der zusätzlichen Sprachen auswählt (hier Dänisch und Deutsch), wird die Standardsprache Seite an Seite mit der gewählten Sprache angezeigt.

# columns_single.alttitle
source: Page content elements in a single column
de: Seiteninhaltselemente in einer einzelnen Spalte.

# columns_single.description
source: The single column view will show the page content elements that define the content on this page of your website. Click an edit icon or element text to edit an element.
de: Die Sicht auf eine einzelne Spalte zeigt die Inhaltselemente für diese Seite der Website. Zum Bearbeiten eines Elements auf ein Bearbeitungssysmbol (kleiner Stift) oder den Text des Elements klicken.

# columns_single.details
source: You can also hide, delete and move elements by using the control panels. Clicking the "New content element" icon you will be able to create new content elements in between the existing elements on the page. Click the icon of a content element if you wish to access the context menu of the element.
de: Sie können Elemente außerdem verbergen, löschen und verschieben. Verwenden Sie dazu die Symbole des Bedienfeldes. Mit Hilfe des Symbols "Neues Element" lassen sich einfach neue Inhalte zwischen den vorhandenen Elementen einfügen. Das Symbol des Inhaltselements zeigt beim Klicken ein Kontextmenü, das weitere Möglichkeiten bietet.

# columns_single.image_descr
source: Content Elements on a page are arranged in a specific order - the order they appear on the website. This order is also shown in the page module. The control panel allows you to move elements up and down as well as edit, hide and delete them. You can also just click the preview text shown here to access the editing form of the element.
de: Inhaltselemente werden im Modul "Seite" sortiert gezeigt - in der Reihenfolge, in der sie auch auf der Website angezeigt werden. Das Bedienfeld erlaubt es, Elemente nach oben/unten zu verschieben und sie zu bearbeiten, zu verbergen oder zu löschen. Ein Klick auf den Vorschautext ruft ebenfalls das Bearbeitungsformular auf.

# columns_multi.alttitle
source: Page content elements in a multiple columns
de: Inhaltselemente der Seite in mehreren Spalten.

# columns_multi.description
source: The multiple column view will show the content of your website arranged in multiple columns. This is the case if your website supports more than one content zone and the content elements from each zone is arranged in "columns".
de: Die Sicht auf mehrere Spalten zeigt die Inhaltselemente einer Seite in Spalten angeordnet. Das ist dann der Fall, wenn die Website mehrere Bereiche (Zonen) für Inhalt vorsieht und die Bereiche in "Spalten" organisiert sind.

# columns_multi.image_descr
source: When your website supports multiple content element zones in the template you will be able to use another column than the "Normal" column. Here the "Left" column is enabled. TYPO3 offers four columns by default, "Normal", "Right", "Left" and "Border". Their significance depends on individual implementations in the frontend templates.
de: Wenn die Website mehrere Bereiche für Inhaltselemente vorsieht (durch entsprechende Konfiguration der Vorlage) können neben der Spalte "Normal" Inhalte auch in anderen Spalten untergebracht werden. Hier ist zusätzlich die Spalte "Links" aktiviert. TYPO3 bietet standardmäßig bis zu vier Spalten an: "Normal", "Links", "Rechts" und "Rand". Ihre Bedeutung und die Darstellung auf der Website hängt von der Konfiguration der Vorlage ab. Wenden Sie sich an Ihren Administrator.

# button_panel.alttitle
source: The "Big Buttons"
de: Die "großen Schaltflächen"

# button_panel.description
source: These buttons will bring you to four most used functions in relation to building pages. From here you can edit the page properties (eg. the page title), you can move the current page to another position in the page tree, create a new page somewhere in the page tree or create new content elements on this page.
de: Über diese Schaltflächen erreichen Sie die vier wichtigsten Funktionen zur Bearbeitung von Seiten und Inhaltselementen. Sie können die Seiteneigenschaften (z.B. den Seitentitel) bearbeiten, die komplette Seite an eine andere Stelle des Seitenbaums verschieben, eine neue Seite irgendwo im Seitenbaum erzeugen oder ein neues Inhaltselement auf der aktuellen Seite anlegen.
