Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/cms/*.locallang_tca.xlf
Languages: de

# mod_tx_cms_webinfo_page
source: Pagetree Overview
de: Seitenbaumübersicht

# mod_tx_cms_webinfo_lang
source: Localization Overview
de: Übersetzungsübersicht

# pages.palettes.standard
source: Page
de: Seite

# pages.palettes.title
source: Title
de: Titel

# pages.palettes.visibility
source: Visibility
de: Sichtbarkeit

# pages.palettes.access
source: Publish Dates and Access Rights
de: Veröffentlichungsdaten und Zugriffsrechte

# pages.palettes.abstract
source: Abstract
de: Zusammenfassung

# pages.palettes.editorial
source: Editorial
de: Redaktion

# pages.palettes.layout
source: Page Layout
de: Seitenlayout

# pages.palettes.module
source: Use as Container
de: Benutze als Container

# pages.palettes.replace
source: Replace Content
de: Ersetze den Inhalt

# pages.palettes.links
source: Links to this Page
de: Links zu dieser Seite

# pages.palettes.language
source: Language
de: Sprache

# pages.palettes.miscellaneous
source: Miscellaneous
de: Sonstige

# pages.palettes.media
source: Files
de: Dateien

# pages.palettes.storage
source: General Record Storage Page
de: Allgemeine Datensatzsammlung

# pages.palettes.config
source: TypoScript Configuration
de: TypoScript-Konfiguration

# pages.doktype_formlabel
source: Type
de: Typ

# pages.doktype.I.0
source: Advanced
de: Erweitert

# pages.doktype.I.2
source: Shortcut
de: Verweis

# pages.doktype.I.3
source: Not in Menu
de: Nicht im Menü

# pages.doktype.I.4
source: Backend User Section
de: Backend-Benutzerbereich

# pages.doktype.I.5
source: Mount Point
de: Einstiegspunkt

# pages.doktype.I.7
source: Menu Separator
de: Trennzeichen für Menü

# pages.doktype.I.8
source: Link to External URL
de: Link zu externer URL

# pages.doktype.div.page
source: Page
de: Seite

# pages.doktype.div.special
source: Special
de: Spezial

# pages.title_formlabel
source: Page Title
de: Seitentitel

# pages.starttime_formlabel
source: Publish Date
de: Veröffentlichungsdatum

# pages.endtime_formlabel
source: Expiration Date
de: Ablaufdatum

# pages.fe_group_formlabel
source: Usergroup Access Rights
de: Zugriffsrechte für Benutzergruppen

# pages.hidden
source: Hide page:
de: Seite verbergen:

# pages.hidden_formlabel
source: Page
de: Seite

# pages.hidden_checkbox_1_formlabel
source: Disable
de: Deaktivieren

# pages.url_scheme
source: Enforce Protocol:
de: Protokoll erzwingen:

# pages.url_scheme_formlabel
source: Use Protocol
de: Benutze Protokoll

# pages.extendToSubpages
source: Include Subpages:
de: Inklusive Unterseiten:

# pages.extendToSubpages_formlabel
source: Extend to Subpages
de: Auf Unterseiten ausdehnen

# pages.nav_title
source: Navigation Title:
de: Navigationstitel:

# pages.nav_title_formlabel
source: Alternative Navigation Title
de: Alternativer Navigationstitel

# pages.nav_hide
source: Hide in Menu:
de: Im Menü verbergen:

# pages.nav_hide_formlabel
source: In Menus
de: In Menüs

# pages.nav_hide_checkbox_1_formlabel
source: Hide
de: Verbergen

# pages.subtitle
source: Subtitle:
de: Untertitel:

# pages.subtitle_formlabel
source: Subtitle
de: Untertitel

# pages.target
source: Target:
de: Zielfenster:

# pages.target_formlabel
source: Link Target
de: Linkziel

# pages.alias
source: Alias:
de: Adress-Alias:

# pages.urltype_formlabel
source: Protocol
de: Protokoll

# pages.lastUpdated
source: Last Updated:
de: Letzte Aktualisierung:

# pages.lastUpdated_formlabel
source: Last Update
de: Letzte Aktualisierung

# pages.newUntil
source: 'New' Until:
de: "Neu" bis:

# pages.newUntil_formlabel
source: Mark as 'New' Until
de: Markiere als 'Neu' bis

# pages.cache_timeout
source: Cache Expires:
de: Cache verfällt:

# pages.cache_timeout_formlabel
source: Cache Lifetime
de: Cache-Dauer

# pages.cache_timeout.I.5
source: 1 hour
de: 1 Stunde

# pages.cache_timeout.I.6
source: 4 hours
de: 4 Stunden

# pages.cache_timeout.I.7
source: 1 day
de: 1 Tag

# pages.cache_timeout.I.8
source: 2 days
de: 2 Tage

# pages.cache_timeout.I.9
source: 7 days
de: 7 Tage

# pages.cache_timeout.I.10
source: 1 month
de: 1 Monat

# pages.editlock_formlabel
source: Editable for Admins Only
de: Bearbeitbar nur für Administratoren

# pages.tabs.metadata
source: Metadata
de: Metadaten

# pages.tabs.files
source: Resources
de: Ressourcen

# pages.tabs.resources
source: Resources
de: Ressourcen

# pages.tabs.access
source: Access
de: Zugriff

# pages.tabs.options
source: Options
de: Optionen

# pages.tabs.mount
source: Mount
de: Einbindung

# pages.tabs.shortcut
source: Shortcut
de: Verweis

# pages.tabs.extended
source: Extended
de: Erweitert

# pages.tabs.appearance
source: Appearance
de: Erscheinungsbild

# pages.tabs.behaviour
source: Behaviour
de: Verhalten

# pages.no_cache
source: No Cache:
de: Nicht cachen:

# pages.no_cache_checkbox_1_formlabel
source: Disable
de: Deaktivieren

# pages.no_search
source: No Search:
de: Nicht suchen:

# pages.no_search_formlabel
source: Include in Search
de: In Indexsuche einbeziehen

# pages.no_search_checkbox_1_formlabel
source: Disable
de: Deaktivieren

# pages.shortcut_mode
source: Shortcut Mode:
de: Verweismodus:

# pages.shortcut_mode_formlabel
source: Shortcut Mode
de: Verweismodus

# pages.shortcut_mode.I.0
source: Selected page
de: Ausgewählte Seite

# pages.shortcut_mode.I.1
source: First subpage of selected/current page
de: Erste Unterseite der aktuellen Seite

# pages.shortcut_mode.I.2
source: Random subpage of selected/current page
de: Zufällige Unterseite der aktuellen Seite

# pages.shortcut_mode.I.3
source: Parent page of selected/current page
de: Oberseite der aktuellen Seite

# pages.shortcut_formlabel
source: Shortcut Target
de: Verweisziel

# pages.content_from_pid
source: Show content from this page instead:
de: Inhalt dieser Seite anzeigen:

# pages.content_from_pid_formlabel
source: Show Content from Page
de: Zeige Inhalt von Seite

# pages.mount_pid
source: Mount Point (advanced):
de: Einstiegspunkt (erweitert):

# pages.mount_pid_formlabel
source: Mounted page
de: Einstiegsseite

# pages.mount_pid_ol
source: Substitute Mount Point (this page) with Mounted page:
de: Einstiegspunkt (diese Seite) durch eingebundene Seite ersetzen:

# pages.mount_pid_ol_formlabel
source: Show Content from
de: Zeige Inhalt von

# pages.mount_pid_ol.I.0
source: This Page
de: Diese Seite

# pages.mount_pid_ol.I.1
source: Mounted Page
de: Einstiegsseite

# pages.abstract
source: Abstract:
de: Inhaltsangabe:

# pages.abstract_formlabel
source: Abstract
de: Inhaltsangabe

# pages.keywords_formlabel
source: Keywords
de: Schlagworte

# pages.description_formlabel
source: Description
de: Beschreibung

# pages.author_formlabel
source: Author Name
de: Name des Autors

# pages.author_email_formlabel
source: Author Email
de: E-Mail des Autors

# pages.media
source: Files:
de: Dateien:

# pages.php_tree_stop_formlabel
source: Stop Page Tree
de: Seitenbaum stoppen

# pages.is_siteroot
source: Is Root of Website:
de: Ist Anfang der Website:

# pages.is_siteroot_formlabel
source: Use as Root Page
de: Als Anfang der Website benutzen

# pages.module
source: Contains Plugin:
de: Enthält Plug-In:

# pages.module_formlabel
source: Contains Plugin
de: Enthält Erweiterung

# pages.module.I.2
source: Board
de: Forum

# pages.module.I.4
source: Website Users
de: Website-Benutzer

# pages.module.I.6
source: Approvals
de: Abstimmungen

# pages.l18n_cfg
source: Localization Settings:
de: Lokalisierungseinstellungen:

# pages.l18n_cfg_formlabel
source: Localization
de: Lokalisierung

# pages.l18n_cfg.I.1
source: Hide default translation of page
de: Standardübersetzung verbergen

# pages.l18n_cfg.I.2
source: Hide page if no translation for current language exists
de: Seite verbergen, wenn keine Übersetzung für die aktuelle Sprache vorhanden ist

# pages.l18n_cfg.I.2a
source: Show page even if no translation exists
de: Seite anzeigen, auch wenn keine Übersetzung vorhanden ist

# pages.fe_login_mode
source: Login Mode:
de: Anmeldemodus:

# pages.fe_login_mode_formlabel
source: Login Behaviour
de: Anmeldeverhalten

# pages.fe_login_mode.disable
source: Disable
de: Sperren

# pages.fe_login_mode.enable
source: Enable login
de: Benutzeranmeldung freigeben

# pages.fe_login_mode.disableAll
source: Disable login
de: Benutzeranmeldung deaktivieren

# pages.fe_login_mode.disableGroups
source: Enable user login, Disable usergroup login
de: Anmeldung für Benutzer freigeben, aber für Benutzergruppen deaktivieren

# pages.fe_login_mode.enableAgain
source: Re-Enable login
de: Anmeldung wieder freigeben

# pages.storage_pid_formlabel
source: Page
de: Seite

# pages.TSconfig_formlabel
source: Page TSConfig
de: Seiten-TSconfig

# pages.backend_layout_formlabel
source: Backend Layout (this page only)
de: Backend-Layout (nur für diese Seite)

# pages.backend_layout_next_level_formlabel
source: Backend Layout (subpages of this page)
de: Backend-Layout (für Unterseiten dieser Seite)

# pages.backend_layout.none
source: None
de: Keins

# tt_content
source: Page Content
de: Seiteninhalt

# fe_users
source: Website User
de: Website-Benutzer

# fe_users.username
source: Username:
de: Benutzername:

# fe_users.password
source: Password:
de: Passwort:

# fe_users.usergroup
source: Groups:
de: Benutzergruppe:

# fe_users.lockToDomain
source: Lock to Domain:
de: An Domäne binden:

# fe_users.tabs.personelData
source: Personal Data
de: Persönliche Daten

# fe_users.tabs.access
source: Access
de: Zugriff

# fe_users.tabs.options
source: Options
de: Optionen

# fe_users.tabs.extended
source: Extended
de: Erweitert

# fe_groups
source: Website Usergroup
de: Website-Benutzergruppe

# fe_groups.title
source: Group Title:
de: Gruppenname:

# fe_groups.lockToDomain
source: Lock to Domain:
de: An Domäne binden:

# fe_groups.subgroup
source: Subgroups:
de: Untergruppen:

# fe_groups.tabs.options
source: Options
de: Optionen

# fe_groups.tabs.extended
source: Extended
de: Erweitert

# sys_domain
source: Domain
de: Domäne

# sys_domain.domainName
source: Domain:
de: Domäne:

# sys_domain.redirectTo
source: Redirect to:
de: Umleiten nach:

# sys_domain.redirectHttpStatusCode
source: HTTP Status Code for the Redirect:
de: HTTP-Statuscode für Umleitung:

# sys_domain.redirectHttpStatusCode.301
source: Moved permanently (301)
de: Dauerhaft verschoben (Moved permanently, 301)

# sys_domain.redirectHttpStatusCode.302
source: Found (302)
de: Gefunden (Found, 302)

# sys_domain.redirectHttpStatusCode.303
source: See Other (303)
de: Siehe andere (See Other, 303)

# sys_domain.redirectHttpStatusCode.307
source: Moved Temporarily (307)
de: Temporär verschoben (Moved Temporarily, 307)

# sys_domain.prepend_params
source: Transfer parameters to Redirect URL:
de: Parameter zur Umleitungs-URL übertragen:

# sys_domain.forced
source: Always prepend this domain in links:
de: In Links immer diese Domain voranstellen:

# sys_template.title
source: Template Title:
de: Template-Titel:

# sys_template.root
source: Rootlevel:
de: Wurzelebene:

# sys_template.clear
source: Clear:
de: Löschen:

# sys_template.sitetitle
source: Website Title:
de: Website-Titel:

# sys_template.constants
source: Constants:
de: Konstanten:

# sys_template.resources
source: Resources:
de: Ressourcen:

# sys_template.nextLevel
source: Template on Next Level:
de: Template nächste Ebene:

# sys_template.include_static_file
source: Include static (from extensions):
de: Statische Templates einschließen (aus Erweiterungen):

# sys_template.basedOn
source: Include Basis Template:
de: Basis-Template einschließen:

# sys_template.includeStaticAfterBasedOn
source: Include Static Templates After Basis Templates:
de: Statische Templates nach Basis-Template einschließen:

# sys_template.editorcfg
source: Backend Editor Configuration:
de: Konfiguration Backend-Editor:

# sys_template.description
source: Description:
de: Beschreibung:

# sys_template.static_file_mode
source: Static Template Files from TYPO3 Extensions:
de: Statische Template-Dateien aus Erweiterungen:

# sys_template.static_file_mode.0
source: Default (include before if root flag is set)
de: Standard (einschließen vor, wenn Wurzel-Option gesetzt)

# sys_template.static_file_mode.1
source: Always include before this template record
de: Stets vor diesem Template-Datensatz einschließen

# sys_template.static_file_mode.2
source: Never include before this template record
de: Nie vor diesem Template-Datensatz einschließen

# sys_template.static_file_mode.3
source: Include before all static templates if root flag is set
de: Vor allen statischen Templates einfügen, wenn die Wurzel-Option gesetzt ist.

# sys_template.basedOn_add
source: Add New Basis Template
de: Neues Basis-Template hinzufügen

# sys_template.tabs.files
source: Resources
de: Ressourcen

# sys_template.tabs.include
source: Includes
de: Enthält

# sys_template.tabs.options
source: Options
de: Optionen

# sys_template.tabs.access
source: Access
de: Zugriff

# pages_language_overlay
source: Alternative Page Language
de: Alternative Seitensprache

# backend_layout.title
source: Title
de: Titel

# backend_layout.description
source: Description
de: Beschreibung

# backend_layout.config
source: Config
de: Konfiguration

# backend_layout.wizard
source: Wizard
de: Assistent

# backend_layout.icon
source: Icon
de: Symbol
