Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/t3editor/*.locallang.xlf
Languages: de

# deactivate
source: Deactivate t3editor
de: T3Editor deaktivieren

source: File
de: Datei

source: Constants
de: Konstanten

source: Unknown content type:
de: Unbekannter Inhaltstyp:

# pageIDInteger
source: Syntax error: Parameter pageID must be a valid integer.
de: Syntaxfehler: Der Parameter pageID muss vom Typ Integer sein.

# noPermission
source: Access denied: No permission to template records.
de: Zugriff verweigert: Keine Zugriffsrechte auf Template-Datensätze vorhanden.

# typeIDMissing
source: Syntax error: At least parameter typeID has to be supplied.
de: Syntaxfehler: Es muss mindestens der Parameter typeID angegeben werden.

# js.label_lines
source: lines
de: Zeilen

# js.label_documentModified
source: document has been modified
de: Das Dokument wurde verändert.

# js.label_errorWhileSaving
source: An error occured while saving the data.
de: Während des Speicherns der Daten ist ein Fehler aufgetreten.
