Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/scheduler/mod1/*.locallang_csh_scheduler.xlf
Languages: de

# .alttitle
source: Scheduler
de: Planer

# .description
source: The Scheduler provides an interface to register and manage recurring or one-time tasks.
de: Der Planer stellt eine Schnittstelle zur Verfügung, um einmalige oder wiederkehrende Aufträge (Tasks) zu erstellen und zu bearbeiten.

# .syntax
source: The Scheduler uses a single cron job to handle all registered tasks. It is thus very convenient as only one cron job needs to be set up and all task frequencies can be managed from the BE module.
de: Der Planer nutzt einen einzigen Cron-Job, der alle registrierten Tasks abarbeitet. Dies ist sehr praktisch, da nur ein einziger Cron-Job eingerichtet werden muss und über das Backend-Modul die Häufigkeiten aller Tasks verwaltet werden können.

# task_class.alttitle
source: Class of the task
de: Klasse des Tasks

# task_class.description
source: Choose a class from the list of available tasks
de: Wählen Sie eine Klasse aus der Liste der verfügbaren Tasks.

# task_class.details
source: Some tasks are provided by the TYPO3 Core itself. Others come from extensions. See the manual to learn how to create your own tasks and register them with the Scheduler.
de: Einige Tasks werden durch den TYPO3-Kern selbst bereitgestellt. Andere kommen von unterschiedlichen Erweiterungen. Bitte beachten Sie das Handbuch, wie eigene Tasks erstellt und dem Planer hinzugefügt werden können.

# task_disable.alttitle
source: Disable task
de: Task deaktivieren

# task_disable.description
source: Check this box to disable the automatic, scheduled execution of this task. It can still be launched manually from the BE module.
de: Aktivieren Sie diese Option, um die geplante Ausführung dieses Tasks zu deaktivieren. Die Ausführung kann weiterhin manuell über das Backend-Modul erfolgen.

# task_type.alttitle
source: Type of task
de: Typ des Tasks

# task_type.description
source: Choose whether the task must happen a single time or will be repeated
de: Legen Sie fest, ob der Tasks einmalig oder wiederkehrend ausgeführt werden soll.

# task_start.alttitle
source: Start of task
de: Start des Tasks

# task_start.description
source: Enter a start date and time for the task
de: Geben Sie Startdatum und -zeit für den Task an.

# task_start.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone.
de: Das Datum muss in einem der Standardformate eingegeben werden, z.B. HH:MM TT-MM-JJJJ. Geben Sie "16:17 10-12-2011" für die erstmalige Ausführung am 10. Dezember 2011 um 16:17 Uhr ein. Schlüsselwärter "now" (heute) oder "tomorrow" (morgen) sind ebenfalls erlaubt. Datum und Zeit müssen der auf dem Server eingestellten Zeitzone entsprechen.

# task_end.alttitle
source: End of task
de: Ende des Tasks

# task_end.description
source: Enter an end date and time for the task, can be blank
de: Geben Sie Datum und Zeit für die letztmalige Ausführung des Tasks ein. Dieses Feld kann leer bleiben, wenn kein Ende festgelegt werden soll.

# task_end.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone. Can be left blank, if task is not supposed to end at any point.
de: Das Datum muss in einem der Standardformate eingegeben werden, z.B. HH:MM TT-MM-JJJJ. Geben Sie "16:17 31-12-2009" für die erstmalige Ausführung am 31. Dezember 2009 um 16:17 Uhr ein. Schlüsselwärter "now" (heute) oder "tomorrow" (morgen) sind ebenfalls erlaubt. Datum und Zeit müssen der auf dem Server eingestellten Zeitzone entsprechen. Dieses Feld kann leer bleiben, wenn kein Ende festgelegt werden soll.

# task_frequency.alttitle
source: Frequency of task
de: Häufigkeit des Tasks

# task_frequency.description
source: Enter a frequency, either in seconds or using a cron-like syntax (minutes, hours, day of month, months and day of week)
de: Geben Sie die Häufigkeit an, in der der Task ausgeführt werden soll: Entweder in Sekunden oder in der für Cron-Jobs üblichen Syntax (Minuten, Stunden, Tag des Monats, Monate und Tag der Woche).

# task_frequency.details
source: The frequency of the task can be simply entered as a number of seconds. Alternatively it is possible to use the same syntax as for cron jobs. This is simply a list of five numbers or the wildcard "*", separated by blanks. The five numbers are (in order) minutes, hours, day of month, months and day of week. Examples: */5 * * * * means every 5 minutes 30 22 * * * means every day at 22:30 The Scheduler supports the full cron syntax.
de: Die Häufigkeit der Ausführung kann in Sekunden eingegeben werden.Alternativ ist es möglich, die Syntax von Cron verwenden. Diese besteht aus einer Liste von fünf Zahlen oder dem "*"-Symbol, welche durch Leerzeichen getrennt sind. Die fünf Zahlen stehen für Minute, Stunde, Tag des Monats, Monat und Tag der Woche (in dieser Reihenfolge), wobei ein "*" an Stelle einer Zahl als Platzhalter gilt. Beispiele: 0 * * * * zu jeder vollen Stunde, 30 22 * * * jeden Tag um 22:30, */5 * * * * alle fünf Minuten.

# task_frequency.seeAlso
source: Wikipedia reference|http://en.wikipedia.org/wiki/Cron
de: Wikipedia|http://de.wikipedia.org/wiki/Cron

# task_multiple.alttitle
source: Multiple executions
de: Parallele Ausführung

# task_multiple.description
source: Choose whether a task can be running several times simultaneously or not
de: Legen Sie fest, ob der Task mehrmals parallel ausgeführt werden darf oder nicht.

# task_email.alttitle
source: Email address
de: E-Mail-Adresse

# task_email.description
source: Enter a recipient for the mails sent by the test task
de: Geben Sie den Empfänger der Mails an für den Test-Task an.

# task_sleepTime.alttitle
source: Sleep time
de: Pause

# task_sleepTime.description
source: Enter a number of seconds during which the task will just sleep.
de: Geben Sie eine Anzahl Sekunden an, während der der Task pausiert.

# task_cachingFrameworkGarbageCollection_selectedBackends.alttitle
source: Select backends
de: Gewünschte Backends auswählen

# task_cachingFrameworkGarbageCollection_selectedBackends.description
source: If a cache uses one of the selected backends, the garbage collection will be called for this cache.
de: Wenn ein Cache eines der gewählten Backends verwendet, wird die Müllsammlung für diesen Cache aufgerufen.

# task_tableGarbageCollection_numberOfDays.alttitle
source: Number of days
de: Anzahl an Tagen

# task_tableGarbageCollection_numberOfDays.description
source: Delete rows from selected table that are older than given number of days.
de: Diejenigen Zeilen aus der ausgewählten Tabelle löschen, die älter als die angegebene Anzahl Tage sind.

# task_tableGarbageCollection_table.alttitle
source: Select table
de: Tabelle auswählen

# task_tableGarbageCollection_table.description
source: Select one of the registered tables to be cleaned up with this task.
de: Wählen Sie eine der registrierten Tabellen aus, damit dieser Task sie bereinigt.

# task_tableGarbageCollection_allTables.alttitle
source: Clean up all tables
de: Alle Tabellen bereinigen

# task_tableGarbageCollection_allTables.description
source: If selected, all configured tables are cleaned. The selection below is ignored.
de: Falls ausgewählt, werden alle konfigurierten Tabellen bereinigt. Die Auswahl unterhalb wird ignoriert.

# task_recyclerGarbageCollection_numberOfDays.alttitle
source: Number of days
de: Anzahl der Tage

# task_recyclerGarbageCollection_numberOfDays.description
source: Delete files in _recycler_ folders that are older than the given number of days.
de: Lösche alle Dateien im _recycler_ Ordner, welche älter als die angegebene Anzahl der Tage sind.
