Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/scheduler/mod1/*.locallang.xlf
Languages: de

# action.add
source: Add task
de: Task hinzufügen

# action.edit
source: Edit task
de: Task bearbeiten

# button.cancel
source: Cancel
de: Abbrechen

# function.scheduler
source: Scheduled tasks
de: Geplante Tasks

# function.check
source: Setup check
de: Konfiguration prüfen

# function.info
source: Information
de: Informationen

# hdg.cliScript
source: CLI script
de: CLI-Skript

# hdg.lastRun
source: Last run
de: Letzte Ausführung

# hdg.schedulerUser
source: TYPO3 Scheduler backend user
de: Backend-Benutzer für den TYPO3-Planer

# label.automatically
source: automatically
de: automatisch

# label.cachingFrameworkGarbageCollection.selectBackends
source: Backend types
de: Backendtypen

# label.recyclerGarbageCollection.numberOfDays
source: Number of days until removing files
de: Anzahl Tage bis zum Löschen der Dateien

# label.checkAll
source: Check/uncheck all
de: Alle auswählen/abwählen

# label.class
source: Class
de: Klasse

# label.defType
source: Definition type
de: Definitionstyp

# label.defType.cron
source: Cron command
de: Cron-Befehl

# label.description
source: Description
de: Beschreibung

# label.end
source: End (HH:MM DD-MM-YYYY)
de: Ende (HH:MM TT-MM-JJJJ)

# label.executeSelected
source: Execute selected tasks
de: Ausgewählte Tasks ausführen

# label.extension
source: Extension
de: Erweiterung

# label.frequency
source: Frequency
de: Häufigkeit

# label.frequency.long
source: Frequency (seconds or cron command)
de: Häufigkeit (Sekunden oder Cron-Befehl)

# label.lastExecution
source: Last Execution
de: Letzte Ausführung

# label.manual
source: Manual
de: manuell

# label.manually
source: manually
de: manuell

# label.nextExecution
source: Next Execution
de: Nächste Ausführung

# label.parallel
source: Parallel Execution
de: Parallele Ausführung

# label.parallel.long
source: Allow Parallel Execution
de: Parallele Ausführung erlauben

# label.serverTime
source: Server time
de: Serverzeit

# label.sleepTime
source: Sleep time
de: Pause

# label.start
source: Start (HH:MM DD-MM-YYYY)
de: Start (HH:MM TT-MM-JJJJ)

# label.tableGarbageCollection.allTables
source: Clean all available tables
de: Alle verfügbaren Tabellen bereinigen

# label.tableGarbageCollection.table
source: Table to clean up
de: Zu bereinigende Tabelle

# label.tableGarbageCollection.additionalInformationTable
source: Table: %s
de: Tabelle: %s

# label.tableGarbageCollection.additionalInformationAllTables
source: All tables
de: Alle Tabellen

# label.tableGarbageCollection.numberOfDays
source: Delete entries older than given number of days
de: Einträge löschen, die älter sind als die angegebene Anzahl Tage

# label.type
source: Type
de: Typ

# label.type.recurring
source: Recurring
de: wiederkehrend

# label.type.single
source: Single
de: einmalig

# msg.addError
source: The task could not be added.
de: Der Task konnte nicht hinzugefügt werden.

# msg.addSuccess
source: The task was added successfully.
de: Der Task wurde erfolgreich hinzugefügt.

# msg.cliScript
source: The script to execute the Scheduler from the command line is: <strong>"%s scheduler"</strong>.
de: Der Befehl, um den Planer von der Kommandozeile auszuführen lautet: <strong>"%s scheduler"</strong>.

# msg.cliScriptExecutable
source: The webserver user is allowed execute this script.
de: Der Webserver-Benutzer darf dieses Skript ausführen.

# msg.cliScriptNotExecutable
source: The webserver user is not allowed to execute this script.
de: Der Webserver-Benutzer darf dieses Skript nicht ausführen.

# msg.delete
source: Are you sure you want to delete this task?
de: Diesen Task tatsächlich löschen?

# msg.deleteError
source: The task could not be deleted.
de: Der Task konnte nicht gelöscht werden.

# msg.deleteSuccess
source: The task was successfully deleted.
de: Der Task wurde erfolgreich gelöscht.

# msg.endDateSmallerThanStartDate
source: The end date is before the start date.
de: Das Enddatum liegt vor dem Startdatum.

# msg.executed
source: Executed: %s
de: Ausgeführt: %s

# msg.frequencyError
source: Invalid frequency. Please enter either a number of seconds or a valid cron command. The cron parser said: %1$s [code: %2$d].
de: Ungültige Häufigkeit. Bitte geben Sie entweder eine Anzahl Sekunden oder einen gültigen Cron-Befehl an. Ausgabe des Cron-Parsers: %1$s [Code: %2$d].

# msg.incompleteLastRun
source: The information about the last execution of the Scheduler is incomplete.
de: Die Informationen zur letzten Ausführung des Planers sind unvollständig.

# msg.infoScreenIntro
source: This is the list of all available tasks in this TYPO3 installation. Click on the icon at the far right to directly create a new scheduled task of the chosen type.
de: Dies ist eine Liste aller in dieser TYPO3-Installation verfügbaren Tasks. Klicken Sie auf das Symbol außen rechts, um einen neuen geplanten Task des gewählten Typs zu erstellen.

# msg.invalidFrequency
source: Invalid frequency. Please enter either a number of seconds or a valid cron command.
de: Ungültige Häufigkeit. Bitte geben Sie entweder eine Anzahl Sekunden oder einen gültigen Cron-Befehl ein.

# msg.invalidSleepTime
source: Please enter a sleep time greater or equal to 0 (zero).
de: Bitte geben Sie eine Pause von mindestens null Sekunden an.

# msg.lastRun
source: The Scheduler was last started (%1$s) on %2$s at %3$s and ended on %4$s at %5$s.
de: Der Planer wurde zuletzt gestartet (%1$s) am %2$s um %3$s und endete am %4$s um %5$s.

# msg.maynotDeleteRunningTask
source: A running task may not be deleted.
de: Ein laufender Task kann nicht gelöscht werden.

# msg.maynotEditRunningTask
source: A running task may not be edited.
de: Ein laufender Task kann nicht bearbeitet werden.

# msg.maynotStopNonRunningTask
source: The task is not running. There are no executions to unmark.
de: Dieser Task läuft nicht. Es gibt keine abzuwählenden Ausführungen.

# msg.noEmail
source: Please enter an email address.
de: Bitte geben Sie eine E-Mail-Adresse an.

# msg.noFrequency
source: No frequency was defined, either as an interval or as a cron command.
de: Bitte geben Sie als Häufigkeit entweder ein Interval oder einen Cron-Befehl an.

# msg.noLastRun
source: The Scheduler has never yet run or the information about the last run has been lost.
de: Der Planer wurde noch nie ausgeführt oder die Informationen über die letzte Ausführung sind verloren gegangen.

# msg.noTasksDefined
source: There are currently no task classes available at all. To be able to create new tasks, you must either enable the samples provided by the Scheduler or install some other extension that relies on the Scheduler.
de: Gegenwärtig sind keine Taskklassen verfügbar. Um neue Task erstellen zu können, müssen Sie entweder die mit dem Planer mitgelieferten Beispiele aktivieren oder eine Erweiterung installieren, die den Planer verwendet.

# msg.noTaskClassFound
source: The selected task class could not be found. You should probably contact the task's developers.
de: Die ausgewählte Taskklasse konnte nicht gefunden werden. Sie sollten sich an den Entwickler des Tasks wenden.

# msg.noTasks
source: No tasks defined yet.
de: Noch keine Tasks angelegt.

# msg.notExecuted
source: Not executed: %s
de: Nicht ausgeführt: %s

# msg.executionFailed
source: Execution of task "%1$s" failed with the following message: %2$s
de: Die Ausführung von Task "%1$s" ist fehlgeschlagen mit folgender Meldung: %2$s

# msg.executionFailureDefault
source: The execution failed, but the error message could not be retrieved (it was probably too large). Sorry.
de: Die Ausführung ist fehlgeschlagen, ohne dass die Fehlermeldung erfasst werden konnte (wahrscheinlich war sie zu groß). Entschuldigung.

# msg.executionFailureReport
source: Execution failed: %1$d, %2$s
de: Ausführung fehlgeschlagen: %1$d, %2$s

# msg.noStartDate
source: Please define a start date.
de: Bitte setzen Sie ein Startdatum.

# msg.invalidStartDate
source: Start date is invalid.
de: Das Startdatum ist ungültig.

# msg.invalidEndDate
source: End date is invalid.
de: Das Enddatum ist ungültig.

# msg.invalidNumberOfDays
source: Number of days is invalid.
de: Anzahl an Tagen ist ungültig.

# msg.selectionOfNonExistingCacheBackends
source: Some of the selected cache backends do not exist. Please select valid backends only.
de: Einige der ausgewählten Cache-Backends existieren nicht. Bitte wählen Sie nur valide Backends aus.

# msg.noCacheBackendSelected
source: Please select at least one cache backend.
de: Mindestens ein Cache-Backend auswählen.

# msg.invalidTaskClass
source: Class %s of the registered task could not be found. You should re-install the extension that provided it or simply delete this task.
de: Die Klasse %s des registrierten Tasks konnte nicht gefunden werden. Sie sollten die Erweiterung, die den Task zur Verfügung stellt, neuinstallieren oder den Task löschen.

# msg.invalidTaskClassEdit
source: The current class (%s) could not be found. Change it below or consider deleting this task altogether.
de: Der aktuelle Task (%s) konnte nicht gefunden werden. Ändern Sie ihn unten oder löschen Sie ihn.

# msg.schedulerSetupCheck
source: This screen checks if the requisites for running the Scheduler as a cron job are fulfilled. It also displays information about the last run of the Scheduler.
de: Diese Seite zeigt Ihnen, ob die Voraussetzungen, um den Planer mit einem Cron-Job auszuführen, erfüllt sind. Zudem zeigt sie Informationen zur letzten Ausführung des Planers.

# msg.schedulerUser
source: The backend user "_cli_scheduler" is used by the CLI-script to log into TYPO3. This user may not have administrator privileges. The user's password is not important but should be set to a secure value for security reasons.
de: Der Backend-Benutzer "_cli_scheduler" wird vom CLI-Skript benutzt, um sich bei TYPO3 anzumelden. Dieser Benutzer darf keine Administratorrechte haben. Das Passwort dieses Benutzers ist nicht wichtig, sollte aber auf einen sicheren Wert gesetzt werden.

# msg.schedulerUserFound
source: The backend user "_cli_scheduler" was found.
de: Der Backend-Benutzer "_cli_scheduler" wurde gefunden.

# msg.schedulerUserFoundButDisabled
source: The backend user "_cli_scheduler" exists but is currently disabled.
de: Der Backend-Benutzer "_cli_scheduler" existiert, ist aber derzeit deaktiviert.

# msg.schedulerUserMissing
source: The backend user "_cli_scheduler" was not found. <a href="%s" title="Click to create the missing user">Create the user now</a>.
de: Der Backend-Benutzer "_cli_scheduler" wurde nicht gefunden. <a href="%s" title="Klicken Sie, um den fehlenden Benutzer zu erstellen.">Den Benutzer jetzt erstellen.</a>

# msg.serverTime
source: Current server time is %s.
de: Die aktuelle Serverzeit ist %s.

# msg.serverTimeHelp
source: All dates and times in the Scheduler are measured according to the server's time, as the Scheduler is run purely on the server-side.
de: Alle Daten und Zeiten im Planer werden an der Serverzeit gemessen, weil der Planer ausschließlich auf der Serverseite läuft.

# msg.stop
source: Are you sure you want to mark this task as not running? Note that this will not stop the actual script (if unsure please refer to the manual).
de: Diesen Task tatsächlich als nicht-laufend markieren? Beachten Sie, dass dies nicht das eigentliche Skript beendet. (Wenn Sie unsicher sind, konsultieren Sie bitte das Handbuch.)

# msg.stopError
source: The task could not be marked as non-running.
de: Der Task konnte nicht als nicht-laufend markiert werden.

# msg.stopSuccess
source: The task was successfully marked as non-running.
de: Der Task wurde erfolgreich als nicht-laufend markiert.

# msg.taskNotFound
source: The requested task (UID: %d) was not found.
de: Der angeforderte Task (UID: %d) wurde nicht gefunden.

# msg.updateSuccess
source: The task was updated successfully.
de: Der Task wurde erfolgreich aktualisiert.

# msg.updateError
source: The task could not be updated.
de: Der Task konnte nicht aktualisiert werden.

# msg.userCreated
source: The "_cli_scheduler" user was created successfully.
de: Der Benutzer "_cli_scheduler" wurde erfolgreich erstellt.

# msg.userExists
source: The "_cli_scheduler" user already exists. It was not created.
de: Der Benutzer "_cli_scheduler" existiert bereits. Er wurde daher nicht erstellt.

# msg.userNotCreated
source: The creation of the "_cli_scheduler" user failed.
de: Der Benutzer "_cli_scheduler" konnte nicht erstellt werden.

source: None
de: Keine

source: Status Legend
de: Status-Legende

# status.legend.disabled
source: Disabled, will not be executed, except manually
de: Deaktiviert, wird nicht ausgeführt, es sei denn manuell

# status.legend.failure
source: Failure! An error occured during the last execution (move over bullet for more details)
de: Fehler! Während der letzten Ausführung ist ein Fehler aufgetreten (halten Sie den Mauszeiger auf das Symbol, um Details anzuzeigen)

# status.legend.late
source: Late, will run with next execution
de: Verspätet, wird bei nächster Ausführung laufen

# status.legend.running
source: Currently running
de: Läuft gerade

# status.legend.scheduled
source: Scheduled, will run on next possible execution
de: Geplant, wird bei nächstmöglicher Ausführung laufen

# status.disabled
source: disabled
de: deaktiviert

# status.failure
source: failure
de: Fehler

# status.late
source: late
de: verspätet

# status.running
source: running
de: läuft

# status.scheduled
source: scheduled
de: geplant

# title
source: TYPO3 Scheduler administration module
de: Administrationsmodul des TYPO3-Planers
