Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/tstemplate_info/*.locallang.xlf
Languages: de

source: Delete:
de: Löschen:

source: To top:
de: Nach oben:

source: File changed
de: Datei geändert

# resourceUpdated
source: Resource '%s' has been updated.
de: Ressource '%s' wurde aktualisiert.

source: Template information
de: Template-Informationen:

source: Title
de: Titel des Templates:

source: Sitetitle
de: Titel der Website:

source: Description
de: Beschreibung:

source: Allowed extensions:
de: Erlaubte Erweiterungen:

source: Max filesize:
de: Maximale Dateigröße:

source: Upload resource
de: Ressource hochladen:

# newTextResource
source: New text resource (enter name)
de: Neue Textressource (geben Sie einen Namen an):

# copyResource
source: Make a copy of resource:
de: Kopie der Ressource erstellen:

source: Update resource list
de: Ressourcenliste aktualisieren:

source: Constants
de: Konstanten:

source: File:
de: Datei:

source: Edit Resource:
de: Ressource bearbeiten:

# filesizeExceeded
source: Filesize exceeded %s KBytes
de: Dateigröße überschreitet %s KB

# notAllowed
source: Files larger than %s KBytes are not allowed to be edited.
de: Dateien größer als %s KB können nicht bearbeitet werden.

source: Resources
de: Ressourcen:

# editToView
source: (edit to view, %s lines)
de: (bearbeiten um anzuzeigen, %s Zeilen)

# editTemplateRecord
source: Edit the whole template record
de: Vollständigen Template-Datensatz bearbeiten

source: Include TypoScript file content
de: TypoScript-Dateiinhalte einbinden
