Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/SpellChecker/*.locallang.xlf
Languages: de

source: Spell Checker
de: Rechtschreibprüfung

# CONFIRM_LINK_CLICK
source: Please confirm that you want to open this link
de: Bitte bestätigen Sie, dass Sie diesem Link folgen möchten

source: Cancel
de: Abbrechen

source: Dictionary
de: Wörterbuch

source: Finished list of mispelled words
de: Fertige Liste der Fehler

source: I will open it in a new page.
de: Wird in neuer Seite geöffnet.

source: Ignore all
de: Alle ignorieren

source: Ignore
de: Ignorieren

# NO_ERRORS
source: No mispelled words found with the selected dictionary.
de: Im ausgewählten Wörterbuch wurden keine Fehler gefunden.

# NO_ERRORS_CLOSING
source: Spell check complete, didn't find any mispelled words. Closing now...
de: Fehlersuche beendet, es wurden keine Fehler gefunden. Die Suche wird nun beendet...

source: Original word
de: Ursprüngliches Wort

source: Please wait. Calling spell checker.
de: Bitte warten. Die Rechtschreibprüfung wird aufgerufen.

source: Please wait: changing dictionary to
de: Bitte warten: das Wörterbuch wird geändert nach

source: HTMLArea Spell Checker
de: HTMLArea-Rechtschreibprüfung

# QUIT_CONFIRMATION
source: This will drop changes and quit spell checker. Please confirm.
de: Hierdurch werden die Änderungen verworfen und die Rechtschreibprüfung beendet. Bitte bestätigen.

source: Re-check
de: Nochmals prüfen

source: Replacement
de: Ersatz

source: Replace all
de: Alle ersetzen

source: Replace with
de: Ersetzen durch

source: Replace
de: Ersetzen

# Learn
source: Add to dictionary
de: Zum Wörterbuch hinzufügen

source: Revert
de: Umkehren

# SC-spell-check
source: Spell-check
de: Rechtschreibprüfung

source: Suggestions
de: Vorschläge

source: One occurrence
de: Einmal

source: Two occurrences
de: Zweimal

source: occurrences
de: Anzahl Vorkommen

source: of the word
de: des Wortes

source: was found.
de: wurde gefunden.

source: were found.
de: wurden gefunden.

source: Document information
de: Dokumentinformation

source: No information available
de: Keine information verfügbar

source: Total words
de: Totale Anzahl Wörter

source: Misspelled words
de: Fehlerhafte Wörter

source: Total suggestions
de: Total Anzahl Vorschläge

source: Total words suggested
de: Total Anzahl vorgeschlagener Wörter

source: Spelling checked in
de: Rechtschreibprüfung durchgeführt in

source: seconds
de: Sekunden

# pliz weit ;-)
source: Please wait...
de: Bitte warten...
