Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/felogin/*.locallang_db.xlf
Languages: de

# tt_content.CType_pi1
source: Website User Login
de: FE-Benutzeranmeldung

# felogin_redirectPid
source: Redirect at Login to Page (felogin)
de: Bei Anmeldung zur folgenden Seite weiterleiten

# tt_content.pi_flexform.general_header
source: General Header
de: Überschrift allgemein

# tt_content.pi_flexform.general_message
source: General Message
de: Meldung allgemein

# tt_content.pi_flexform.redirect_header
source: Redirect Header
de: Überschrift Weiterleitung

# tt_content.pi_flexform.redirect_message
source: Redirect Message
de: Meldung Weiterleitung

# tt_content.pi_flexform.welcome_header
source: Welcome Header
de: Überschrift Begrüßung

# tt_content.pi_flexform.welcome_message
source: Welcome Message
de: Meldung Begrüßung

# tt_content.pi_flexform.success_header
source: Login Success Header
de: Überschrift erfolgreiche Anmeldung

# tt_content.pi_flexform.success_message
source: Login Success Message
de: Meldung erfolgreiche Anmeldung

# tt_content.pi_flexform.error_header
source: Login Error Header
de: Überschrift fehlgeschlagene Anmeldung

# tt_content.pi_flexform.error_message
source: Login Error Message
de: Meldung fehlgeschlagene Anmeldung

# tt_content.pi_flexform.status_header
source: Status Display Header
de: Überschrift Statusanzeige

# tt_content.pi_flexform.status_message
source: Status Display Message
de: Meldung Statusanzeige

# tt_content.pi_flexform.logout_header
source: Logout Header
de: Überschrift Abmeldung

# tt_content.pi_flexform.logout_message
source: Logout Message
de: Meldung Abmeldung

# tt_content.pi_flexform.forgot_header
source: Forgot Password Header
de: Überschrift vergessenes Passwort

# tt_content.pi_flexform.forgot_message
source: Forgot Password Message
de: Meldung vergessenes Passwort

# tt_content.pi_flexform.sheet_general
source: General
de: Allgemein

# tt_content.pi_flexform.sheet_redirect
source: Redirects
de: Weiterleitungen

# tt_content.pi_flexform.sheet_messages
source: Messages
de: Meldungen

# tt_content.pi_flexform.show_forgot_password
source: Display Password Recovery Link
de: Passwort-Wiederherstellungs-Link anzeigen

# tt_content.pi_flexform.show_permalogin
source: Display Remember Login Option
de: Markierungsfeld für dauerhafte Anmeldung anzeigen (wenn verfügbar)

# tt_content.pi_flexform.show_logoutFormAfterLogin
source: Display Logout Form After Successful Login
de: Abmeldeformular nach erfolgreicher Anmeldung zeigen

# tt_content.pi_flexform.groupSelectmode
source: FE group select mode:
de: FE-Gruppen-Auswahlmodus:

# tt_content.pi_flexform.groupSelectmode_showAll
source: Show all
de: Alle anzeigen

# tt_content.pi_flexform.groupSelectmode_showSelected
source: Show selected
de: Nur die Ausgewählten anzeigen

# tt_content.pi_flexform.groupSelectmode_DontShowSelected
source: Dont show selected
de: Die Ausgewählten NICHT anzeigen

# tt_content.pi_flexform.groupSelectmode_FromTS
source: (from Typoscript)
de: (nach Typoscript)

# tt_content.pi_flexform.groupSelection
source: FE group selection:
de: FE-Gruppen-Auswahl:

# tt_content.pi_flexform.groupSelection_noGroup
source: no group
de: in keiner Gruppe einsortiert

# tt_content.pi_flexform.field_manualOrder
source: Using fieldlists below:
de: Folgende Felder benutzen:

# tt_content.pi_flexform.field_orderList
source: User Fields/list:
de: Listenansicht:

# tt_content.pi_flexform.field_orderDetails
source: User Fields/details:
de: Detailansicht:

# tt_content.pi_flexform.redirectMode
source: Redirect Mode
de: Weiterleitungsmodus

# tt_content.pi_flexform.redirectMode.I.0
source: Defined by Usergroup Record
de: Definiert durch Benutzergruppen-Datensatz

# tt_content.pi_flexform.redirectMode.I.1
source: Defined by User Record
de: Definiert durch Benutzer-Datensatz

# tt_content.pi_flexform.redirectMode.I.2
source: After Login (TS or Flexform)
de: Nach Anmeldung (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.3
source: After Logout (TS or Flexform)
de: Nach Abmeldung (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.4
source: After Login Error (TS or Flexform)
de: Nach Anmeldefehler (TS oder Flexform)

# tt_content.pi_flexform.redirectMode.I.5
source: Defined by GET/POST Parameters
de: Definiert durch GET- oder POST-Variablen

# tt_content.pi_flexform.redirectMode.I.6
source: Defined by Referrer
de: Definiert durch Referrer

# tt_content.pi_flexform.redirectMode.I.7
source: Defined by Domain Entries
de: Definiert durch Domäneneinträge

# tt_content.pi_flexform.redirectFirstMethod
source: Use First Supported Mode from Selection
de: Erste unterstützter Modus aus Auswahl

# tt_content.pi_flexform.redirectDisable
source: Disable Redirect
de: Weiterleitung aktivieren

# tt_content.pi_flexform.redirectPageLogin
source: After Successful Login Redirect to Page
de: Nach erfolgreicher Anmeldung auf folgende Seite weiterleiten

# tt_content.pi_flexform.redirectPageLoginError
source: After Failed Login Redirect to Page
de: Nach einem Fehler bei der Anmeldung auf folgende Seite weiterleiten

# tt_content.pi_flexform.redirectPageLogout
source: After Logout Redirect to Page
de: Nach Abmeldung auf folgende Seite weiterleiten

# tt_content.pi_flexform.template_file
source: Template File
de: Vorlagendatei

# tt_content.pi_flexform.user_storage
source: User Storage Page
de: Speicherort Benutzer
