Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/lowlevel/config/*.locallang.xlf
Languages: de

source: Configuration
de: Konfiguration

# typo3ConfVars
source: $TYPO3_CONF_VARS (Global Configuration)
de: $TYPO3_CONF_VARS (Globale Konfiguration)

# tca
source: $TCA (Table configuration array)
de: $TCA (Array für Tabellenkonfiguration)

# tcaDescr
source: $TCA_DESCR (Table Help Description)
de: $TCA_DESCR (Beschreibungen für Tabellenhilfe)

# loadedExt
source: $TYPO3_LOADED_EXT (Loaded Extensions)
de: $TYPO3_LOADED_EXT (Geladene Erweiterungen)

# tbeStyles
source: $TBE_STYLES (Skinning Styles)
de: $TBE_STYLES (Oberflächen-Stile)

# beUser
source: $BE_USER->uc (User Settings)
de: $BE_USER->uc (Benutzereinstellungen)

# usersettings
source: $TYPO3_USER_SETTINGS (User Settings Configuration)
de: $TYPO3_USER_SETTINGS (Konfiguration für Benutzereinstellungen)

# t3services
source: $T3_SERVICES (Registered Services)
de: $T3_SERVICES (Registrierte Dienste)

# tbemodulesext
source: $TBE_MODULES_EXT (BE Modules Extensions)
de: $TBE_MODULES_EXT (Erweiterungen für BE-Module)

# tbemodules
source: $TBE_MODULES (BE Modules)
de: $TBE_MODULES (BE-Module)

source: Crop lines
de: Zeilen kappen

# copyPaste
source: (Now, copy/paste this value into the configuration file where you can set it. This is all you can do from here...)
de: Jetzt können Sie diesen Wert kopieren und in die Konfigurationsdatei einfügen, wo Sie ihn setzen können. Mehr ist hier nicht möglich...

source: Enter search phrase:
de: Suchbegriff eingeben:

source: Search
de: Suchen

# useRegExp
source: Use regular expression
de: Regulären Ausdruck verwenden

# writeValue
source: Write value to configuration file
de: Wert in Konfigurationsdatei schreiben

# writeMessage
source: Following line was added to configuration file (%s): %s%s
de: Die folgende Zeile wurde der Konfigurationsdatei (%s) hinzugefügt: %s%s

# writeMessageFailed
source: Write to configuration file failed (%s)!
de: Schreiben der Konfigurationsdatei fehlgeschlagen (%s)!
