Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/BlockStyle/*.locallang.xlf
Languages: de

# No style
source: No block style
de: Kein Blockstil

# Remove style
source: Remove block style
de: Blockstil entfernen

# Unknown style
source: Unknown block style
de: Unbekannter Blockstil

# Element style
source: Block element style
de: Blockelementstil

# BlockStyle-Tooltip
source: Apply style to the containing block
de: Stil auf enthaltenden Block anwenden

# frame-frame1
source: Frame with grey background
de: Rahmen mit grauem Hintergrund

# frame-frame2
source: Frame with yellow background
de: Rahmen mit gelbem Hintergrund

source: Important
de: Wichtig

source: Name of person
de: Name der Person

source: Component items
de: Komponenteneintr채ge

source: Action items
de: Befehlseintr채ge
