Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/PlainText/*.locallang.xlf
Languages: de

# PasteToggleTooltip
source: Toggle paste behaviour
de: Einfügemodus umschalten

# plainText
source: Paste as plain text
de: Als einfachen Text einfügen

# pasteStructure
source: Paste structure only
de: Nur Struktur einfügen

# pasteFormat
source: Paste structure and basic format
de: Struktur und grundlegende Formatierung einfügen

# PasteBehaviourTooltip
source: Select alternate paste behaviour
de: Alternativen Einfügemodus auswählen

source: Paste as plain text
de: Als einfachen Text einfügen

# Access-to-clipboard-denied
source: Content could not be pasted as plain text because permission to access the clipboard was denied.
de: Der Inhalt konnte nicht als einfacher Text eingefügt werden, weil der Zugriff auf die Zwischenablage verboten wurde.

# enableplainText
source: Enable paste as plain text
de: Einfügen als einfachen Text aktivieren

# enablepasteStructure
source: Enable paste structure only
de: Einfügen nur als Struktur aktivieren

# enablepasteFormat
source: Enable paste structure and basic format
de: Einfügen als Struktur und grundlegende Formatierung aktivieren

# disableplainText
source: Disable paste as plain text
de: Einfügen als einfachen Text deaktivieren

# disablepasteStructure
source: Disable paste structure only
de: Einfügen nur als Struktur deaktivieren

# disablepasteFormat
source: Disable paste structure and basic format
de: Einfügen als Struktur und grundlegende Formatierung deaktivieren

# pasteInPastingPad
source: Paste the content into this pasting pad and click OK.
de: Inhalt in dieses Einfügefeld einfügen und OK drücken.

# rteCleanPasteBehaviour
source: Clean paste behaviour
de: Modus für sauberes Einfügen
