Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/wizard_crpages/*.locallang.xlf
Languages: de

# wiz_crMany
source: Create multiple pages
de: Mehrere Seiten erzeugen

# wiz_newPages
source: Create new pages
de: Neue Seiten anlegen

# wiz_newPages_page
source: Page
de: Seite

# wiz_newPages_currentMenu
source: New page structure
de: Neue Seitenstruktur

# wiz_newPages_errorMsg1
source: You are not allowed to create new subpages to this page!
de: Sie haben nicht die notwendigen Rechte, um dieser Seite neue Unterseiten hinzuzufügen!

# wiz_newPages_lCreate
source: Create pages
de: Seiten anlegen

# wiz_newPages_listEnd
source: Place new pages after the existing subpages
de: Neue Seiten nach existierenden Unterseiten anlegen

# wiz_newPages_hidePages
source: Hide new pages
de: Neue Seiten verbergen

# wiz_newPages_lCreate_msg1
source: You're about to create many new pages. Are you sure you want to continue?
de: Es wird eine größere Anzahl neuer Seiten erstellt. Den Vorgang fortsetzen?

# wiz_newPages_lReset
source: Clear fields
de: Felder zurücksetzen

# wiz_newPages_noCreate
source: No pages were created!
de: Es wurden keine Seiten erzeugt!

# wiz_newPages_create
source: The pages were created!
de: Die Seiten wurden erzeugt!

# wiz_newPages_addMoreLines
source: Add more lines
de: Zeilen hinzufügen
