Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/impexp/*.locallang_csh.xlf
Languages: de

# extensionDependencies.details
source: During import warnings will appear for all selected extensions from this list which were not installed.
de: Beim Import wird für jede Erweiterung dieser Liste, die nicht installiert ist, eine Warnung angezeigt.

# presets.alttitle
source: Configuration presets
de: Voreinstellungen

# presets.description
source: Enables you to save an export configuration for later re-use. Useful if you need to export the same configuration with regular intervals.
de: Ermöglicht das Speichern von Export-Einstellungen zur späteren Wiederverwendung. Nützlich, wenn die gleiche Konfiguration regelmäßig exportiert werden muss.

# presets.details
source: In the "Select preset" box you can select any previously saved preset to load. If you are exporting a page the presets listed will be those found for the start page ID. For records, any preset can be loaded. To load a preset, select it in the selector and press "Load". If you press "Merge" instead the settings from the preset will be merged with the current configuration. This is meaningful in cases where you select multiple individual tables or records. To save a preset, simply enter a title in the title box and press "Save". This will create a new preset. If you press save while having selected an existing preset you will overwrite it. To delete old presets, simply select it and press "Delete". The checkbox "Public" can be set if you want to share your preset with other users of the system. Otherwise they are personal to you. In the Taskcenter you can see a list of your presets and jump directly to them.
de: Unter "Voreinstellungen" können Sie eine Voreinstellung laden, die Sie zuvor gespeichert haben. Wenn Sie eine Seite exportieren, sind die angezeigten Voreinstellungen die, die für die ID der Startseite gelten. Für Datensätze können beliebige Voreinstellungen geladen werden. Um eine Voreinstellung zu laden, wählen Sie sie aus und klicken Sie auf "Laden". Wenn Sie stattdessen "Zusammenführen" wählen, werden die Einstellungen aus der Voreinstellung mit der aktuellen Konfiguration zusammengeführt. Das ist sinnvoll, wenn Sie mehrere einzelne Tabellen oder Datensätze auswählen. Um eine Voreinstellung zu speichern, geben Sie einfach einen Titel unter "Name der neuen Voreinstellung" ein und klicken Sie auf "Speichern". Es wird dann eine neue Voreinstellung erzeugt. Wenn Sie Speichern klicken, während Sie eine bestehende Voreinstellung ausgewählt haben, wird diese überschrieben. Um eine alte Voreinstellung zu löschen, wählen Sie sie einfach aus und klicken Sie auf "Löschen". Das Markierungsfeld "Öffentlich" kann gesetzt werden, wenn Sie Ihre Voreinstellung anderen Nutzern des Systems zugänglich machen möchten. Ansonsten ist sie nur von Ihnen persönlich nutzbar.

# presets.image_descr
source: The preset selector in the export interface. Presets from the task center.
de: Die Voreinstellungsauswahl im Export-Interface. Voreinstellungen aus dem Aufgabenzentrum.

# metadata.alttitle
source: Meta data setting
de: Metadaten

# metadata.description
source: Set meta data for the export. This is highly encouraged if your exported content goes into eg. a template collection of sorts.
de: Festlegen der Metadaten für das Exportieren. Die Nutzung wird dringend empfohlen, falls der Inhalt z.B. Teil einer Vorlagensammlung sein soll.

# metadata.details
source: The meta data will help users of your exported files to know what they can expect to be inside and what things they should be aware of and take into account during import. The "Title" and "Description" should contain the basic information about the export. The "Notes" field can be used for additional details, especially remarks about intensions or requirements that apply. The thumbnail field is used for thumbnails if you need that for your export. This is very useful when export files are used as page templates where the template selector can take advantage of the thumbnail. The format should be a web-format like jpg, gif or png and the dimensions should fit exactly the final display dimensions intended; so don't upload very large images!
de: Die Metadaten helfen den Nutzern Ihrer Exportdatei zu wissen, was sich in ihr befindet und worauf sie während des Imports achten müssen. Die Felder "Titel" und "Beschreibung" sollten Basisinformationen zur Datei enthalten. Das Feld "Anmerkungen" kann für zusätzliche Details genutzt werden, vor allem für Hinweise zum Zweck der Datei und zu den Voraussetzungen bei der Installation. Das Feld "Vorschaubild" kann für Vorschaubilder genutzt werden, falls Sie diese bei Ihrem Export benötigen. Es ist sehr nützlich, wenn Exportdateien als Seiten-Template eingesetzt werden, wobei der Template-Selektor das Vorschaubild nutzen kann. Als Dateiformat sollten Sie ein Webformat wie jpg, gif oder png nutzen. Die Ausmaße sollten exakt den endgültigen Ausmaßen entsprechen; laden Sie also keine sehr großen Bilder hoch.

# fileFormat.alttitle
source: File format options
de: Dateiformat

# fileFormat.description
source: You can export your records to a TYPO3 specific binary format (serialized PHP array) called "T3D". Alternatively you can select a plain-text XML export which potentially can be imported by other applications written to support this format. However the schema of the XML is TYPO3 specific.
de: Sie können Ihre Datensätze in eine .T3D-Datei exportieren. Diese Datei enthält Ihre Daten in einem TYPO3-spezifischen, binären Format (in Form eines fortgesetzten PHP-Arrays). Alternativ können Sie XML als Format auswählen. Dieses kann theoretisch von anderen Programmen importiert werden, wenn sie dazu programmiert wurden. Allerdings ist das verwendete Schema TYPO3-spezifisch.

# fileFormat.details
source: Generally you should use the T3D format, preferably compressed. The T3D compressed format normally yields a size about 10 times less than the XML format which is bloaded due to the plain-text nature of the format. With "Max size of files to include" you can set a limit to the size of attached files to records. This is useful if you have large PDF files or videoclips attached to records which you do not desire (or do desire!) to include; then with this limit you can adjust whether they are allowed in or not. Entering a file name to save to makes it possible to write your export directly to a file (pressing "Save to filename") instead of downloading it (pressing "Download export"). The correct file extensions depending on file format is automatically applied. Files are saved in a proper filemount in "fileadmin/". This is shown to you upon saving. Existing files are overwritten.
de: Grundsätzlich sollten Sie das T3D-Format verwenden, vorzugsweise komprimiert. Komprimiert bringt es normalerweise eine Größe, die etwa 10-mal kleiner ist als die des XML-Formats, denn dieses enthält Klartext. Mit "Größenbeschränkung für Dateien" können Sie eine maximale Größe für Dateien angeben, die den Datensätzen angefügt werden sollen. Das ist praktisch, wenn Sie große PDF-Dateien oder Videos haben, die Sie nicht (oder gerade!) hinzufügen wollen. Mit diesem Wert können Sie dann festlegen, ob sie mitexportiert werden oder nicht. Die Angabe eines Dateinamens macht es möglich, Ihren Export direkt als Datei zu speichern (klicken Sie auf "Speichern unter") anstatt ihn herunterzuladen (klicken Sie dazu auf "Exportdatei herunterladen"). Die richtige Dateiendung wird basierend auf Ihrer Wahl automatisch hinzugefügt. Die Dateien werden in eine Dateifreigabe im Ordner "fileadmin/" gespeichert. Dies wird Ihnen nach dem Speichern gezeigt. Bereits bestehende Dateien werden überschrieben.

# import.alttitle
source: Importing TYPO3 records
de: TYPO3-Datensätze importieren

# import.description
source: To import TYPO3 T3D/XML files into the page tree you click any page in the page tree (including the root page!), select "More options" (requires the extensions "extra_page_cm_options" to be installed) and then "Import from .t3d". This will bring up the import interface where you can select a file to import or upload a new one.
de: Um XML- oder T3D-Dateien in den Seitenbaum zu importieren, können Sie eine beliebige Seite im Seitenbaum anklicken (die Wurzelseite inbegriffen). Wählen Sie dann "Weitere Einstellungen..." (dazu muss die Erweiterung "extra_page_cm_options" installiert sein) und dort "Importieren aus .t3d". Darauf öffnet sich das Import-Formular, in dem sie eine Datei zum Importieren auswählen oder eine neue Datei hochladen können.

# import.details
source: <b>Tip: Import into a Sys Folder</b> To make sure that no records are lost during the import, you can make yourself safe by importing into a SysFolder you create first. After the import you can move all records to the final destinations. An example of such a scenario is if you configured the export to include relations; In that case a number of records may follow the export outside the page tree structure you are exporting. To make sure that all of these external records are written to the database, importing into a SysFolder is a good idea. <b>Error messages:</b> Remember to consult the Message-tab before/after importing to see if there are any error messages there!
de: <b>Tipp: Import in einen SysOrdner</b> Um sicherzustellen, dass während des Imports keine Datensätze verloren gehen, können Sie den Import in einen SysOrdner, den Sie erst erstellen, durchführen. Nach dem Import können Sie dann alle Datensätze an Ihre endgültigen Positionen bewegen. Ein Beispiel für ein derartiges Szenario ist, wenn Sie beim Export angegeben haben, dass Sie Relationen miteinschließen wollen. In diesem Fall kann eine Anzahl von Datensätzen dem Export außerhalb des Seitenbaums, den Sie exportierten haben, folgen. Um sicherzustellen, dass alle diese externen Datensätze in die Datenbank geschrieben werden, ist ein Import in einen SysOrdner eine gute Idee. <b>Fehlermeldungen:</b> Denken Sie daran, vor/nach dem Importieren im Tab "Meldungen" zu prüfen, ob dort Fehlermeldungen angezeigt werden!

# importFile.alttitle
source: Select file to import
de: Importdatei auswählen

# importFile.description
source: The files displayed are those with an extension T3D or XML from fileadmin/, fileadmin/export/ and your "TEMP" folder (if any).
de: Es werden die Dateien aus den Verzeichnissen fileadmin/, fileadmin/export/ und dem evtl. vorhandenen Ordner "TEMP" angezeigt, welche die Endung T3D oder XML besitzen.

# update.alttitle
source: Update instead of Insert
de: Datensätze aktualisieren

# update.description
source: By default the import operation inserts new records in the system. Using this option will update existing records.
de: Standardmäßig fügt der Importvorgang dem System neue Datensätze hinzu. Ist diese Option aktiviert, werden vorhandene Datensätze aktualisiert.

# update.details
source: There are certain requirements you have to meet if you want the "Update" process to work. The main thing is that the records updated are those with the SAME uid as the uid in the export file. Thus an update operation only makes real sense if the export and import systems are somehow related and the same UIDs can be expected in both ends. Otherwise it will be a mess! When you update page structures the import operation will automatically try to rearrange records so they also appear in the same hierarchy and order as in the export file. This can be disabled by checking the option "Ignore PID differences globally". In any case you can set individual records to Ignore/Respect the PID with a selectorbox in the preview. In the preview display you can also select if individual records should be flatly ignored during import or if you want them created as new records instead of being updates. As a help for managing updates the preview display will inform you about the path where the existing element with that UID is found. Use this to verify that you get what you expect! <b>Forcing the UID:</b> If you intend to update a system and some elements from the import are not mappable to a UID already (ei. does not exist) you can choose in the preview display to force the UID during creation. This is an unorthodox thing to do since UIDs are normally created automatically by the database. The option makes most sense if you are trying to "synchronize" a copy of another system. The option may mess up certain database internals and the feature is therefore only available for admins.
de: Sie müssen bestimmte Voraussetzungen beachten, damit das Aktualisieren funktioniert. Am Wichtigsten ist dabei, dass die aktualisierten Datensätze, <i>DIESELBE</i> UID haben, wie die in der Exportdatei. Daher ist es nur wirklich sinnvoll zu aktualisieren, wenn das Export- und das Importsystem miteinander zusammenhängen und daher die gleichen UIDs auf beiden Seiten zu erwarten sind. Sonst entsteht großes Durcheinander! Wenn Sie Seitenstrukturen aktualisieren, wird TYPO3 beim Import automatisch versuchen, die Datensätze neu anzuordnen, so dass sie in der gleichen Hierarchie und Reihenfolge erscheinen wie in der Exportdatei. Dieses Verhalten kann deaktiviert werden, indem die Option "PID-Unterschiede global ignorieren" gewählt wird. In jedem Fall können Sie in der Vorschau für einzelne Datensätze individuell wählen, ob die PIDs beibehalten oder ignoriert werden sollen. In der Vorschauansicht können Sie auch wählen, ob einzelne Datensätze während des Imports rundweg ignoriert werden sollen oder ob sie als neue Datensätze erstellt werden sollen anstatt alte Datensätze zu aktualisieren. Um eine Aktualisierung durchzuführen, informiert Sie die Vorschauansicht über den Pfad, in dem das bestehende Element mit dieser UID gefunden wurde. Nutzen Sie diese Information um sicherzustellen, dass Sie das bekommen, was Sie erwarten! <b>Den UID-Wert erzwingen:</b> Wenn Sie ein System aktualisieren möchten und einige Elemente des Imports nicht einer UID zuzuordnen sind (etwa weil sie nicht existiert), können Sie in der Vorschauansicht wählen, die UID während der Erstellung zu erzwingen. Das ist unorthodox, denn die UIDs werden normalerweise automatisch von der Datenbank erzeugt. Die Option ist am Nützlichsten, wenn Sie versuchen, eine Kopie eines anderen Systems zu "synchronisieren". Sie kann interne Einstellungen der Datenbank in Unordnung bringen und ist daher nur für Administratoren verfügbar.

# update.image_descr
source: In Update mode you can select various settings for each record. You will also be able to see a diff-view where the differences between the existing record and the one from the import is shown.
de: Im Modus Aktualisieren lassen sich für jeden Datensatz verschiedene Einstellungen vornehmen. Ist ist ebenso möglich, eine diff-Ansicht anzeigen zu lassen, welche die Unterschiede der vorhandenen von den zu importierenden Datensätzen darstellt.

# options.alttitle
source: Import options
de: Optionen

# options.description
source: Various options for import.
de: Legt verschiedene Optionen für den Importvorgang fest.

# options.details
source: <b>Do not show differences in records</b> When a structure has been imported you will see a difference view of all records which tells you whether the written content matched the import data or if not, what changed. In many cases content <i>should</i> change (eg. relations and file references) so it is not an error if you see red and green values. Basically the difference view is a feature you can use for visual validation of the import success. It brings piece-of-mind to those who is enlightened to understand what it tells... :-) Green strings represent the actual written data while red represents the original value from the import file and black represents data that is the same. <b>Allow to write banned file extensions (eg. PHP scripts), if any</b> Also an option for admins-only; Allows PHP-files (for example from soft references in TypoScript templates) to be written to the system. This is normally not allowed behavior for security reasons.
de: <b>Unterschiede zwischen Datensätzen nicht zeigen</b> Wenn eine Struktur importiert wurde, sehen Sie eine Ansicht aller Datensätze, der Sie eventuelle Unterschiede entnehmen können. Oft <i>sollte</i> sich der Inhalt ändern (z.B. bei Soft-References); es ist folglich kein Fehler, wenn Sie rote und grüne Werte sehen. Im Prinzip ist diese Unterschieds-Ansicht ein Feature, das Sie nutzen können, um den Erfolg des Imports visuell zu überprüfen. Denjenigen, die sie verstehen, möge sie Seelenfrieden bringen... :-) Grüne Zeichenfolgen stehen für die tatsächlich geschriebenen Daten, während rote für die Originalwerte der Importdatei stehen und schwarze unveränderte Daten darstellen. <b>Verbotene Dateierweiterungen dennoch erlauben (z.B. PHP-Skripte)</b> Diese Option ist nur von Administratoren nutzbar. Sie erlaubt den Import von PHP-Dateien (zum Beispiel aus Soft-References aus TypoScript-Templates). Normalerweise ist dies sonst aus Sicherheitsgründen nicht erlaubt.

# options.image_descr
source: Options for import. Here you are told that this PHP file cannot be allowed - because you didn't select the option "Allow to write banned file extensions (eg. PHP scripts), if any"
de: Optionen für das Importieren Hier wird mitgeteilt, dass diese PHP-Datei nicht erlaubt werden kann - weil die Option "Verbotene Dateierweiterungen dennoch erlauben (z.B. PHP-Skripte)" nicht ausgewählt wurde.

# action.alttitle
source: Import Action
de: Aktion

# action.description
source: Press "Preview" to see the content of the import file or update the preview display according to changed configurations. Press "Import"/"Update" if you want to perform the actual import. Before importing make sure you change any editable soft references that are shown in the preview data.
de: Klicken Sie auf "Vorschau", um den Inhalt der Importdatei zu sehen oder die Vorschau-Ansicht entsprechend der obigen Konfiguration zu aktualisieren. Klicken Sie "Vorschau" - "Import", wenn Sie den eigentlichen Import durchführen wollen. Stellen Sie sicher, dass Sie vor dem Import alle editierbaren Soft-References, die bei den Vorschaudaten angezeigt werden, geändert haben.

# action.image_descr
source: Example of the result view after importing. As you can see the RTE attached images (soft references) has been written to new file names and the difference view tells you that the names changed in the bodytext content.
de: Beispiel der Ergebnis-Ansicht nach dem Importieren: Wie Sie sehen können, wurden die durch den RTE eingefügten Bilder (Soft-References) unter anderen Dateinamen gespeichert. Entsprechend wurden die Links im Seiteninhalt angepasst.

# enableLogging.alttitle
source: Enable System Logging
de: Protokollierung aktivieren

# enableLogging.description
source: If you set this the system backend log will be filled with entries for all the actions that the import actually performs. By default this is left out for the sake of clarity.
de: Falls aktiviert, werden für alle beim Import tatsächlich durchgeführten Vorgänge Einträge in das System-Backend-Protokoll geschrieben. Aus Gründen der Übersichtlichkeit ist dies standardmäßig deaktiviert.

# upload.alttitle
source: Upload import file
de: Importdatei übertragen

# upload.description
source: Select a file to import from your local computer and upload it here. If the upload completes succesfully you can immediately see its content displayed in the preview display.
de: Wählen Sie hier eine Datei, die importiert werden soll, auf Ihrem lokalen Rechner zum Hochladen aus. Wird die Übertragung erfolgreich abgeschlossen, so können Sie den Inhalt sofort in der Vorschauansicht sehen.

# upload.details
source: Notice that there are usually limits set by the server (PHP) to the size of uploaded files at around 2 MB in which case nothing will happen.
de: Beachten Sie, dass serverseitig idR. Einschränkungen bezüglich der Größe hochzuladender Dateien bei etwa 2 MB bestehen. Bei Überschreiten dieser Grenze wird der Vorgang nicht fortgesetzt.

# task.title
source: Preset title
de: Voreinstellungs-Titel

# task.icon
source: Icon
de: Symbol

# task.public
source: Public
de: Öffentlich

# task.owner
source: Owner
de: Besitzer

# task.page
source: Page
de: Seite

# task.path
source: Path
de: Pfad

# task.meta
source: Meta data
de: Metadaten

# task.own
source: Own
de: Selbst

source: Notes
de: Anmerkungen

source: Single record
de: Einzelner Datensatz

# no-presets
source: No presets found!
de: Keine Voreinstellungen gefunden!
