Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/impexp/*.locallang_csh.xlf
Languages: de

# .description
source: Native Import/Export module for TYPO3 data. Can export single records, content of tables, single pages or whole branches of the page tree. Includes attached media like image and preserves relations between records. Exports only to TYPO3 specific format, either a binary format (.T3D) or XML. The format is meant for exchange between TYPO3 systems.
de: Import/Export-Modul für TYPO3-Daten. Kann einzelne Datensätze, Tabelleninhalte, einzelne Seiten oder ganze Zweige des Seitenbaums exportieren. Berücksichtigt eingebundene Medien wie z.B. Bilder und behält Beziehungen zwischen Datensätzen bei. Exportiert nur TYPO3-spezifisches Format, entweder ein binäres Format (.T3D) oder XML. Das Format ist zum Datenaustausch zwischen TYPO3-Systemen vorgesehen.

# .image_descr
source: Example of the preview display during export configuration of a page. Notice how records on the page are include plus how references inside the record is found and included as well (bottom of screen).
de: Beispiel der Vorschauanzeige während der Exportkonfiguration einer Seite. Man beachte, wie die Datensätze auf der Seite einbezogen werden und wie die Referenz innerhalb des Datensatzes gefunden und ebenfalls einbezogen wird.

# export.alttitle
source: Exporting records from TYPO3
de: Datensätze aus TYPO3 exportieren

# export.description
source: To export TYPO3 T3D/XML files you click any record icon or page in the page tree (including the root page!), select "More options" (requires the extensions "extra_page_cm_options" to be installed) and then "Export to .t3d". This will bring up the export interface where you can configure options for your export session.
de: Um TYPO3-T3D/XML-Dateien zu exportieren, klicken Sie auf ein Datensatz-Symbol im Seitenbaum (inkl. der Root-Seite!), wählen Sie "Mehr Optionen" (erfordert die Installation der Erweiterung "extra_page_cm_options") und dann "Nach .t3d exportieren". Das Export-Interface wird aufgerufen, wo Sie die Optionen für das Exportieren einstellen können.

# export.details
source: There are a number of methods by which you can export data from TYPO3: - Export a single page or branch of the page tree (use page icon context menu) - Export a single record from any page (use record icon context menu) - Export all records from a specific table on a specific page (using the Web>List module) - Export an arbitrary selection of records from the clipboard (using the Web>List module) The export format observes all TYPO3s methods for relations between the records in the export file. But you will have to configure how these relations are maintained, at least to some degree. Sometimes you would want to include records referred to, at other times you surely want to keep the original mapping. That depends on your objectives with the export. Regardless of your configuration for export you will always see a complete reflection of all chosen records and their internal relations in the preview display found in the bottom of the export module page. <b>Error messages:</b> Remember to consult the Message-tab before exporting if there are any error messages there!
de: Daten können aus TYPO3 auf verschiedene Art und Weise exportiert werden: - Exportieren einer einzelnen Seite oder eines Zweiges des Seitenbaums (über das Kontextmenü des Seiten-Symbols) - Exportieren eines einzelnen Datensatzes aus einer beliebigen Seite (über das Kontextmenü des Datensatz-Symbols) - Exportieren aller Datensätze einer bestimmten Tabelle einer bestimmten Seite (über das Modul Web > Liste) - Exportieren einer frei wählbaren Auswahl von Datensätzen aus der Zwischenablage (über das Modul Web > Liste) Das Export-Format beachtet alle TYPO3-Methoden für Beziehungen zwischen den Datensätzen in der Export-Datei. Sie müssen jedoch festlegen, wie diese Beziehungen beibehalten werden, zumindest bis zu einem gewissen Grad. Manchmal sollen Datensätze, auf die verwiesen wird, in den Export eingeschlossen werden, in anderen Fällen soll möglicherweise die originale Verknüpfung beibehalten werden. Das hängt vom Zweck des Exports ab. Unabhängig von den Export-Einstellungen werden alle ausgewählten Datensätze und ihre internen Beziehungen in der Vorschau-Anzeige am Fuß der Seite des Export-Moduls wiedergegeben. <b>Fehlermeldungen:</b> Kontrollieren Sie vor dem Exportieren unter dem Reiter "Meldungen" ob sich dort eventuell Fehlermeldungen befinden!

# export.image_descr
source: To export a page or record, simply click the icon and select "Export" from the context menu. With the Web>List module you can also export all records from a table by first clicking the table title to see only this table, then next to the CSV export you will find the export button for a T3D export of the table. You can export the contents of the clipboard as well by simply selecting "Export" in the menu.
de: Um eine Seite oder einen Datensatz zu exportieren, klicken Sie einfach auf das Symbol und wählen Sie "Exportieren" aus dem Kontextmenü. Mit dem Modul Web > Liste können Sie auch alle Datensätze einer Tabelle exportieren, indem Sie zuerst auf den Tabellentitel klicken, um nur diese Tabelle zu sehen. Neben dem CSV-Export finden Sie die Schaltfläche für einen T3D-Export der Tabelle. Sie können auch den Inhalt der Zwischenablage exportieren, indem sie einfach "Exportieren" im Menü wählen.

# pageTreeCfg.alttitle
source: Configuration of page tree export
de: Konfiguration des Seitenbaumexports

# pageTreeCfg.description
source: Here you configure how a page or a branch of the page tree should be exported. Using the selector box you can set the number of levels of subpages to include in the export. By default all records belonging to a page is included when a page is exported.
de: Hier können Sie einstellen, wie eine Seite oder ein Zweig des Seitenbaums exportiert werden soll. Mit dem Auswahlfeld legen Sie fest, wieviele Unterseitenebenen in den Export eingeschlossen werden sollen.

# pageTreeDisplay.alttitle
source: Page Tree
de: Seitenbaum

# pageTreeDisplay.description
source: Based on the levels selected for page tree export this will show the structure that is about to be exported. If any pages are specifically excluded by the exclude option they are not shown either.
de: Ausgehend von den ausgewählten Ebenen für den Seitenbaum zeigt dies die Struktur, die zum Export ansteht. Falls Seiten ausdrücklich durch die "Ausschließen-Option" ausgeschlossen wurden, werden sie nicht angezeigt.

# pageTreeMode.alttitle
source: Levels
de: Ebenen

# pageTreeMode.description
source: Here you select how deeply in the page tree from the current starting point to go for this export.
de: Hier wählen Sie die Ebenentiefe für diesen Export aus, bezogen auf den aktuellen Ausgangspunkt.

# pageTreeMode.details
source: If you select "Expanded tree" it will base the export on the currently expanded levels of the page tree. Another special option is "Tables on this page" which will not include the page record itself but only include records from tables on the page, depending on the table configuration of course.
de: Wenn Sie "Erweiterter Baum" auswählen, wird der Export auf Basis der aktuell erweiterten Ebenen erfolgen. Eine weitere Spezial-Option ist "Tabellen auf dieser Seite", die nicht den Seiten-Datensatz selbst, sondern nur die Tabellen der Seite exportiert, natürlich abhängig von der Tabellen-Konfiguration.

# pageTreeRecordLimit.alttitle
source: Include tables
de: Einzuschließende Tabellen

# pageTreeRecordLimit.description
source: When you export a page all records on the page is included by default. By this selector you can pick which tables to include exclusively if there are certain records you are not interested in seeing included.
de: Beim Export einer Seite werden standardmäßig alle Datensätze der Seite eingeschlossen. Mit diesem Selektor können Sie die einzuschließenden Tabellen auswählen, falls sie einzelne Datensätze nicht einschließen wollen.

# pageTreeRecordLimit.details
source: In the box "Max number of records" you can set a limit to how many records are selected from a single table. This is a runaway brake in case you have an unusual large amount of records from a table.
de: In der Box "Höchstwert für Datensätze" können Sie einen Grenzwert dafür setzen, wie viele Datensätze maximal aus einer einzelnen Tabelle ausgewählt werden. Dies ist eine "Notbremse", falls sich ungewöhnlich viele Datensätze in der Tabelle befinden.

# singleRecord.alttitle
source: Export single record
de: Einzelnen Datensatz exportieren

# singleRecord.description
source: This overview tells you which independent records has been independently selected for export.
de: Dieser Überblick zeigt, welche unabhängigen Datensätze unabhängig von einander für den Export ausgewählt wurden.

# singleRecord.image_descr
source: The way to export multiple records like this is using the clipboard like shown below.
de: Um mehrere Datensätze wie diesen zu exportieren, bitte die Zwischenablage, wie weiter unten gezeigt, benutzen.

# tableList.alttitle
source: Table export
de: Tabellenexport

# tableList.description
source: Export of all records on a page from a specific table. This is configured from the Web>List module where you will have to select table-only view and click a button in the top of the page.
de: Export aller Datensätze einer Seite aus einer bestimmten Tabelle. Wird vom Modul "Web > Liste" konfiguriert; dort wählen Sie "Nur Tabellenansicht" und klicken oben auf eine Schaltfläche.

# tableList.details
source: Tip: You can select multiple table lists by simply saving each selecting as a preset and finally load/merge the selections together.
de: Tipp: Sie können mehrere Tabellen-Listen auswählen, indem sie jede Auswahl als Voreinstellung speichern und dann die Auswahlen laden/zusammenführen.

# tableList.image_descr
source: Here two tables from different pages are selected. This is done by first selecting the one, saving it as a preset, then select the other and merge with the saved preset. Here you see how to use the Web>List module to export all records from a table on a page.
de: Hier werden zwei Tabellen von verschiedenen Seiten ausgewählt. Dies geschieht, indem man zunächst die erste Tabelle auswählt und als Voreinstellung speichert, dann die nächste auswählt und sie mit den gespeicherten Voreinstellungen zusammenführt. Hier sehen Sie, wie man das Modul Web > Liste benutzt, um alle Datensätze einer Tabelle aus einer Seite zu exportieren.

# tableListMaxNumber.alttitle
source: Max number to export
de: Maximale Export-Anzahl

# tableListMaxNumber.description
source: Run-away brake that will make sure a large amount of records does not halt the interface. Default is 100, but you can change it to anything you like of course.
de: "Notbremse", die sicherstellt, dass das Interface nicht von einer großen Anzahl Datensätze blockiert wird. Standard ist 100, aber Sie können den Wert natürlich beliebig ändern.

# inclRelations.alttitle
source: Include relations
de: Verknüpfungen einbeziehen

# inclRelations.description
source: Configure the tables from which you want to include records that are found as relations in the main export configuration.
de: Konfigurieren Sie die Tabellen, aus denen Sie Datensätze, die als Beziehungen in der Haupt-Export-Konfiguration gefunden werden, einbeziehen wollen.

# inclRelations.details
source: Background: When you export a record in TYPO3 it might contain relations to other records in the system. You have to tell the export interface what to do with these relations. Basically there are three scenarios: - If relations are found between records that are all in the export configuration, there is no problem: The relations are automatically mapped to the new id's of those records when imported. - If the records related to are not included the relation will be lost (indicated with an error message in the preview) unless you a) either select that table in this selector box in which case all relations to that table will be included or b) if you set the table as a static table (in which case the relation is untouched and imported as-is - but which will of course break if no record with that UID is found in the import system). <b>Soft References:</b> Soft references are when a record contains pointers to external files or records but in fields where there are no formal relation configured. Examples of this is when a content element contains a "&lt;link 123&gt;" tag that represents a link to the page 123. This is not picked up formally as a reference, but is found anyhow as a "soft reference". The same goes for &lt;img&gt; tags with images from eg. "fileadmin/". By default soft references pointing to records or files will act as normal references; either including the referenced item or showing an error. However you can also choose to exclude the handling of individual soft references or maybe set the value as "editable" upon import. This is done with a selector box in the export preview.
de: Hintergrund: Wenn Sie einen Datensatz in TYPO3 exportieren, kann er Beziehungen zu anderen Datensätzen des Systems enthalten. Sie müssen dem Export-Interface mitteilen, was mit diesen Beziehungen geschehen soll. Grundsätzlich gibt es drei Szenarios: - Wenn Beziehungen zwischen Datensätzen gefunden werden, die alle in der Export-Konfiguration enthalten sind, gibt es kein Problem: Die Beziehungen werden beim Importieren automatisch auf die neuen IDs dieser Datensätze umgestellt. - Wenn die Datensätze, auf die Beziehungen verweisen, nicht enthalten sind, geht die Beziehung verloren (angezeigt durch eine Fehlermeldung in der Vorschau), außer a) Sie wählen eine Tabelle im Auswahlfeld. In diesem Fall werden alle Beziehungen zu dieser Tabelle einbezogen oder b) Sie bestimmen die Tabelle als "Statische Tabelle" (in diesem Fall wird die Beziehung unverändert importiert - was natürlich zu Fehlern führt, wenn kein Datensatz mit der entsprechenden UID im System gefunden wird) <b>Soft-References ("Weiche Beziehungen"):</b> Man spricht von "Soft-References", wenn ein Datensatz Zeiger auf externe Dateien oder Datensätze enthält, aber in Feldern, für die keine formale Beziehung konfiguriert ist, z.B. wenn ein Content-Element ein "&lt;link 123&gt;" Tag enthält, das für einen Link zur Seite 123 steht. Das wird formal nicht als Beziehung aufgenommen, wird aber als "Soft-Reference" gefunden. Das gleiche gilt für &lt;img&gt;-Tags mit Bildern aus z.B. "fileadmin/". Standardmäßig verhalten sich Soft-References, die auf Datensätze oder Dateien verweisen, wie normale Beziehungen; entweder die verknüpften Objekte sind enthalten oder es wird eine Fehlermeldung angezeigt. Allerdings kann man auch die Behandlung von Soft-References auch abschalten oder die Werte als "veränderbar" beim Import definieren. Das geschieht mit einem Auswahlfeld in der Export-Vorschau.

# inclRelations.image_descr
source: This example shows tree examples of references; a) an image attached to a content element, b) a relation to a frontend usergroup UID, and c) a soft reference found in the bodytext field of a record, here it is the link-tag pointing to the page with UID 1. Notice in the previous image how the relation to the frontend user group was lost. This has been corrected in this screenshot where the fe_group table has been selected in the list of table for which to include relations. The result is that the frontend usergroup is included as a record outside the exported pagetree. If you wanted to keep the relation but not include the usergroup you have to set "fe_groups" as a static table instead. See below. This example shows a TypoScript Template Record where multiple soft references has been found. The first one is an email address. Here it is configured to be editable. This means that upon import the user will have a chance to edit the value before the import is actually done. This is very useful when exported files are used as templates. Another example includes a PHP script which we don't want to include in the export and therefore we have selected the exclude option for the soft reference.
de: Dieses Beispiel zeigt drei Beispiele für Beziehungen: a) ein Bild, das mit einem Inhaltselement verknüpft ist, b) eine Beziehung zu einer Frontend-Benutzergruppe UID und c) eine Soft-Reference, die im Bodytext-Feld eines Datensatzes gefunden wurde, in diesem Fall ein Link-Tag, das auf die Seite mit der UID 1 verweist. Beachten Sie im vorangegangenen Bild, wie die Beziehung zu der Frontend-Benutzergruppe verloren ging. Das wurde in diesem Bildschirmfoto korrigiert, indem in der Liste der einzubindenen Tabellen die Tabelle fe_group ausgewählt wurde. Das Ergebnis ist, dass die Front-End-Benutzergruppe als ein Datensatz außerhalb des exportierten Seitenbaums einbezogen wurde. Falls Sie die Beziehung behalten, aber nicht die Benutzergruppe einschließen wollen, müssen Sie "fe_groups" stattdessen als statische Tabelle definieren (siehe unten). Dieses Beispiel zeigt einen TypoScript-Vorlagendatensatz, bei dem mehrere Soft-References gefunden wurden. Die erste ist eine E-Mail-Adresse. Hier ist sie als editierbar ausgewählt. Das bedeutet, dass der Benutzer beim Importieren die Möglichkeit hat, diesen Wert zu ändern, bevor der eigentliche Import ausgeführt wird. Das ist sehr sinnvoll, wenn exportierte Dateien als Vorlagen benutzt werden. Ein anderes Beispiel bindet ein PHP-Script ein, das wir nicht in den Export einbeziehen möchten - darum haben wir die Option Ausschließen für diese Soft-Reference ausgewählt.

# staticRelations.alttitle
source: Set static tables
de: Statische Tabellen festlegen

# staticRelations.description
source: Select which tables in addition to the static TYPO3 tables to keep relations untouched for. Takes precedence over "Include relations" configured tables.
de: Legen Sie fest, für welche Tabellen (zusätzlich zu den statischen TYPO3-Tabellen) die Beziehungen nicht verändert werden dürfen. Diese Einstellungen haben Vorrang vor den unter "Verknüpfungen einbeziehen" getroffenen Einstellungen.

# staticRelations.details
source: By default all relations to static tables in TYPO3 are kept untouched. Of course those static tables should be present in the import system in order for this to work correctly. However there might be circumstances where you move information between two systems where theoretically non-static tables should just keep relations untouched. Examples could be "sys_languages" or TemplaVoila data structures / template objects where two systems might contain the same set of records in those tables while you are importing pages and content elements freely.
de: Standardmäßig werden unter TYPO3 alle Verknüpfungen zu statischen Tabellen nicht berührt. Damit dies funktioniert, sollten diese statischen Tabellen natürlich im Import-System vorhanden sein. Es mag jedoch beim Informationstransfer zwischen zwei Systemen Umstände geben, unter denen Verknüpfungen bei nicht-statische Tabellen unberührt bleiben sollten. Beispiele dafür könnten "sys_languages" oder TemplaVoilà-Datenstrukturen und -Vorlagenobjekte sein, wobei beide Systeme die gleichen Datensätze in Tabellen enthalten, man Seiten und Inhaltselemente jedoch nach freier Auswahl importieren möchte.

# staticRelations.image_descr
source: In this example you see how a number of records are pointing to a System Language record which will become lost relations when imported because the record is not included in the export. However; in the target system the System Languages are exactly the same and therefore you just want a static mapping of the relations. The static mapping is obtained by selecting the "sys_language" table as a static template meaning that the relations are kept at their current values assuming that they will be exactly the same in the target system when imported.
de: In diesem Beispiel kann man sehen, dass eine Reihe von Datensätzen auf einen Systemsprachendatensatz zeigt. Diese Verknüpfung wird beim Importieren verloren gehen, da der Datensatz nicht Teil des Exports ist. Im Zielsystem sind jedoch exakt die gleichen Tabellen vorhanden, und daher ist eine statische Abbildung der Verknüpfungen gewünscht. Diese statische Abbildung erreicht man durch Auswahl der Tabelle "sys_language" als statische Vorlage, d.h. das die Verknüpfungen die derzeitigen Werte behalten, da angenommen werden kann, dass sie auf dem Zielsystem beim Importieren genau übereinstimmen.

# excludedElements.alttitle
source: Excluded elements
de: Ausgeschlossene Elemente

# excludedElements.description
source: By the "Exclude" checkbox you can exclude specific records from the preview display of the export. Which records has been picked for specific exclusion is listed here. You can also clear the exclusion configuration.
de: Über das Markierungsfeld "Ausschließen" lassen sich bestimmte Datensätze in der Vorschau des Exports ausschließen. Hier wird angezeigt, welche Datensätze für einen bestimmten Ausschluss ausgewählt wurden. Darüber hinaus kann die Ausschlusskonfiguration zurückgesetzt werden.

# htmlCssResources.alttitle
source: Exclude resources from HTML and CSS files
de: Ressourcen aus HTML- und CSS-Dateien ausschließen

# htmlCssResources.description
source: When an HTML or CSS file is found as a soft reference the files are parsed for references to external media (such as images) and if any are found they are also exported. If you don't want this behaviour, click this option.
de: Werden HTML- oder CSS-Dateien als Soft-References gefunden, so werden die Dateien auf Verweise auf externe Medien (wie etwa Bilder) untersucht und diese ggf. ebenfalls exportiert. Aktivieren Sie diese Option, wenn dieses Verhalten nicht gewünscht ist.

# htmlCssResources.details
source: Notice: Resources found inside an HTML or CSS file are not analysed further. For instance it means that any CSS files referred to from within an HTML will not be traversed - but CSS files referred to inside the Setup or Constant field of a TypoScript template record will be!
de: Hinweis: In HTML- und CSS-Dateien gefundene Ressourcen werden nicht weiter analysiert. D.h. beispielsweise, dass CSS-Dateien, auf die in HTML verwiesen wird, nicht untersucht werden - CSS-Dateien, auf die innehalb der Felder Konstanten und Konfiguration einer TypoScript-Vorlage verwiesen wird, jedoch sehr wohl.

# htmlCssResources.image_descr
source: In this example you can see that a soft reference has been found pointing to an HTML file inside fileadmin/ Since it was an HTML file it was parsed and further a number of files were found referenced inside it and now included with the export. This feature is specifically created to support export of template configurations where external HTML files play a role.
de: Dieses Beispiel zeigt, wie eine Soft-Reference gefunden wurde, die auf eine HTML-Datei im Verzeichnis fileadmin/ verweist. Da es sich um eine HTML-Datei handelt, wurde sie verarbeitet, wodurch eine Reihe weiterer Dateien gefunden wurden, auf diese verwiesen wurde und die nun im Export mit eingeschlossen werden. Diese Funktion wurde extra zur Unterstützung von Szenarien mit Vorlagenkonfigurationen entwickelt, bei denen externe HTML-Dateien eine Rolle spielen.

# extensionDependencies.alttitle
source: Extension Dependencies
de: Abhängigkeiten von Erweiterungen

# extensionDependencies.description
source: Select which extensions should be installed in the import system in order for your exported content to work correctly. Examples could be "templavoila" for templating, "css_styled_content" for the template, "tt_news" for a news archive etc.
de: Wählen Sie, welche Erweiterungen im Zielsystem installiert sein müssen, damit der exportierte Inhalt ordnungsgemäß funktioniert. Beispiele wären etwa "templavoila" für die Vorlagenverarbeitung, "css_styled_content" für die Vorlagen, "tt_news" für ein News-Archiv usw.
