Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/version/*.locallang.xlf
Languages: de

# title
source: Versioning
de: Versionierung

# title_review
source: Send to review/pub
de: Zur Prüfung weitergeben

# mlang_labels_tablabel
source: Page and content versioning and workspace management for pages.
de: Versionierung von Seiten und Inhalten sowie Verwaltung von Arbeitsumgebungen für Seiten.

# mlang_labels_tabdescr
source: The Web>Versioning module provides access to versioning features for the page tree.
de: Das Modul Web>Versionierung stellt Funktionen zur Versionierung des Seitenbaumes bereit.

# mlang_tabs_tab
source: Versioning
de: Versionierung

# clickAPage_header
source: Web>Versioning module
de: Modul Web>Versionierung

# clickAPage_content
source: Please click a page in the pagetree frame to see the versioning module.
de: Bitte klicken Sie auf eine Seite im Seitenbaum um das Versionierungsmodul zu sehen.

# filter_drafts
source: Drafts
de: Entwürfe

# filter_archive
source: Archive
de: Archiv

# filter_all
source: All
de: Alle

source: DIFFING
de: VERGLEICH

source: Fieldname
de: Feldname

source: Colored diff-view
de: Farblich hervorgehobene Vergleichsansicht

# recordsMatchesCompletely
source: Records matches completely on all editable fields!
de: Datensätze sind in allen bearbeitbaren Feldern identisch!

# errorRecordsNotFound
source: ERROR: Records could strangely not be found!
de: FEHLER: Datensatz konnte nicht gefunden werden!

# errorDiffSources
source: ERROR: You didn't select two sources for diffing!
de: FEHLER: Sie müssen zwei Quellen zum Vergleichen auswählen!

# tblHeader_title
source: Title
de: Titel

# tblHeader_t3ver_state
source: state
de: Status

# tblHeader_t3ver_stage
source: stage
de: Stufe

# tblHeader_t3ver_count
source: count
de: Anzahl

# tblHeader_t3ver_label
source: Label
de: Beschriftung

# tblHeaderDesc_title
source: Header of element
de: Kopfzeile des Elementes

# tblHeaderDesc_uid
source: Unique ID of element
de: Eindeutige ID des Elements

# tblHeaderDesc_t3ver_oid
source: t3ver_oid - Reference to live version UID
de: t3ver_oid - Referenz zur UID der LIVE Version

# tblHeaderDesc_t3ver_id
source: t3ver_id - Version number, incremental integer
de: t3ver_id - Versionsnummer, fortlaufende Nummerierung

# tblHeaderDesc_t3ver_wsid
source: t3ver_wsid - Workspace ID. There can be only one version of an element per ID (except ID zero).
de: t3ver_wsid - ID der Arbeitsumgebung. Es kann immer nur eine Version eines Elementes pro ID (Arbeitsumgebung) existieren (außer bei ID 0).

# tblHeaderDesc_t3ver_state
source: t3ver_state - Special states of a version: 1=Placeholder for "New". 2=Marked deleted.
de: t3ver_state - spezieller Status einer Version: 1=Platzhalter für "NEU". 2=Als gelöscht markiert.

# tblHeaderDesc_t3ver_stage
source: t3ver_stage - Publishing stage: Editing (0), review (1), publish (10), rejected (-1).
de: t3ver_stage - Veröffentlichungsstufe: in Bearbeitung (0), wird überprüft (1), veröffentlicht (10), zurückgewiesen (-1).

# tblHeaderDesc_t3ver_count
source: t3ver_count - Life cycle counter. Incremented each time element is unpublished.
de: t3ver_count - Lebenszyklus Zähler. Wird bei jeder Änderung auf "unveröffentlicht" erhöht.

# tblHeaderDesc_pid
source: Page ID
de: Seiten ID

# tblHeaderDesc_t3ver_label
source: Label
de: Beschriftung

source: Diff
de: Vergleich

source: SWAP with current
de: Mit aktueller Version tauschen

source: CURRENT ONLINE VERSION!
de: AKTUELLE ONLINE-VERSION!

# cmdPid0
source: Page: Page + content
de: Seite: Seite + Inhalt

# cmdPid100
source: Branch: All subpages
de: Teilbereich: Alle Unterseiten

# cmdPid1
source: Element: Just record
de: Element: Nur Datensatz

source: Create new version
de: Erstelle neue Version

source: Preview Link
de: Vorschau-Link

source: Publish Page
de: Seite veröffentlichen

source: Swap page
de: Tausche Seite

# publishPageQuestion
source: Are you sure you want to publish all content %sfrom this page?
de: Wollen Sie wirklich alle Inhalte %sdieser Seite veröffentlichen?

# swapPageQuestion
source: Are you sure you want to publish (swap) all content %sfrom this page?
de: Wollen Sie wirklich alle Inhalte %sdieser Seite veröffentlichen (tauschen)?

# publishPageQuestionStage
source: in "Publish" stage
de: in Stufe "Veröffentlichen"

source: Preview Url:
de: Vorschau-URL

# previewInstruction
source: You can preview this page from the workspace using this link for the next %s hours (does not require backend login):
de: Die Vorschau dieser Seite in der Arbeitsumgebung ist mit diesen Vorschau-Link für die nächsten %s Stunden möglich (keine Backend-Anmeldung erforderlich):

# versionDetails
source: Details for version
de: Details der Version

# wsManagement
source: Workspace management
de: Verwaltung der Arbeitsumgebungen

# showDiffView
source: Show difference view
de: Zeige Vergleichsansicht

# wsVersions
source: Workspace Versions:
de: Versionen in Arbeitsumgebungen:

source: Controls:
de: Optionen:

# goBack
source: Click here to go back
de: Zurück

source: Show all information
de: Zeige alle Informationen

source: New element
de: Neues Element

source: Deleted element
de: Gelöschtes Element

# moveToPlaceholder
source: Move-to placeholder (destination)
de: Verschieben-nach Platzhalter (Ziel)

# moveToPointer
source: Move-to pointer (source)
de: Verschieben-nach Platzhalter (Quelle)

# notAvailable
source: N/A
de: Nicht verfügbar

source: change:
de: Änderung:

source: [Page]
de: [Seite]

source: [Branch]
de: [Teilbereich]

# otherVersions
source: Other version(s) in workspace
de: Andere Version(en) in Arbeitsumgebung

# multipleVersions
source: Multiple versions in same workspace!
de: Verschiedene Versionen in der gleichen Arbeitsumgebung!

# versionInVersion
source: Version inside version!
de: Version innerhalb Version!

source: Lifecycle
de: Lebenszyklus

source: Workspace
de: Arbeitsumgebung

# diffToLiveElement
source: Difference to live element:
de: Unterschied zum Live Element:

source: Comment for Reviewer:
de: Kommentar für Redakteur:

source: Comment for Publisher:
de: Kommentar für Veröffentlichung:

# sendItemsToReview
source: Sending %s item(s) to review.
de: Sende %s Element(e) zur Überprüfung.

source: Send all to Review
de: Sende alles zur Überprüfung

# approveToPublish
source: Approving %s item(s) to publishing.
de: Stimme der Veröffentlichung von %s Element(e) zu.

# approveAllToPublish
source: Approve all for Publishing
de: Bestätigen aller Elemente zur Veröffentlichung

source: Draft
de: Entwurf

source: Archive
de: Archiv

# publishedXTimes
source: Published %s times
de: %s mal veröffentlicht

# stage.sentToReview
source: sent element to "Review"
de: sende Element zur "Überprüfung"

# stage.approvedForPublish
source: approved for "Publish"
de: bestätigt zur "Veröffentlichung"

# stage.rejectedElement
source: rejected element!
de: zurückgewiesenes Element!

# stage.resetToEdit
source: reset to "Editing"
de: zurücksetzen auf "Bearbeiten"

# stage.undefined
source: [undefined]
de: [nicht definiert]

source: User Comment
de: Benutzer-Kommentar

# subElementsClick
source: [Sub elements, click for details]
de: [Unterelemente, anklicken für Details]

source: [Sub elements]
de: [Unterelemente]

# completeMatch
source: Complete match on editable fields.
de: Komplette Übereinstimmung in bearbeitbaren Feldern.

source: Editing
de: Bearbeitung

source: Send to Review
de: Sende zur Überprüfung

source: Review
de: Überprüfung

source: Swap
de: Tausche

source: Approve for Publishing
de: Veröffentlichung zustimmen

source: Publish
de: Veröffentlichen

source: Rejected
de: Zurückgewiesen

source: Comment:
de: Kommentar:

source: Reset stage
de: Stufe zurücksetzen

source: Undefined
de: Undefiniert

# rejectExplain
source: Please explain why you reject:
de: Bitte erläutern Sie die Zurückweisung:

source: Remove from workspace
de: Entfernen aus Arbeitsumgebung

source: Show Log
de: Protokoll anzeigen

source: [Live workspace]
de: [Live-Arbeitsumgebung]

source: Draft Workspaces
de: Entwurfarbeitsumgebungen

source: [Default Draft]
de: [Standard-Entwurf]

source: Errors:
de: Fehler:

source: Refresh
de: Aktualisieren

source: Allow preview of whole workspace
de: Vorschau der gesamten Arbeitsumgebung ermöglichen

source: Workspace-Id:
de: Arbeitsumgebungs-ID:

# versionSelect.label
source: Versions of this page:
de: Versionen dieser Seite:

# versionSelect.publish
source: Publish page
de: Seite veröffentlichen

# versionSelect.inBranch
source: Inside branch, no further versioning possible
de: Innerhalb Teilbereich, keine weitere Versionierung möglich

# versionSelect.versionsFound
source: Versions found on page, no "Page" versioning possible
de: Versionen auf Seite gefunden, keine "Seiten"-Versionierung möglich

# autopublishTask.name
source: Workspaces auto-publication
de: Automatische Veröffentlichung aus Arbeitungsumgebungen

# autopublishTask.description
source: This tasks checks any workspace that has a publication date set in the past and automatically publishes it.
de: Dieser Task überprüft jeden Arbeitsbereich auf ein Veröffentlichungsdatum in der Vergangenheit und veröffentlicht diesen automatisch.
