Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/css_styled_content/pi1/*.locallang.xlf
Languages: de

# label.toTop
source: To top
de: Nach oben

# uploads.icon
source: File link icon for %s
de: Datei-Link-Symbol für %s

# login.username
source: Username:
de: Benutzername:

# login.password
source: Password:
de: Passwort:

# login.login
source: Login
de: Anmelden

# login.logout
source: Logout
de: Abmelden

# search.emptySearch
source: Sorry, your search was empty!
de: Ihre Suche lieferte leider keine Ergebnisse.

# search.resultRange
source: Searchresult: ###RANGELOW###-###RANGEHIGH### of ###TOTAL###
de: Suchergebnis: ###RANGELOW###-###RANGEHIGH### von ###TOTAL###

# search.searchResultNext
source: Next
de: Nächste

# search.searchResultPrev
source: Prev
de: Vorherige

# search.searchWord
source: Searchword:
de: Suchwort:

# search.searchIn
source: Search in:
de: Suchen in:

# search.headersKeywords
source: Headers and keywords
de: Überschriften und Schlagwörter

# search.pageContent
source: Page content
de: Seiteninhalt

# search.searchButton
source: Search now!
de: Suchen!

# menu.bypassNavigation
source: Skip navigation block
de: Navigations-Block überspringen

# eIcon.html
source: Edit pure HTML content
de: Reinen HTML-Inhalt bearbeiten

# eIcon.header
source: Edit header
de: Überschrift bearbeiten

# eIcon.subheader
source: Edit subheader
de: Unterüberschrift bearbeiten

# eIcon.bodytext
source: Edit bodytext
de: Textkörper bearbeiten

# eIcon.images
source: Edit images
de: Bilder bearbeiten

# eIcon.caption
source: Edit image caption
de: Bildunterschrift bearbeiten

# eIcon.bullets
source: Edit bullet list
de: Aufzählungsliste bearbeiten

# eIcon.table
source: Edit table
de: Tabelle bearbeiten

# eIcon.filelist
source: Edit file list
de: Dateiliste bearbeiten

# eIcon.menuSitemap
source: Edit menu / sitemap
de: Menü/Sitemap bearbeiten

# eIcon.recordList
source: Edit recordlist
de: Datensatz bearbeiten

# eIcon.plugin
source: Change/configure plugin
de: Plug-In ändern/konfigurieren

# eIcon.multimedia
source: Edit multimedia element
de: Multimedia-Element bearbeiten

# eIcon.form
source: Edit email form
de: E-Mail-Formular bearbeiten

# eIcon.search
source: Edit search element
de: Suchformular bearbeiten

# eIcon.login
source: Edit login element
de: Anmeldung bearbeiten

# eIcon.page
source: Page:
de: Seite:
