Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/4.5/*.locallang_csh_pages.xlf
Languages: de

# description.description
source: Enter a short description of the page. It will be displayed in the result lists of most search engines.
de: Geben Sie eine kurze Beschreibung der Seite ein. Sie wird in den Ergebnislisten der meisten Suchmaschinen angezeigt.

# description.details
source: Most websites insert this description in a meta-tag on the page, but you may have to configure this yourself in your TypoScript template. Most search engines will display the description in their result list. Thus, the text should be short (about 160 characters maximum), and its wording should make sense when it shows up in the result list. In addition, the description will be displayed if you create a Content Element of type 'Sitemap' and then choose the menu type <i>Menu of subpages to these pages (with abstract)</i>. If an abstract exists for the page, it will be used instead of the description. <b>Note:</b> Some search engines only use the description if the text is not found elsewhere in the content. So do not just repeat yourself.
de: Die meisten Websites fügen die Beschreibung in einem meta-Tag auf einer Seite ein, aber es kann sein dass man dies im TypoScript-Template selber konfigurieren muss. Die meisten Suchmaschinen werden diese Beschreibung in ihrer Ergebnisliste anzeigen. Daher sollte diser Text kurz sein (ungefähr maximal 160 Zeichen) und die Formulierung sollte sinnvoll in der Ergebnisliste sein. Zusätzlich wird die beschreibung angezeigt, wenn man ein Content Element vom Typ 'Sitemap' anlegt und den Menü-Typ <i>Menü von Unterseiten (mit Inhaltsangabe)</i> wählt. Wenn eine Inhaltsangabe für eien Seite existiert wird dise statt der Beschreibung benutzt. <b>Beachte:</b> Einige Suchmaschinen benutzen die Beschreibung nur wenn der text nicht irgendwo anders auf der Seite erscheint. Also nicht einfach nur wiederholen.

# abstract.description
source: Enter an abstract of the contents. It may be displayed in an overview of articles.
de: Geben Sie eine Zusammenfassung des Inhalts ein. Sie kann in einer Übersicht von Artikeln angezeigt werden.

# abstract.details
source: An abstract is a short description of the page content that might be a little longer than the one in the <i>Description</i> field. Unlike the description, the abstract is not meant for display in search engine result lists, but is instead intended for you own use. If you create a Content Element of type <i>Sitemap</i> and then choose <i>Menu of subpages to these pages (with abstract)</i> an overview of pages will be created. If an abstract is available for a page it will be used instead of the description. <b>Note:</b> You do not have to enter the text of the description into the <i>Abstract field</i> again. Admins can also make custom use of this field via their TypoScript templates.
de: Eine Zusammanfassung ist eine kurze Beschreibung des Seiteninhaltes, der etwas länger sein kann als im Feld <i>Beschreibung</i>. Anders als die Beschreibung, ist die Zusammanfassung nicht dafür gedacht in den Ergebnissen von Suchmaschinen angezeigt zu werden, sondern für eigene Bedürfnisse genutzt zu werden. Wenn Sie ein Inhaltselement des Typs <i>Sitemap</i> erstellen und dann <i>Menü der Unterseiten dieser Seite (mit Zusammenfassung)</i> auswählen, wird eine Übersicht von Seiten erstellt. Falls eine Zusammenfassung für eine Seite existiert, wird diese anstelle der Beschreibung angezeigt. <b>Beachte:</b> man sollte nicht den Text der Beschreibung im <i>Feld Zusammenfassung</i> weiderholen. Administratoren können das Feld durch ihre TypoScript Templates benutzen.

# newUntil.description
source: Enter the date at which this page is no longer considered new.
de: Geben Sie ein Datum ein ab dem diese Seite nicht mehr als "neu" gilt.

# newUntil.details
source: The 'New Until' date of the page has no effect on the display of the webpage. This value is instead for internal use as a reminder of the date when the content of this page should be revised. If the content of the page will become outdated on a certain day, you could set this value to that approximate date. To get an overview of when pages will be outdated, use the 'Pagetree overview' in the 'Web>Info' Module.
de: Das Datum 'Neu bis' hat keine Auswirkungen auf die Anzeige der Seite. Der Wert ist für den internen Gebrauch gedacht, als Erinnerung für das Datum, zu dem die Seite überarbeitet werden soll. Falls der Inhalt der Seite an einem bestimmten Tag überholt sein wird, können Sie diesen Wert auf das ungefähre Datum setzen. Um einen Überblick über Seiten und deren Datum, ab dem sie überholt sein werden, zu bekommen, nutzen Sie die 'Seitenbaumübersicht' im Modul 'Web > Info'

# newUntil.syntax
source: See Page / Publication Date (click below)
de: Siehe Seite / Veröffentlichungsdatum (unten anklicken)

# lastUpdated.description
source: Enter the date and time of the most recent update to this page.
de: Geben Sie Datum und Zeit der letzten Änderung an dieser Seite ein.

# lastUpdated.details
source: How the value of this field is used is determined by the TypoScript template of the website. 'Last Update' content needs to be inserted on the pages and the TypoScript template must be configured to use this value. The most common use is to display the date from the automatically updated 'tstamp' field <em>unless</em> the 'Last Update' field is set. In this case, the date in 'Last Update' is used.
de: Wie der Wert dieses Feldes verwendet wird, wird durch das TypoScript Template der Seite bestimmt. Sollen Inhalte mit der Eigenschaft 'Zuletzt aktualisiert' angezeigt werden, müssen diese auf den Seiten eingefügt werden und das TypoScript Template so konfiguriert werden, dass es diesen Wert verwendet. Die häufigste Anwendung ist die Anzeige des Datums aus dem automatisch aktualisieten Feld 'tstamp', es sei denn das Feld 'zuletzt aktualisiert' ist gesetzt. In diesem Fall wird das Feld 'zuletzt aktualisiert' verwendet.

# lastUpdated.syntax
source: The format is HH:MM DD-MM-YYYY or HH:MM MM-DD-YYYY depending on your TYPO3 configuration. If you insert a 'd' the current time and date is inserted. You can also append any value in the field with a number lie '+10' which will add 10 days to the current value.
de: Abhängig von Ihrer TYPO3 Konfiguration ist das Format HH:MM DD-MM-YYYY oder HH:MM MM-DD-YYYY. Wenn Sie ein 'd' einfügen, werden die aktuelle Zeit und Datum eingesetzt. Sie können auch jedem Wert in dem Feld ein Zahl wie '+10' hinzufügen, was 10 Tage zu dem aktuellen Wert hinzu addiert.

# nav_hide.description
source: With this option the page will be not appear in menus in the Frontend. The page can still be viewed if linked by going directly to its URL.
de: Mit dieser Option wird die Seite nicht in den Menüs im Frontend angezeigt. Die Seite wird trotzdem noch angezeigt, wenn die URL direkt verlinkt ist.

# nav_title.description
source: Alternative Navigation Title for menu items in the Frontend. When set, this value is used instead of the Page Title.
de: Alternativer Navigationstitel für Menüelemente im Frontend. Falls dieser gesetzt ist, wird er statt des Seitentitels verwendet.

# content_from_pid.description
source: If set, this is an alternative page to select Content Elements from. Whether this field is used depends on the website's TypoScript template.
de: Falls gesetzt, wird eine andere Seite verwendet, von welcher die Inhaltselemente angezeigt werden. Ob dieses Feld verwendet wird, hängt von dem TypoScript template der Webseite ab.

# urltype.description
source: Set the Protocol for the URL.
de: Setzt das Protokoll der URL.

# shortcut_mode.description
source: Select a Shortcut Mode. By default the shortcut page must have a Shortcut Target to jump to. Other options are to go to the first subpage, to a random subpage, or back up to the parent page.
de: Wählen Sie einen Verweismodus. Standardmässig muss die Verweisseite ein Verweisziel haben. Andere Optionen sind zur ersten Unterseite, zu einer zufälligen Unterseite oder zurück zur Elternseite zu gehen.

# mount_pid.description
source: Mount this page. If set, subpages of this page come from the Mounted Page instead.
de: Verwenden Sie diese Seite als Objektträger. Falls gesetzt kommen Unterseiten dieser Seite dann von der angegebenen Seite.

# mount_pid.details
source: In the Frontend this is done by adding a new variable, &MP, to the URL. This links the mounted branch to the main branch by pairing page ids.
de: Im Frontend wird das durch das Hinzufügen der neuen Variable &MP zur URL erreicht. Dies verknüpft den "gemounteten" Ast mit dem Hauptast anhand der Seiten-Ids.

# mount_pid_ol.description
source: Show content for the current page or replace it completely with the Mounted Page.
de: Zeigt den Inhalt der aktuellen Seite oder ersetzt ihn vollständig durch die gemountete Seite.

# title.description.+
source: This is normally shown in the website navigation.
de: Dies wird üblicherweise in der Navigation der Website angezeigt.

# TSconfig.details.+
source: <strong>Example:</strong> The 'Web>Page' module lets you create content in four columns, Left, Normal, Right, Border if the template has been configured to use this option. (However, most websites use only one or two columns so some of these content columns are just taking up space and confusing users.) If you enter this string in the 'TSConfig' field, the 'Web>Page' Module will only show the 'Normal' and 'Border' column! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Must be entered in a single line!)
de: <strong>Beispiel:</strong> Im Modul 'Web>Seite' kann man Inhalte in vier Spalten erzeugen, links, normal, rechts, Rand, wenn das Template für die Nutzung der Spalten konfiguriert ist. (Wie auch immer, die meisten Websites nutzen nur eine oder zwei Spalten, so dass einige dieser Inhaltsspalten Platz verbrauchen und Anwender verwirren) Wenn man diese Zeichenkette im Feld 'TSConfig' eingibt, dann zeigt das Modul 'Web>Seite' nur die Spalten 'Normal' und 'Rand' an! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Muss auf einer Zeile angegeben werden!)

# l18n_cfg.description
source: Affect availability of pages in the various languages.
de: Wirkt sich auf die Verfügbarkeit in den verschiedenen Sprachen aus.

# l18n_cfg.details
source: <b>Hide default translation of page</b> If set, the page is only available in translated versions and not in the default language. Any attempt to access the page in the default language will result in an error message. <b>Hide page if no translation for current language exists</b> If set, any attempt to access the page in a translation that does not exist will result in an error message. By default, accessing an untranslated page will just show the default language instead.
de: <b>Verstecke Standardübersetzung der Seite</b> Falls gesetzt, ist die Seite nur in übersetzten Versionen und nicht in der Standardsprache verfügbar. Jeder Versuch die Seite in der Standardsprache anzuzeigen, endet mit einer Fehlermeldung. <b>Verstecke Seite, wenn keine Übersetzung für die aktuelle Sprache existiert</b> Falls gesetzt, wird jeder Versuch die Seite in einer Sprache, für die keine Übersetzung existiert, anzuzeigen, in einer Fehlermeldung enden. Üblicherweise wird eine Seite, für die keine Übersetzung existiert, in der Standardsprache angezeigt.
