Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/4.5/*.locallang_csh_pages.xlf
Languages: de

# layout.description
source: The Frontend Layout can change the way a page design appears.
de: Das Frontend-Layout kann das Aussehen einer Seite verändern.

# layout.details
source: This option may not have any impact on the Frontend page design since it depends on whether the Frontend template uses it. Most templates do not use it.
de: Diese Option hat nur dann Einfluss auf das Seitendesign im Frontend, wenn das Frontend-Template sie benutzt. Die meisten Templates tun dies nicht.

# doktype.description
source: Page Type determines whether the page is normal webpage, a shortcut to another webpage, or used in other internal ways.
de: Der Seitentyp bestimmt, ob die Seite eine normale Webseite ist, ein Verweis auf eine andere Webseite ist oder in einer anderen internen Weise verwendet wird.

# doktype.details
source: 'Standard' is the most common Page Type and is used for normal webpages. 'Backend User Section' is an option which creates pages that are only visible in the Frontend for Backend users who are logged in. <b>Link</b> 'Shortcut' pages jump to another page in the Pagetree. 'Mount Point' pages bring content from another branch of the Pagetree into the current branch. 'Link to External URL' is similar to 'Shortcut' but points to external URLs instead of TYPO3 pages. <b>Special</b> 'Folder' is a page type which is not shown as a webpage but is instead stores records of your choice. 'Recycler' is a garbage can. Pages and records in the Recycler are not visible in the Frontend. 'Menu Separator' is only useful if your Frontend memus are programmed to use it. It does not represent a page with content but is intended to be an unclickable placeholder in the menu. <b>Notice</b> Each Page Type is represented by a unique icon. The available page types can be restricted for users so all of the options described above may not be visible. Finally, particuilar record typoes may only be allowed on certain page types, but any record can be placed in a 'Folder.'
de: 'Standard' ist der am häufigsten verwendete Seitentyp und wird für normale Webseiten verwendet. 'Backend-Benutzerbereich' ist eine Option, die Seiten erstellt, welche nur im Frontend für Backend-Benutzer sichtbar sind wenn sie angemeldet sind. <b>Link</b> Seiten des Typs 'Verweis' verlinken auf eine andere Seite im Seitenbaum. Seiten des Typs 'Einstiegspunkt' bringen Inhalt aus einem anderen Teilbereich in den aktuellen Teilbereich. 'Link zu externer URL' ist ähnlich wie 'Verweis', zeigt aber auf externe URLs anstatt auf TYPO3-Seiten. <b>Spezial</b> 'Ordner' ist ein Seitentyp, der nicht als Webseite angezeigt wird, sondern Datensätze Ihrer Wahl beinhaltet. 'Papierkorb' ist ein Mülleimer. Seiten und Datensätze im Papierkorb sind nicht im Frontend sichtbar. 'Trennzeichen für Menü' ist nur sinnvoll, wenn ihre Frontend-Menüs so programmiert sind, dass diese verwendet werden können. Es stellt keine Seite mit Inhalt dar, sondern ist als nicht klickbarer Platzhalter in dem Menü gedacht. <b>Anmerkung</b> Jeder Seitentyp wird durch ein spezielles Symbol dargestellt. Die verfügbaren Seitentypen können für Benutzer eingeschränkt werden, so dass nicht alle oben genannten Optionen sichtbar sein könnten. Letztlich können bestimmte Datensatztypen nur in Verbindung mit bestimmten Seitentypen erlaubt sein, aber alle Datensätze können in einem 'Ordner' platziert werden.

# hidden.description
source: If this is checked, the page will be disabled on the website.
de: Wenn dieses Feld markiert ist, wird die Seite in der Webseite deaktiviert.

# hidden.details
source: The 'Disable,' 'Start,' 'Stop,' and 'Access' options are all about limiting access to pages and are thus related in functionality. When a page is not visible due to one of these options, the page will not show up in the site navigation. Notice, these options are related <em>only</em> to the page for which they are set. If you want their effect to cover the subpages as well, you must enable the 'Extend to Subpages' option. When you're logged in as a Backend user you can preview disabled pages if you have read access to them.
de: Die Einstellungen zu Sichtbarkeit, Veröffentlichungsdaten und Zugriffsrechten dienen alle zur Beschränkung des Zugriffs auf Seiten und sind miteinander verwandt. Wenn eine Seite wegen einer dieser Einstellungen nicht angezeigt wird, erscheint die Seite auch nicht in Menüs. Achtung: Diese Einstellungen beziehen sich <em>nur</em> auf die Seite, bei der sie gesetzt wurden. Wenn sie auch deren Unterseiten beeinflussen sollen, muß 'Auf Unterseiten ausdehnen' aktiviert werden. Angemeldete Backend-Benutzer können sich ausgeblendete Seiten anzeigen lassen, solange sie Leserechte zu ihnen haben.

# hidden.image_descr
source: The page icon of a disabled page is dimmed and a red X is added. If you view a page that is hidden and you are logged in into the Backend you will still be able to see the page. The red "Preview" box will tell you that this page is visible to you because of this special circumstance.
de: Das Seiten-Symbol einer deaktivierten Seite wird durch ein rotes Minus gekennzeichnet. Wenn Sie eine deaktivierte Seite betrachten, während Sie im Backend angemeldet sind, können Sie die Seite dennoch sehen. Die rote "Preview"-Box weist in solch einem Fall auf diesen gesonderten Umstand hin.

# starttime.description
source: The Publish Date determines when the page will be visible online. If the Publish Date is not set, the page will be available immediately.
de: Das Veröffentlichungsdatum bestimmt wann die Seite online sichtbar wird. Falls kein Veröffentlichungsdatum angegeben ist, ist die Seite sofort verfügbar.

# starttime.syntax
source: The Publish Date Format is either DD-MM-YYYY or MM-DD-YYYY depending on how TYPO3 is configured. There are also several shortcuts you can use when entering the date. If you insert a 'd' the current date will be inserted. You can also append any value in the field with a number such as '+10' which will add 10 days to the current value. For example, entering 'd+10' would result in a date 10 days from now.
de: Das Format des Veröffentlichungsdatums ist entweder DD-MM-YYYY order MM-DD-YYYY, abhängig von der TYPO3-Konfiguration. Es stehen verschiedene Kürzel zur Verfügung, die man zur Eingabe des Datums verwenden können. Setzt man ein 'd' ein, wird das aktuelle Datum eingefügt. Man kann außerdem jeden beliebigen Wert in dem Feld um eine Zahl ergänzen. So addiert '+10' 10 Tage zum aktuellen Wert. Zum Beispiel würde die Eingabe von 'd+10' in einem Datum in 10 Tagen ab heute resultieren.

# endtime.description
source: The Expiration Date specifies when the page will no longer be visible online.
de: Das Ablaufdatum bestimmt, ab wann die Seite nicht mehr online sichtbar sein wird.

# endtime.syntax
source: See Page / Publication Date (click below)
de: Siehe Seite / Veröffentlichungsdatum (unten anklicken)

# fe_group.description
source: If Usergroup Access Rights is set to a usergroup name, only website users who are members of the selected usergroup will be able to view the page. The special option 'Hide at Login' means the page will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the page visible for any logged in Frontend user.
de: Wenn für 'Zugriffsrechte für Benutzergruppen' der Name einer Benutzergruppe ausgewählt wurde, können nur Benutzer, die Mitglied dieser Gruppe sind, die Seite ansehen. Mit der Option 'Nach Anmeldung verbergen' ist die Seite für alle angemeldeten Benutzer <em>nicht</em> sichtbar. Entsprechend macht 'Anzeigen, wenn angemeldet' die Seite für alle angemeldeten Frontend-Benutzer sichtbar.

# extendToSubpages.description
source: By default the Publication Date, Expiration Date, Usergroup Access Rights, and Page Visibility options <em>only</em> affect the page where they are set. If the option 'Extend to Subpages' is checked for the page, then all subpages are affected as well.
de: Standardmäßig beeinflussen Veröffentlichungsdatum, Ablaufdatum, Zugriffsrechte für Benutzergruppen und Seiten-Sichtbarkeitseinstellungen <em>nur</em> die Seiten, in denen sie gesetzt sind. Wenn die Option 'Auf Unterseiten ausdehnen" für die Seite gesetzt ist, dann gilt das auch für alle Unterseiten.

# extendToSubpages.details
source: Consider a scenario where you want to create a section of subpages that are only visible for logged in users. Setting the Usergroup Access Rights for the top page in the section would remove the page from menus if no user was logged in. However, the subpage could still be accessed by guessing the ID number of the page and entering it manually in the URL. Setting the 'Extend to Subpages' option would extend the Usergroup Access Rights from the top page through all subpages as well.
de: Betrachtet man ein Szenario, in dem man einen Abschnitt von Unterseiten erstellen, die nur für angemeldete Benutzer sichtbar sind. Legt man für die Elternseite Zugriffsrechte in diesem Bereich fest, würde die Seite aus den Menüs entfernt werden, wenn kein Benutzer angemeldet ist. Auf die Unterseite könnte jedoch immer zugegriffen werden, wenn man die Seite-ID errät und diese manuell in der URL einträgt. Wird die Option "Auf Unterseiten ausdehnen" aktiviert, gelten die Zugriffrechte auch für alle Unterseiten.

# extendToSubpages.image_descr
source: This page has access restricted to a certain group and has "Extend to Subpages" set as well. This is reflected in the way the page icon has changed.
de: Für diese Seite ist der Zugriff auf eine bestimmte Gruppe beschränkt und die Option 'Auf Unterseiten ausdehnen' ist zusätzlich gesetzt. Dies wird durch das geänderte Seitensymbol verdeutlicht.

# alias.description
source: A URL Alias is a unique identification string for a page. You can use this string instead of the ID number to refer to the page.
de: Ein 'URL-Alias' ist ein eindeutiger Name für eine Seite. Dieser Name kann anstelle der numerischen ID verwendet werden, um auf die Seite zu verweisen.

# alias.details
source: Ultimately a page is identified by its ID number. For example, you may access a page in TYPO3 at '.../?id=123'. If the page with ID '123' has the URL Alias 'one_two_three', then the URL '.../?id=one_two_three' would display exactly the same page, because 'one_two_three' is a URL Alias for the ID '123'. URL Aliases are normally assigned to only the most frequently used pages rather than all pages. In most TYPO3 configurations you would be able to use the syntax '.. &lt;link one_two_three&gt;go to the page&lt;/link&gt; ..' to create a link to the page. This is easier to remember. Another use is if you need to change which page a commonly used link points to. In this case you can delete the URL Alias for the original page and re-add it on the new page. All links using the URL Alias would now refer to the new page and its ID number.
de: Letztlich wird eine Seite anhand seiner ID-Nummer identifiziert. Zum Beispiel können sie eine Seite in TYPO3 mit '.../?id=123' aufrufen. Wenn die Seite mit der ID '123' das URL-Alias 'eins_zwei_drei' hat, dann würde die URL '.../?id=eins_zwei_drei' exakt die selbe Seite anzeigen, weil 'eins_zwei_drei' ein URL-Alias für die ID '123' ist. URL-Aliase werden normalerweise nur den meistbesuchten Seiten zugewiesen, nicht allen. Bei den meisten TYPO3-Konfigurationen können Sie den Syntax '... &lt;link eins_zwei_drei&gt;gehe zur Seite&lt;/link&gt; ...' um einen Link zu einer Seite zu erstellen. Das ist besser merkbar. Ein weiterer Anwendungsfall ist, wenn man die Seite ändern will, auf die ein üblicherweise verwendeter Link zeigt. In diesem Fall können sie das URL-Alias auf der Originalseite löschen und es auf der neuen Seite wieder einsetzen. Alle Links, die das URL-Alias verwenden, würden nun auf die neue Seite und seine ID-Nummer verweisen.

# alias.syntax
source: A URL Alias can contain only lowercase alphanumeric characters and must be unique. Please note: If the URL Alias already exists in the site, it will have a number added to the end of it.
de: Ein URL-Alias darf nur Kleinbuchstaben und Ziffern enthalten und muss eindeutig sein. Bitte beachten Sie: Wenn ein gleichnamiger URL-Alias bereits existiert, wird am Ende eine Nummer angehängt werden.

# target.description
source: This sets the default Link Target for menu items linking to this page. Can also used to open the page as a popup window.
de: Dies setzt das standardmäßige Linkziel für die auf diese Seite verweisende Menüelemente. Es kann auch dazu verwendet werden um die Seite als Popup-Fenster zu öffnen.

# target.details
source: The Link Target overrides the default Link Target behavior, which should already be configured correctly for most pages in the website TypoScript template. There are additional options available by using the Link Target field Setting an integer value at the beginning of the field sets it as the default type for the page. For example, if an RSS feed is configured in TypoScript as typeNum=100, setting the Link Target to 100 could be used to add an RSS link in the menu. The following syntax is used to open the page in a popup window: 400x200 - Opens the page in a 400x200 popup window. 230x450:resizable=0,location=1 - Opens the page in a 230x450 popup window that is not resizable and has an address bar. Combined: 100 600x350 - Opens the page in a 600x350 popup with type=100 2 _blank - Opens the page with target "_blank" and type=2
de: Das Linkziel hebt das standardmäßige Linkziel-Verhalten auf, welches bereits richtig für die meisten Seiten im TypoScript-Template konfiguriert sein sollte. Für das Linkziel-Feld sind noch zusätzliche Optionen verfügbar. Wenn sie einen Zahlenwert am Anfang des Feldes eintragen, wird dieser als Standard-Typ für die Seite gesetzt. Wenn zum Beispiel ein RSS-Feed im TypoScript als typenum=100 konfiguriert ist, dann könnte der Eintrag 100 bei Linkziel benutzt werden, um einen RSS-Link im Menü hinzuzufügen. Der folgende Syntax verwendet, um eine Seite in einem Popup-Fenster zu öffnen: 400x200 - Öffnet die Seite in einem 400x200 Pixel großen Popup-Fenster. 230x450:resizable=0,location=1 - Öffnet die Seite in einem 230x450 Pixel großen Popup-Fenster, dessen Größe nicht verändert werden kann und das eine Adressleiste hat. Kombinationen: 100 600x350 - Öffnet die Seite in einem 600x350 Pixel großen Popup-Fenster mit type=100. 2 _blank - Öffnet die Seite mit dem Ziel "_blank" und type=2.

# no_cache.description
source: This option disables server caching of the page.
de: Diese Option deaktiviert das serverseitige Zwischenspeichern der Seite.

# no_cache.details
source: Normally pages in TYPO3 are cached on the server after being constructed for the first time. This means a page is displayed much faster the second time it's requested. For most pages this presents no problems; indeed, it boosts the performance of the website. However you may need to disable caching for a page if it contains dynamic content which must not be cached under any circumstances. Normally the PHP-code rendering such content is programmed to disable the caching automatically. But with this option you can force the page not to be cached.
de: Normalerweise werden Seiten in TYPO3 auf dem Server zwischengespeichert, nachdem sie das erste Mal erzeugt wurden. Dadurch wird die Seite wesentlich schneller angezeigt, wenn sie ein zweites Mal angefordert wird. Mit den meisten Seiten funktioniert das problemlos; tatsächlich erhöht sich die Geschwindigkeit der Website wesentlich. Allerdings kann es notwendig sein das Zwischenspeichern für Seiten zu deaktivieren, die dynamisch erzeugte Inhalte enthalten, die auf gar keinen Fall zwischengespeichert werden dürfen. Normalerweise wird bei solchen Inhalten das Zwischenspeichern automatisch durch den darstellenden PHP-Code deaktiviert. Mit dieser Einstellung kann man jedoch erzwingen, daß die Seite nicht zwischengespeichert wird.

# cache_timeout.description
source: Sets the Cache Lifetime for the page.
de: Setzt die Lebensdauer des Zwischenspeichers der Seite.

# cache_timeout.details
source: By default, pages are cached for 24 hours. After 24 hours, the page is constructed again and rewritten to the cache. Depending on your configuration, the cache may be cleared at midnight. When specific pages need a longer or shorter cache lifetime than the default, this option can be used.
de: Standardmäßig werden Seiten für 24 Stunden zwischengespeichert. Nach 24 Stunden wird die Seite neu erzeugt und neu in den Zwischenspeicher geschrieben. Abhängig von der Konfiguration wird der Zwischenspeicher möglicherweise um Mitternacht gelöscht. Wenn bestimmte Seiten eine längere oder kürzere Lebensdauer im Zwischenspeicher benötigen, kann diese Option vewendet werden.

# no_search.description
source: If enabled, this option excludes the page from searching operations on the website.
de: Falls aktiviert verhindert diese Einstellung, dass die Seite bei einer Suche berücksichtigt wird.

# author.description
source: Enter the page author's name.
de: Geben Sie den Namen des Seitenautors ein.

# author.details
source: Whether the author name is used or not depends on the setup of your TypoScript template. - You may use it in a meta-tag. - If you're using TYPO3 pages as 'articles' then you could use this field to display the name of the page (article) author.
de: Ob der Name des Autors verwendet wird oder nicht, hängt von den Einstellungen in ihrem TypoScript-Template ab. - Sie können es in einem Meta-Tag verwenden. - Wenn sie TYPO3-Seiten als 'Artikel' verwenden, könnten sie das Feld dazu benutzen, um den Namen des Seiten-/Artikel-Autors anzuzeigen.

# author_email.description
source: Enter the page author's email address.
de: Geben Sie die E-Mail-Adresse des Autors ein.

# module.description
source: Define the page as containing a Frontend plugin.
de: Seite als Container für eine Erweiterung definieren.

# module.details
source: Setting this option lets the Backend knows this page contains specific content or has a specific purpose, such as containing a forum or acting as the root page of a shop section on the website. Based on this setting the Backend is able to display a shortcut list as well as relevant functionality in the 'Web>Modules' module. The Frontend display is largely not affected. Marking a page as containing a 'Shop' plugin simply means it'll show up in the shortcut list of modules in the backend. For additional details on this option, refer to the administration documentation. It's recommended that only admin-users have access to this field!
de: Das setzen diese Option zeigt im Backend an, ob diese Seite einen speziellen Inhalt oder Zweck hat; beispielsweise, dass sie eine Forum enthält oder die Ursprungsseite eines Shop-Bereiches der Webseite ist. Auf Basis dieser Einstellung kann das Backend eine Verweisliste und relenvante Funktionen im 'Web>Module' Modul anzeigen. Die Frontend-Anzeige ist davon größtenteils unbeeinflusst. Die Seite als Inhaltsseite für ein 'Shop' Plug-in zu markieren bedeutet ganz einfach, dass sie in der Verweisliste der Module im Backend erscheinen wird. Bezüglich weiterer Details zu dieser Option verwenden sie bitte die Administrationsdokumentation. Es wird empfohlen, dass nur Admin-Benutzer Zugriff auf dieses Feld haben!

# media.description
source: Attach media files related to the page.
de: Medien-Dateien mit Bezug zu dieser Seite hinzufügen.

# media.details
source: This field allows you to attach various files to the page, but how these files are used depends on your template. As an example the template could be use this field to allow a logo to be attached to the page or it might expect the first file to be an image used as a link in the navigation menu. Remember, this totally depends on how the template is programmed.
de: Mit diesem Feld können sie der Seite verschiedenste Dateien anfügen. Wie diese Dateien verwendet werden hängt von Ihrer Vorlage (Template) ab. Beispielsweise könnte das Template diese Feld benutzen um der Seite ein Logo hinzuzufügen oder es könnte ebenso die erste Datei in Form eines Bildes dazu benutzen, einen Link im Navigationsmenü darzustellen. Zur Erinnerung: es hängt gänzlich davon ab wie ihr Template programmiert ist.

# subtitle.description
source: Enter a subtitle if needed.
de: Geben Sie, falls notwendig, einen Untertitel ein.

# subtitle.details
source: Whether this field is used or not depends on the template. In most cases it's not used.
de: Ob diese Feld benutzt wird oder nicht, hängt von ihrem Template ab. In den meisten Fällen wird es nicht benutzt.

# url.description
source: Enter the URL this page redirects to.
de: Geben sie die URL ein, auf die diese Seite weiterleitet.

# url.details
source: For example, 'http://www.typo3.org' or just 'www.typo3.org' if the 'Protocol' selector is set to 'http://'. Use the 'Protocol' selector to select a prefix for the URL. This option is used only if the page 'Type' is set to 'Link to External URL.'
de: Zum Beispiel: 'http://www.typo3.de' oder nur 'www.typo3.de', wenn bei 'Protokoll' 'http://' eingestellt ist. Benutzen Sie die Auswahl 'Protokoll' um einen Präfix für die URL einzustellen. Diese Option wird nur benutzt, wenn die Seite vom 'Typ' auf 'Link zu externer URL' ausgewählt ist.

# shortcut.description
source: Select a page to act as the Shortcut Target. When the current page is requested in the Frontend, it will be redirected to the Shortcut Target.
de: Wähle eine Seite als Verweisziel. Wird die aktuelle Seite im Frontend angefordert, erfolgt eine Weiterleitung zum Verweisziel.

# shortcut.details
source: Click the 'Browse for Records' icon and a new window will appear in which you can easily select a page to act as the Shortcut Target. This option is used only if the page 'Type' is set to 'Shortcut.'
de: Klicken Sie das 'Datensätze durchblättern'-Symbol. Es erscheint ein neues Fenster, in dem sie einfach eine Seite aussuchen können, die als Verweis-Ziel verwendet werden soll. Diese Option wird nur benutzt, wenn in der Seite der Typ 'Verweis' ausgewählt ist.

# shortcut.image_descr
source: Select a Shortcut Target page with the Element Browser.
de: Wählen Sie ein Verweisziel in der Elementauswahl.

# keywords.description
source: Enter keywords for the page separated by commas. You may also use short phrases.
de: Geben sie Stichworte, getrennt durch Kommata, für die Seite ein. Sie können auch kurze Sätze verwenden.

# keywords.details
source: Most TYPO3 websites use these keywords in a meta-tag on the page, but you may have to setup the appropriate TypoScript template yourself. To optimize your page for search engines like Google you should not use more than 3 to 6 keywords. You should also make sure that the keywords are found in the content of the page. Note that search engine extensions for TYPO3 such as Indexed Search can also be configured to make use of the keywords. The keywords can also be used to create a menu of related pages. Create a Content Element of type 'Sitemap' and then choose the menu type <i>Related pages (based on keywords)</i>.
de: Die meisten TYPO3 Websites verwende diese Schlüsselworte in einem Meta-Tag auf der Seite, aber man muss das entsprechende TypoScript-Template selbst erstellen Um eine Seite für Suchmaschinen wie Google zu optimieren sollte man nicht mehr als 3 bis 6 Schlüsselworte benutzen. Man sollte auch sicher stellen, dass diese Schlüsselworte im Inhalt der Seite vorhanden sind. Beachte dass Such-Erweiterungen für TYPO3 wie "Indexed Search" so konfiguriert werden, dass sie diese Schlüsselworte zu verwenden. Die Schlüsselworte können ebenfalls dazu benutzt werden um ein Menü von verwandten Seiten zu erzeugen. Lege ein Inhaltselement vom Typ 'Sitemap' an und wähle den Menütyp <i>Verwandte Seiten (basierend auf Schlüsselworten)</i>
