Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/BlockElements/*.locallang.xlf
Languages: de

# Indent-Tooltip
source: Increase indent
de: Einzug vergrößern

# Indent-helpText
source: Increases text indentation
de: Vergrößert den Texteinzug

# Outdent-Tooltip
source: Reduce indent
de: Einzug verkleinern

# Outdent-helpText
source: Reduces text indentation
de: Verringert den Texteinzug

# Blockquote-Tooltip
source: Large quotation
de: Großes Zitat

# Blockquote-helpText
source: Makes a large quotation block
de: Erzeugt einen großen Zitatblock

# FormatBlock-Tooltip
source: Type of block
de: Blocktyp

# InsertParagraphBefore-Tooltip
source: Insert a paragraph before the current block
de: Einen Absatz vor dem aktuellen Block einfügen

# InsertParagraphBefore-contextMenuTitle
source: Insert paragraph before
de: Absatz einfügen vor

# InsertParagraphBefore-helpText
source: Inserts a paragraph before the current block
de: Fügt einen Absatz vor dem aktuellen Block ein

# InsertParagraphAfter-Tooltip
source: Insert a paragraph after the current block
de: Einen Absatz nach dem aktuellen Block einfügen

# InsertParagraphAfter-contextMenuTitle
source: Insert paragraph after
de: Absatz einfügen nach

# InsertParagraphAfter-helpText
source: Inserts a paragraph after the current block
de: Fügt einen Absatz nach dem aktuellen Block ein

# JustifyLeft-Tooltip
source: Justify left
de: Linksbündig

# JustifyLeft-helpText
source: Aligns the text to the left
de: Richtet den Text linksbündig aus

# JustifyCenter-Tooltip
source: Center
de: Zentriert

# JustifyCenter-helpText
source: Centers the text
de: Richtet den Text zentriert aus

# JustifyRight-Tooltip
source: Justify right
de: Rechtsbündig

# JustifyRight-helpText
source: Aligns the text to the right
de: Richtet den Text rechtsbündig aus

# JustifyFull-Tooltip
source: Justify left and right
de: Blocksatz

# JustifyFull-helpText
source: Aligns the text both to the left and the right
de: Richtet den Text gleichzeitig links- und rechtsbündig aus

# Left-Tooltip
source: Left
de: Links

# InsertOrderedList-Tooltip
source: Ordered List
de: Nummerierung

# InsertOrderedList-helpText
source: Makes an ordered list from the curent selection
de: Erzeugt eine Nummerierung aus dem aktuell ausgewählten Text

# InsertUnorderedList-Tooltip
source: Bulleted List
de: Aufzählung

# InsertUnorderedList-helpText
source: Makes an bulleted list from the curent selection
de: Erzeugt eine Aufzählung aus dem aktuell ausgewählten Text

# InsertHorizontalRule-Tooltip
source: Horizontal Rule
de: Horizontale Trennlinie

# InsertHorizontalRule-helpText
source: Inserts an horizontal rule
de: Fügt eine horizontale Trennlinie ein

# No block
source: No block format
de: Kein Blockformat

# Remove block
source: Remove block format
de: Blockformat entfernen
