Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/Acronym/*.locallang.xlf
Languages: de

# Insert/Modify Acronym
source: Insert/edit abbreviation
de: Abkürzung einfügen/bearbeiten

source: Insert abbreviation
de: Abkürzung einfügen

source: Edit abbreviation
de: Abkürzung bearbeiten

# Term_to_abridge
source: Term to abbreviate
de: Abzukürzender Begriff

# Defined_acronym
source: Pre-defined acronyms
de: Vordefinierte Akronyme

# Defined_abbr
source: Pre-defined abbreviations
de: Vordefinierte Abkürzungen

source: Term
de: Begriff

# Unabridged_term
source: Term
de: Vollständiger Begriff

source: Select a term
de: Einen Begriff auswählen

# Abridged_term
source: Short form
de: Abgekürzter Begriff

source: Acronym
de: Akronym

source: Abbreviation
de: Abkürzung

source: Select an acronym
de: Ein Akronym auswählen

# Select_an_abbr
source: Select an abbreviation
de: Eine Abkürzung auswählen

source: Use this term
de: Diesen Begriff verwenden

# Use_this_term_explain
source: Associate this term to the current selection
de: Diesen Begriff der aktuellen Auswahl zuordnen

source: Delete
de: Löschen

source: Select a language
de: Eine Sprache auswählen

# Language_abbr_helpText
source: This is the language for which the abbreviation is defined
de: Die Sprache, für die die Abkürzung definiert wurde

# Language_acronym_helpText
source: This is the language for which the acronym is defined
de: Die Sprache, für die das Akronym definiert wurde
