Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/ContextMenu/*.locallang.xlf
Languages: de

source: Remove the
de: Entferne das

# Remove this node from the document
source: Removes this node from the document
de: Diesen Knoten aus dem Dokument entfernen

# TO-toggle-borders-tooltip
source: Toggle borders
de: Ränder umschalten

# TO-cell-prop-tooltip
source: Shows the Table Cell Properties dialogue
de: Zeigt den Zelleigenschaftsdialog der Tabelle

# TO-cell-insert-before-tooltip
source: Inserts a new cell before the current one
de: Fügt eine neue Zelle vor der aktuellen ein

# TO-cell-insert-after-tooltip
source: Inserts a new cell after the current one
de: Fügt eine neue Zelle nach der aktuellen ein

# TO-cell-delete-tooltip
source: Deletes the current cell
de: Löscht die gerade gewählten Zelle

# TO-cell-split-tooltip
source: Splits the current cell
de: Trennt die gerade gewählte Zelle

# TO-cell-merge-tooltip
source: Merges the selected cells
de: Verbindet die ausgewähten Zellen

# TO-row-prop-tooltip
source: Shows the Table Row Properties dialogue
de: Zeigt den Zeileneigenschaftsdialog der Tabelle

# TO-row-insert-above-tooltip
source: Inserts a new row before the current one
de: Fügt eine neue Zeile vor der aktuellen ein

# TO-row-insert-under-tooltip
source: Inserts a new row after the current one
de: Fügt eine neue Zeile nach der aktuellen ein

# TO-row-delete-tooltip
source: Deletes the current row
de: Löscht die aktuelle Zeile

# TO-row-split-tooltip
source: Splits the current row
de: Trennt die gerade gewählte Zelle

# TO-table-prop-tooltip
source: Shows the Table Properties dialogue
de: Zeigt den Tabelleneigenschaftsdialog

# TO-table-restyle-tooltip
source: Re-applies the odd-even styles on the table
de: Wendet die Stile für gerade/ungerade erneut auf die Tabelle an

# TO-col-prop-tooltip
source: Shows the Column Cells Properties dialogue
de: Zeigt den Spaltenzelleigenschaftendialog an

# TO-col-insert-before-tooltip
source: Inserts a new column before the current one
de: Fügt eine neue Spalte vor der aktuellen ein

# TO-col-insert-after-tooltip
source: Inserts a new column after the current one
de: Fügt eine neue Spalte nach der aktuellen ein

# TO-col-delete-tooltip
source: Deletes the current column
de: Löscht die aktuelle Spalte

# TO-col-split-tooltip
source: Splits the current column
de: Trennt die aktulle Spalte

# Please confirm remove
source: Please confirm that you want to remove this element:
de: Mit Löschen des Element fortfahren:

source: How did you get here? (Please report!)
de: Wie gelangten Sie hierher? (Bitte melden!)

source: Show the image properties dialog
de: Zeigt den Bildeigenschaftsdialog

source: Modify URL
de: URL ändern

source: Current URL is
de: Die momentane URL ist

source: Opens this link in a new window
de: Öffnet diesen Link in einem neuen Fenster

# Please confirm unlink
source: Please confirm that you want to unlink this element.
de: Mit Löschen des Links fortfahren:

source: Link points to:
de: Der Link zeigt auf:

source: Unlink the current element
de: Den aktuellen Link entfernen

source: Cut
de: Ausschneiden

source: Copy
de: Kopieren

source: Paste
de: Einfügen

source: _Image Properties
de: _Bildeigenschaften

source: _Modify Link
de: _Link ändern

source: Chec_k Link
de: Lin_k prüfen

source: _Remove Link
de: Link entfe_rnen

# TO-toggle-borders-title
source: Toggle borders
de: Ränder umschalten

# TO-cell-prop-title
source: C_ell Properties
de: Z_elleigenschaften

# TO-cell-insert-before-title
source: Insert cell before
de: Zelle davor einfügen

# TO-cell-insert-after-title
source: Insert cell after
de: Zelle danach einfügen

# TO-cell-delete-title
source: Delete Cell
de: Zelle löschen

# TO-cell-split-title
source: Split Cell
de: Zelle teilen

# TO-cell-merge-title
source: Merge Cells
de: Zellen verbinden

# TO-row-prop-title
source: Ro_w Properties
de: _Zeileneigenschaften

# TO-row-insert-above-title
source: I_nsert Row Before
de: Zeile ei_nfügen vor

# TO-row-insert-under-title
source: In_sert Row After
de: Zeile ein_fügen nach

# TO-row-delete-title
source: _Delete Row
de: Zeile lö_schen

# TO-row-split-title
source: Split Row
de: Zeile teilen

# TO-table-prop-title
source: _Table Properties
de: _Tabelleneigenschaften

# TO-table-restyle-title
source: Re-apply table styles
de: Tabellenstile erneut anwenden

# TO-col-prop-title
source: Column Cells Properties
de: Spaltenzelleneigenschaften

# TO-col-insert-before-title
source: Insert _Column Before
de: Sp_alte einfügen vor

# TO-col-insert-after-title
source: Insert C_olumn After
de: Spalte einfü_gen nach

# TO-col-delete-title
source: De_lete Column
de: Spalte _löschen

# TO-col-split-title
source: Split Column
de: Spalte teilen

source: Create a link
de: Link erzeugen

source: Insert paragraph before
de: Fügt einen Absatz vor diesem ein

source: Insert a paragraph before the current node
de: Fügt einen Absatz vor dem aktuellen Knotenpunkt ein

source: Insert paragraph after
de: Fügt einen Absatz nach diesem ein

source: Insert a paragraph after the current node
de: Fügt einen Absatz vor dem aktuellen Knotenpunkt ein

# JustifyLeft-title
source: Justify Left
de: Linksbündig

# JustifyCenter-title
source: Justify Center
de: Zentriert

# JustifyRight-title
source: Justify Right
de: Rechtsbündig

# JustifyFull-title
source: Justify Full
de: Blocksatz

# JustifyLeft-tooltip
source: Aligns text to the left
de: Richtet den Text linksbündig aus

# JustifyCenter-tooltip
source: Centers the text
de: Zentriert den Text

# JustifyRight-tooltip
source: Aligns text to the right
de: Richtet den Text rechtsbündig aus

# JustifyFull-tooltip
source: Aligns text both to the left and the right
de: Verteilt den Text gleichmäßig über die Zeile

source: Make lin_k
de: Lin_k erzeugen
