Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_systmpl.xlf
Languages: de

# .description
source: TypoScript template record.
de: TypoScript-Template-Datensatz.

# .details
source: The 'Template' records are the vital components used to set the design of the webpages. No matter how (almost) you would like to build your website, it must be initiated by a 'Template' record placed in the root of the page tree of the site. Basically, create a 'Template' record, enter a title and make sure to check of Clear constants, setup and Rootline. Then enter some TypoScript configuration in the Setup field and you're set. It's very important to read how to do all this in the documents listed below! Also make sure you use the Web>Template module to do all the working with templates. It's a specialized tool to help you with this.
de: Die Template-Datensätze bilden das Herzstück für das gesamte Design Ihrer Website. Ganz gleich, wie Sie Ihre Website gestalten wollen, alles fängt damit an, dass ein Template-Datensatz am Anfang Ihres Seitenbaumes steht. Im Grunde genommen legen Sie dazu einfach einen Template-Datensatz an, geben diesem einen Namen und vergewissern sich, dass Sie die Option "Lösche Konstanten, Setup und Rootline" gewählt haben. Dann geben Sie noch einige TypoScript-Zeilen innerhalb des Feldes "Setup" ein und schon kann es losgehen. Das ist natürlich eine stark vereinfachte Darstellung. Für ein erfolgreiches, produktives Arbeiten mit TYPO3 ist es sehr wichtig, dass Sie sich die unten aufgeführten Dokumente sehr aufmerksam durchlesen! Benutzen Sie für Ihre Arbeit mit Templates stets das Modus Web > Template. Es bietet Ihnen spezielle Funktionen, die den Umgang und die Arbeit mit Templates sehr vereinfachen können.

# _.seeAlso
source: static_template TSref | http://typo3.org/documentation/document-library/doc_core_tsref/ TypoScript by Example | http://typo3.org/documentation/document-library/doc_core_tsbyex/
de: StatischeTypoScript-Templates in TSref | http://typo3.org/documentation/document-library/doc_core_tsref/ TypoScript by Example | http://typo3.org/documentation/document-library/doc_core_tsbyex/

# .image_descr
source: A Template Record with constants and setup code. The Web>Template module contains tools which will help you to edit and validate TypoScript structures.
de: Ein Template-Datensatz mit Konstanten- und Setup-Code. Das Modul Web > Template enthält Werkzeuge, die beim Erstellen und Testen von Template hilfreich sein können.

# hidden.description
source: Hiding the template will deactivate the template record.
de: Mit dieser Option können Sie den Template-Datensatz verbergen bzw. deaktivieren.

# hidden.details
source: If the Template Record was the first record on a page hiding it will expose the second record on the page instead.
de: Wenn der Template-Datensatz der erste Template-Eintrag einer Seite war, so wird stattdessen automatisch der nächste Template-Eintrag aktiviert.

# starttime.description
source: Start time. Use this to enable a template on a certain date.
de: Startzeit. Verwenden Sie diese Option, um ein Template zu einer bestimmten Zeit zu aktivieren.

# endtime.description
source: End time. Use this to disable a template on a certain date.
de: Stoppzeit. Verwenden Sie diese Option, um ein Template zu einer bestimmten Zeit zu deaktivieren.

# title.description
source: The title of the template record is only an internal label and does not have any effect on the output in the frontend.
de: Der Titel des Template-Datensatzes wird lediglich intern verwendet und erscheint zu keiner Zeit innerhalb der Website.

# sitetitle.description
source: Website title. Typically this will automatically be prefixed all page titles in the <title> tag of the frontend pages.
de: Website-Titel. Entspricht dem HTML-Tag <title> und wird normalerweise innerhalb der Titelleiste des Browsers auf jeder Seite angezeigt.

# constants.description
source: TypoScript Constants.
de: TypoScript-Konstanten

# config.details
source: Read more about TypoScript Templates in TSref, TypoScript by Example and Getting Started.
de: Hinter TypoScript steckt ein sehr mächtiges Konzept zur Gestaltung dynamischer Websites auf Basis von TYPO3. TypoScript an dieser Stelle zu erklären, würde den Rahmen dieser Onlinehilfe sprengen. Mehr über TypoScript-Templates erfahren Sie deshalb in den Referenzdokumenten <em>TSref</em>, <em>TypoScript by Example</em> und <em>Getting Started</em>.

# resources.description
source: Resource files for the template. For example a logo, a TTF-font etc.
de: Ressourcen für das Template, z.B. Bilddateien, True-Type-Schriften, HTML-Vorlagen usw.

# resources.details
source: Resource files can be referenced in TypoScript Template code by [filename]*.[ext] and has the advantage that the reference from TypoScript is not broken if you copy or export a Template Record where the resources ends up with new names.
de: Dateiressourcen können innerhalb des TypoScript-Template-Codes durch [dateiname]*.ext angesprochen werden. Der Vorteil dieser Methode: werden Vorlagendatensätze kopiert oder exportiert, bleiben die Referenzen auf die dazugehörigen Ressourcen erhalten und zwar auch für den Fall, dass die Ressourcen geänderte Dateinamen erhalten.

# clear.description
source: Flags that will clear the inheritance of TypoScript code from former templates in the root line. There is a flag for Constants and one for Setup code.
de: Mit diesen Optionen wird die Vererbung des TypoScript-Codes übergeordenter (d.h. im Seitenbaum näher an der Wurzel angesiedelter) Vorlagen unterbunden. Diese Option kann für Konstanten und Setup-Code gesetzt werden.

# clear.details
source: In the Web > Template / Template Analyser module you can see how far back in the template tree that constants and setup code is inherited.
de: Innerhalb des Moduls Web > Template können Sie sich mit dem Template Analyzer die Vererbungsstruktur für Konstanten und Setup-Code innerhalb des Vorlagenbaumes anzeigen lassen.

# root.description
source: Defines that the template represents a root of a website.
de: Legt fest, dass mit diesem Template die Wurzel des Seitenbaumes (inklusive aller Unterseiten) dargestellt wird.

# includeStaticAfterBasedOn.description
source: If set, static templates will be included after "based-on" templates. It basically swaps the order of inclusion of these external TypoScript sources.
de: Mit dieser Option wird festgelegt, dass statische Templates nach den Basis-Templates eingebunden werden (die Reihenfolge der Einbindung also umgekehrt).

# includeStaticAfterBasedOn.details
source: The Web > Template / Template Analyser module allows you to view the order of inclusion of all TypoScript sources your template uses.
de: Innerhalb des Moduls Web > Template können Sie sich mit dem Template Analyzer die Reihenfolge der Einbindung aller TypoScript-Daten, welche Ihre Vorlage verwendet, anzeigen lassen.

# include_static.description
source: Static Template records to include.
de: Einzubindende statische Template-Datensätze

# include_static_file.description
source: Static Template files to include.
de: Einzubindende statische Template-Dateien

# include_static_file.details
source: Static template files are registered by extensions contrary to Static Template records which come from the static database table, "static_template".
de: Statische Template-Dateien werden durch Erweiterungen registriert bzw. zur Verfügung gestellt, im Gegensatz zu den statischen Template-Datensätzen, welche aus einer statischen Datenbanktabelle (static_template) stammen.

# basedOn.description
source: Other Template Records that are included like "static templates".
de: Andere Template-Datensätze, die wie "Statische Templates" eingebunden werden.

# static_file_mode.description
source: Define the mode of inclusion of static template files.
de: Mit dieser Option legen Sie die Reihenfolge beim Einbinden statischer Template-Dateien fest.

# static_file_mode.details
source: If you are in doubt about the inclusion order, make sure to use the Web > Template / Template Analyser to view the order.
de: Wenn Sie sich über die Reihenfolge im Unklaren sind, können Sie sich diese mit dem Modul Web > Template (Template Analyzer) auch anzeigen lassen.

# nextLevel.description
source: Defines a template record to make active one level out in the page tree of this branch. This can be used to define another template record for the general website while having a special template for the frontpage.
de: Definiert die "Zuständigkeit" eines Template-Datensatzes für die nächst tiefere Ebene innerhalb der Seitenbaumes. Dadurch kann man beispielsweise der Einstiegsseite einer Website ein spezielles Design zuweisen, während alle untergeordenten Seiten ein anderes Design erhalten.

# description.description
source: Enter a description of the template if you like.
de: Geben Sie hier eine Beschreibung für dieses Template an.

# editorcfg.description
source: Editor Configuration for the stylesheet editor extension.
de: Editor-Konfiguration für die Erweiterung Stylesheet-Editor.
