Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: de

# bodytext.details
source: Here you enter the body text of the content element. Usually you can use some HTML formatting tags, if you're using Internet Explorer you can even format the content visually. The field is reused in most other types and so switching between the content element types will bring the value of this field with it. When you're using this field with the "Text" and "Text w/image" types, the content is used as ordinary body text. Each linebreak normally signifies a new paragraph, you can use the special TYPO3 tag, &lt;LINK&gt;, for making links. You can use many HTML tags but there are limitations as well. This will depend on the implementation. <b>Bulletlists:</b> If the type is "Bulletlist" each line in this field is a bulletlist entry. <b>Tables:</b> If the type is "Table" each line represents a table row. Within each line you divide the columns by inserting a vertical bar, |. So making a table row with 3 columns could look like "This is column 1 | Column 2 here | Third column!". Use the table wizard for creating tables - that is much easier than "coding" them. <b>Parameters:</b> Types like "Script", "Form" and "Multimedia" use this field for parameters you can pass to the element. And the "HTML" type accepts any input as raw HTML which is simply displayed on the website without any preprocessing. <strong>Rich Text Editor:</strong> With the types "Text" and "Text w/image" the Rich Text editor is used for editing if your browser supports it and the editor is generally enabled in the system. Be aware that the content is "cleansed" before it goes into the database when you're using the "Text" and "Text w/image" types. <b>Making a mail form:</b> When you have selected the content element type "Form" you should enter lines of parameters into this field. This is a brief example: Your name: | *name=input,40 | [Enter name!] Your email: | *email=input,40 Your address: | address=textarea,40,10 Your haircolor: |hair=radio|Blue=blue, Red=red |formtype_mail = submit | Send form |subject=hidden| Enter a subject here! |html_enabled=hidden | 1 The first two lines makes input-fields for name and email, both are marked "required" by the * and the name field has a default value of "[Enter name!]". The third line is a text box and the fourth makes radiobuttons to select haircolor. Then there are three important lines in the end. The first makes a submit button with the label "Send form", the second line is the subject of the email the receiver gets and the third line makes the form result render in an HTML-table. It is much easier to use the Form Wizard for creating forms. <b>Notice:</b> Before any form will ever work, you must enter a recipient email address. The "Recipient-email:" field is used for that (this is in fact the Subheader field used!).
de: Geben Sie hier den Text des Inhaltselements ein. Oft können Sie diesen Text mit einem "Rich-Text-Editor" bearbeiten, der einem einfachen Textverarbeitungssystem ähnelt (siehe unten). Manchmal sehen Sie nur ein einfaches Eingabefeld, z.B. dann, wenn der Text nicht formatierbar ist. Dieses Feld wird in fast allen Inhaltstypen verwendet, so dass beim Wechsel zwischen Typen der Inhalt dieses Feldes nicht verloren ist. Sie können den Typ gefahrlos umschalten und nötigenfalls jederzeit zum alten Typ zurückschalten. <b>Text</b> und <b>Text und Bilder:</b> Wenn Sie als Inhaltstyp "Text" oder "Text und Bilder" wählen, ist der Inhalt normaler Text. Jeder harte Zeilenumbruch bewirkt einen neuen Absatz, Sie können das spezielle TYPO3-Tag &lt;LINK&gt; zur Erzeugung eines Links verwenden. Sie können auch verschiedene HTML-Tags verwenden, mit Einschränkungen. <b>Aufzählung:</b> Wenn Sie den Typ "Aufzählung" ausgewählt haben, ist jede Zeile ein Listeneintrag. <b>Tabelle:</b> Wenn der Typ "Tabelle" ist, so repräsentiert jede Zeile eine Tabellenzeile. Innerhalb jeder Zeile werden die Spalten durch einen vertikalen Strich getrennt: "|". Eine Tabellenzeile mit drei Spalten könnte so aussehen: "Dies ist Spalte 1 | Spalte 2 hier | Dritte Spalte!" <b>Skript</b>, <b>Formular</b>, <b>Multimedia</b> und <b>HTML:</b> Typen wie "Skript", "Formular" und "Multimedia" benutzen das Feld für Parameter, die Sie dem Element übergeben können. Und der "HTML"-Typ akzeptiert jede Eingabe als reines HTML, das ohne weitere Bearbeitung auf der Web-Seite ausgegeben wird. <strong>Rich Text Editor:</strong> Für die Typen "Text", "Text und Bilder" und "Rich Text" wird der Rich-Text-Editor benutzt, vorausgesetzt, dass der Editor grundsätzlich aktiviert ist. Dann haben Sie eine mehr oder minder umfangreiche Werkzeugleiste zur Verfügung, um den Text zu formatieren. Alle Einschränkungen sind beabsichtigt: die <b>Vorlage</b> ist in der Regel für Formatierung verantwortlich und so beschaffen, dass ein angemessenes, einheitliches Aussehen aller Seiten einer Website garantiert ist. Beachten Sie auch, dass der Inhalt bezüglich HTML "gereinigt" wird, bevor er in die Datenbank geschrieben wird. Ist der "Rich-Text-Editor" in Ihrem Browser nicht verfügbar, dann sehen Sie stattdessen einfaches HTML, dass Sie auch bearbeiten dürfen, wenn Sie die nötigen Kenntnisse haben. Wenden Sie sich bitte an ihre Administratoren, um, bei Bedarf, eine Grundausbildung in HTML oder den "Rich-Text-Editor" zu bekommen. <b>Ein Mail-Formular erstellen:</b> Wenn Sie den Inhaltstyp "Formular" ausgewählt haben, sollten Sie Parameter in dieses Feld eingeben. Dies ist ein kurzes Beispiel: <nobr> Ihr Name: | *name=input,40 | [Name eingeben!] Ihre E-Mail-Adresse: | *email=input,40 Ihre Adresse: | adresse=textarea,40,10 Ihre Haarfarbe: |haar=radio|Blau=blau, Rot=rot |formtype_mail = submit | Formular senden |subject=hidden| Betrifft: meine Daten |html_enabled=hidden | 1 </nobr> Die ersten zwei Zeilen erzeugen Eingabefelder für Name und E-Mail, beide sind mit einem "*" als "benötigt" markiert und das name-Feld hat einen Standardwert: "[Name eingeben!]". Die dritte Zeile ist ein Textfeld und die vierte Zeile erstellt Radioknöpfe für die Haarfarbe. Alle vier Zeilen haben je eine Beschriftung Am Schluss folgen drei wichtige Zeilen. Die erste erzeugt eine Sende-Schaltfläche mit der Aufschrift "Formular senden", die zweite Zeile ist der Betreff der E-Mail und die dritte Zeile sorgt dafür, dass das Ergebnis als HTML-Tabelle verschickt wird. Es ist oft einfacher, den Formularassistenten zu benutzen, klicken Sie dazu auf das Symbol rechts neben dem Eingabefeld. <b>Hinweis:</b> Bevor ein Formular funktionieren kann, müssen Sie eine Empfängeradresse angeben. Das Feld "E-Mail-Empfänger:" ist hierfür vorgesehen (das bei anderen Typen als Untertitel benutzt wird).

# text_align.description
source: Places the body text to the left, centered or to the right.
de: Richtet den Text links, mittig oder rechts aus.

# text_align.details
source: See Pagecontent / Fontface for comments. <b>Notice:</b> This option is obsolete when you are using CSS for rendering.
de: Siehe Seiteninhalt / Schriftart für Kommentare. <b>Hinweis:</b> Diese Option ist wirkungslos, wenn Ihre Website CSS verwendet.

# text_face.description
source: Select a font fact family for the body text.
de: Wählen Sie eine Schriftart für den Text aus.

# text_face.details
source: <strong>Notice</strong> that these options are only meant for special design. The general (default) design should be configured in the template instead. Furthermore you should NOT use these options if your template implements stylesheets and are based on using styles in general.
de: <strong>Hinweis:</strong> Diese Optionen sind nur für spezielle Designs gedacht. Das normale Design sollte stattdessen in der Vorlage definiert werden. Des weiteren sollten Sie diese Option <em>nicht</em> einsetzen, wenn Ihre Vorlage auf Stylesheets (CSS) aufbaut.

# text_size.description
source: Select a font size for the body text.
de: Wählen Sie eine Schriftgröße für den Text aus.

# text_size.details
source: See Pagecontent / Fontface for comments. <b>Notice:</b> This option is obsolete when you are using CSS for rendering.
de: Siehe Seiteninhalt / Schriftart für Kommentare. <b>Hinweis:</b> Diese Option ist wirkungslos, wenn Ihre Website CSS verwendet.

# text_color.description
source: Select a color for the body text.
de: Wählen Sie eine Schriftfarbe für den Text aus.

# text_color.details
source: See Pagecontent / Fontface for comments. <b>Notice:</b> This option is obsolete when you are using CSS for rendering.
de: Siehe Seiteninhalt / Schriftart für Kommentare. <b>Hinweis:</b> Diese Option ist wirkungslos, wenn Ihre Website CSS verwendet.

# text_properties.description
source: Select additional font properties.
de: Wählen Sie zusätzliche Schriftattribute für den Text aus.

# text_properties.details
source: These options will select font properties for all the body text. However you may wish to mark only a part of the bodytext as bold or underline in which case you should use the formatting options in the Rich Text Editor. Alternatively you can use the HTML tags here: &lt;b&gt;<strong>This is bold</strong>&lt;b&gt; &lt;i&gt;<em>This is italics</em>&lt;i&gt; &lt;u&gt;<u>This is underlined</u>&lt;u&gt; See Pagecontent / Fontface for comments. <b>Notice:</b> This option is obsolete when you are using CSS for rendering.
de: Diese Optionen wählen Schrifteigenschaften für den gesamten Text aus. Falls Sie nur einen Teil des Textes formatieren möchten, nutzen Sie besser die Formatierungsfunktionen des Rich-Text-Editors. Alternativ können Sie auch HTML-Tags verwenden: &lt;B&gt;<strong>Dies ist fettgedruckt</strong>&lt;/B&gt; &lt;I&gt;<em>Dies ist kursiv</em>&lt;/I&gt; &lt;U&gt;<u>Dies ist unterstrichen</u>&lt;/U&gt; Siehe Seiteninhalt / Schriftart für Kommentare. <b>Hinweis:</b> Diese Option ist wirkungslos, wenn Ihre Website CSS verwendet. Die Formatierung einzelner Textstellen, wie gezeigt, funktioniert dagegen in der Regel auch mit CSS.

# image.description
source: Insert one or more images.
de: Fügt ein oder mehrere Bilder ein.

# image.details
source: You can attach images to the content element and almost as many as you like. Depending on the configuration of TYPO3 you can even attach them in any format you like. Especially you do not need to worry about size and compression because these factors are normally handled by TYPO3 internally. When you use the "Text w/image" type, it's important to select a proper position of the imageblock. For this purpose, use the Position selector which is displayed below (or if you click in the image list field in the Classic backend). See link to "Pagecontent / Position" below. You can also display images in multiple columns and enable an option which enables a link so you can click the image and see a bigger version. Just to name a few options. Most likely you don't have all options available. This depends on your permissions in the system.
de: Sie können dem Element Bilder in fast beliebiger Anzahl hinzufügen. Abhängig von Ihrer TYPO3-Konfiguration können Sie Bilder in fast jedem Format anfügen. Sie müssen sich insbesondere keine Gedanken über Größe oder Kompression machen, da diese Faktoren normalerweise TYPO3-intern gehandhabt werden. Wenn Sie "Text und Bilder" verwenden, ist es wichtig, die richtige Position des Bildblocks auszuwählen. Für diesen Zweck nutzen Sie die Positionsauswahl, die unterhalb des Textfelds gezeigt wird. Siehe Link zu Seiteninhalt>Position unten. Sie können Bilder auch in mehreren Spalten anordnen und eine Option aktivieren, mit der Sie durch Anklicken des kleinen Bildes eine größere Version des Bildes ansehen können. Um nur ein paar Optionen zu nennen. Sehr wahrscheinlich stehen Ihnen gar nicht alle Optionen zur Verfügung. Dies hängt von Ihren Berechtigungen im System ab.

# _image.seeAlso
source: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_noRows, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_effects, tt_content:image_frames, tt_content:image_compression, Using images ("Getting Started") | http://typo3.org/documentation/document-library/doc_tut_quickstart/Managing_files_in_TY/ Using images (Animation) | FILE:EXT:welcome/modsub/ani_10.gif
de: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_noRows, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_effects, tt_content:image_frames, tt_content:image_compression, Bilder benutzen ("Getting Started") | http://typo3.org/documentation/document-library/doc_tut_quickstart/Managing_files_in_TY/ Bilder benutzen (Animation) | FILE:EXT:welcome/modsub/ani_10.gif

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. You might not be able to use all of them.
de: Hier sehen Sie alle Optionen, die sich auf das Einfügen von Bildern in Inhaltselementen beziehen. Möglicherweise stehen Ihnen nicht alle Optionen zur Verfügung.

# imagewidth.description
source: Enter the width in pixels of the image.
de: Geben Sie die Breite des Bildes (in Pixeln) an.

# imagewidth.details
source: The template is normally configured to a max width of an image and so you don't need to specify the width if the image fits perfectly into those dimensions. However this does give you an opportunity to specify a specific width.
de: Normalerweise ist die Vorlage für eine maximale Bildbreite ausgelegt und daher müssen Sie die Breite nicht angeben, wenn das Bild perfekt in diese Abmessungen passt. Trotzdem haben Sie hier die Gelegenheit, die Breite ausdrücklich zu definieren.

# imageheight.description
source: Enter the height of the image in pixels.
de: Geben Sie die Höhe des Bildes (in Pixeln) an.

# imageorient.description
source: Select the position of the imageblock relative to the body text.
de: Wählen Sie die Position des Bilderblocks relativ zum Text.

# imageorient.details
source: The position above and below the body text is pretty straight forward. The options "In text" means that the image block is displayed with text aside it. When you select this option the template will probably force the images into smaller dimensions because they cannot take up the same space when text is supposed to float around them. When you select "In text" you can choose the options either above or below the divider "No wrap". If you select the "In text" option above, the bodytext will float <em>under</em> the image block when the bodytext reaches the end of the image block. So in other words the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. Because if you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: You experience that the subsequent content elements on the page is somehow layered on top of the image block - and this certainly looks like a bug. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
de: Die Positionen über und unter dem Text sind von sich aus verständlich. Die Optionen "Im Text" bedeuten, dass die Bilder vom Text umflossen werden. Wenn Sie dies auswählen, wir die Vorlage die Bilder wahrscheinlich verkleinern, weil es nicht den gleichen Raum einnehmen kann, wenn Text drum herum fließen soll. Wenn Sie "Im Text" benutzen, können Sie die Optionen oberhalb und unterhalb von "Kein Umbruch" auswählen. Wenn Sie "Im Text" oberhalb auswählen, wird der Text <em>unter</em> dem Bilderblock weiter fließen, sobald der Text das untere Ende des Bilderblocks erreicht hat. Wenn Sie "Im Text" unter dem "Kein Umbruch"-Trenner auswählen, wird der Text nicht unter dem Bild weiter laufen, sondern in seiner Spalte bleiben. Abgesehen vom Aussehen gibt es auch einen technischen Unterschied. Wenn Sie den Text um den Bilderblock herum fließen lassen, werden Sie ein seltsames Phänomen festellen, falls Sie nicht genug Text haben, um unter dem Bild weiter zu laufen: Sie werden feststellen, dass folgende Seiteninhalte über dem Bilderblock dargestellt werden - und dies sieht wie ein Fehler aus. Dies ist einfach zu beheben, indem Sie die entsprechende Position unter dem "Kein Umbruch"-Trenner auswählen.

# imageborder.description
source: Check this, if you wish a colored border around the images.
de: Wählen Sie diese Option, wenn das Bild einen farbigen Rahmen erhalten soll.

# image_noRows.description
source: Disables strict tablerows in the image block.
de: Schaltet durchgehende Zeilen im Bilderblock ab.

# image_noRows.details
source: This options is kind of hard to explain, but imagine you have 2 or more columns <em>and</em> rows of images. If one image in the upper row is a bit taller than the second this will generate an empty extra space beneath the second image. This is due to the normal procedure in which the images are placed in a table cell each. If you set this option, the table will place all images in a column in a single table cell which make the distance between them vertically identical throughout. This may provide a better look if the alternative looks stupid.
de: Diese Option ist schwer zu erklären, aber stellen Sie sich vor, Sie haben zwei oder mehr Spalten <em>und</em> Zeilen von Bildern. Wenn ein Bild in der obersten Reihe etwas größer ist als ein daneben stehendes, entsteht etwas freier Raum unter dem kleineren Bild. Dies liegt daran, dass die Bilder standardmäßig in Reihen angeordnet sind. Wenn Sie dagegen die Option "Keine Reihen" aktivieren, werden alle Bilder einer Spalte <em>direkt</em> untereinander platziert, so dass kein freier Raum unter kleineren Bildern entsteht. Dies mag besser aussehen, falls die Alternative mit Reihen nicht gut aussieht.

# image_link.description
source: Enter a link for the images.
de: Geben Sie einen Link für die Bilder ein.

# image_link.details
source: By default all images share the same link. However you may ask the administrator to configure the TypoScript template to allow a separate link for each image. If this is the case, you simply separate the link values by a comma. See Pagecontent>Link below for details on syntax.
de: Standardmäßig haben alle Bilder denselben Link. Sie können aber Ihren Administrator darum bitten, die TYPO3-Vorlage so zu ändern, dass jedes Bild seinen eigenen Link erhält. Wenn dies der Fall ist, trennen Sie die einzelnen Links einfach mit einem Komma. Einzelheiten zur Syntax erhalten Sie unten über Seiteninhalt > Link.

# image_zoom.description
source: Check this option, and the image will link to a new window with a bigger version.
de: Markieren Sie diese Option und das Bild wird auf ein neues Fenster mit einer größeren Ansicht verlinkt.

# image_zoom.details
source: This option overrides the value in the Link-field.
de: Diese Option überschreibt den Wert des Link-Feldes.

# image_effects.description
source: Select special image processing effects.
de: Wählen Sie spezielle Bildbearbeitungseffekte aus.

# image_frames.description
source: Select special image framing options.
de: Wählen Sie spezielle Rahmenoptionen aus.

# image_compression.description
source: Select compression/quality options.
de: Wählen Sie Qualitäts- und Kompressionsoptionen aus.

# imagecols.description
source: Select the number of columns in the image block.
de: Wählen Sie die Anzahl der Spalten des Bilderblocks aus.

# imagecaption.description
source: Enter a caption for the image block
de: Geben Sie eine Bildunterschrift ein.

# imagecaption.details
source: By default the caption is positioned below the whole image block. However your website template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In that case each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the content element type "Filelinks" where each line represents a description of a file in the list.
de: Normalerweise wird die Bildunterschrift unter dem gesamten Bilderblock angezeigt. Die Vorlage der Website kann jedoch so programmiert werden, dass sie individuelle Bildunterschriften anzeigt, indem in den Vorlagenkonstanten "styles.content.imgtext.captionSplit=1" gesetzt wird. In diesem Fall entspricht jede Zeile der Bildunterschrift je eines Bildes. Das Feld wird außerdem vom Inhaltstypen "Dateilinks" verwendet, wobei jede Zeile der Beschreibung einer Datei in der Liste entspricht.

# imagecaption_position.description
source: Places the image caption to the left, centered or to the right.
de: Richtet die Bildunterschrift links, zentriert oder rechts aus.

# cols.description
source: Select a fixed number of table columns
de: Wählen Sie eine feste Anzahl an Spalten aus.

# pages.description
source: Insert page(s)
de: Seite(n) einfügen
