Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_statictpl.xlf
Languages: de

# .description
source: Static templates are a centrally distributed TypoScript library. You should never change these values.
de: Statische Vorlagen stellen eine von TYPO3 gelieferte, zentrale TypoScript-Sammlung dar. Sie sollten diese Werte keinesfalls verändern!

# .details
source: The Static templates are meant to be included by your TypoScript Template records depending on your needs. Refer to the 'TSref' document (see below) for details on this process. Notice that by each release of TYPO3 you should reinstall the Static Templates table by the install tool. See the 'Install/Upgrade' document for details (see below).
de: Statische Vorlagen werden normalerweise innerhalb Ihrer eigenen TypoScript-Vorlagen je nach Bedarf eingebunden. Näheres dazu erfahren Sie im Dokument TSref-Referenz (siehe unten). Bitte sorgen Sie dafür, dass Sie sich mit jeder neuen TYPO3-Version auch die dazugehörigen (und eventuell geänderten) statischen Vorlagen innerhalb des Installationsprogramms (im Bereich Datenbank) neu installieren. Lesen Sie sich dazu bitte das Dokument "Installation/Upgrade" (siehe unten).

# _.seeAlso
source: sys_template TSref | http://typo3.org/documentation/document-library/doc_core_tsref/ TypoScript by Example | http://typo3.org/documentation/document-library/doc_core_tsbyex/ Install/Upgrade | http://typo3.org/documentation/document-library/doc_inst_upgr/, sys_template:include_static
de: sys_template TSref | http://typo3.org/documentation/document-library/doc_core_tsref/ TypoScript by Example | http://typo3.org/documentation/document-library/doc_core_tsbyex/ Installation/Upgrade | http://typo3.org/documentation/document-library/doc_inst_upgr/, sys_template:include_static

# .image_descr
source: The static templates are located in the page tree root where only the Admin users can access them. However they are read-only by default so you can only look at their content, not change it.
de: Innerhalb des Seitenbaumes befinden sich die statischen Vorlagen an einer Stelle, zu der nur Administratoren Zugang haben. Trotzdem haben auch Administratoren standardmäßig nur lesenden Zugriff auf diese Dateien, auch sie können keine Änderungen vornehmen.

# title.description
source: Template Title. Will be visible in the list of static templates in Template Records
de: Vorlagenbeschreibung - wird als Titel innerhalb der Vorlagenübersicht angezeigt.

# constants.description
source: TypoScript Constants field
de: Das Feld TypoScript-Konstanten

# config.description
source: TypoScript Setup code field
de: Das Feld TypoScript-Setup-Code

# include_static.description
source: Inclusion of other static templates
de: Andere statische Vorlagen einbinden.

# description.description
source: Description of the static template record.
de: Beschreibung der statischen Vorlage.

# editorcfg.description
source: Editor Configuration - used to configure Stylesheet editor.
de: Konfiguration des Stilvorlagen-Editors.
