Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_pages.xlf
Languages: de

# keywords.details
source: Most TYPO3 websites use these keywords in a meta-tag on the page, but you have to setup the appropriate TypoScript template yourself. To optimize your page for search engines like google you should not use more than 3 to 6 keywords. You should make sure that the keywords can be found in the content of the page. Note that also search engine extensions for TYPO3 (e.g. Indexed search) can be configured to make use of the keywords. In TYPO3, the keywords can also be used to create a menu of related pages. Create a content element of type 'Sitemap' and then choose the menu type <i>Related pages (based on keywords)</i>.
de: Die Schlüsselwörter werden meistens als Meta-Tags in die Seiten eingefügt und werden dann von Suchmaschinen genutzt. Dazu muss ein entsprechendes TYPO3-Template konfiguriert werden. Um die Seite für Suchmaschinen wie Google zu optimieren, sollten nicht mehr als 3 bis 6 Schlüsselwörter verwendet werden. Achten Sie darauf, dass die Schlüsselwörter auch im Seiteninhalt vorhanden sind. Beachten Sie, dass auch Sucherweiterungen für TYPO3 für die Nutzung der Schlüsselwörter konfiguriert werden können, z.B. die Indexsuche. Darüber hinaus lassen sich Menüs basierend auf den Schlüsselworten erzeugen. Erstellen Sie ein Inhaltselement vom Typ "Sitemap" und wählen Sie als Menütyp <i>Verwandte Seiten (basierend auf Schlüsselwörtern)</i>.

# description.description
source: Enter a short description of the page. It will be displayed in the result lists of search engines.
de: Geben Sie eine kurze Beschreibung der Seite ein. Sie wird in den Suchergebnissen von Suchmaschinen angezeigt.

# description.details
source: Most TYPO3 websites insert this description in a meta-tag on the page, but you have to configure this yourself in your TypoScript template. Search engines will display the description in their result list. Thus, the text should be short (about 160 characters maximum), and it's wording should make sense when it shows up in the result list. Also, the description will be displayed if you create a content element of type 'Sitemap' and then choose the menu type <i>Menu of subpages to these pages (with abstract)</i>. <b>Note:</b> Some search engines only use the description if the text is not found elsewhere in the content. So do not just repeat yourself.
de: Viele TYPO3-Seiten fügen diese Bechreibung als Meta-Tag in die Seite ein. Dazu muss jedoch eine entsprechende TypoScript-Vorlage konfiguriert werden. Suchmaschinen zeigen die Beschreibung in ihren Trefferlisten an. Daher sollte die Beschreibung kurz sein (maximal 160 Zeichen) und bei der Anzeige in der Trefferliste Sinn ergeben. Die Beschreibung wird auch angezeigt, wenn man ein Inhaltselement vom Typ "Sitemap" erstellt und den Menütyp <i>Menü der Unterseiten dieser Seite (mit Zusammenfassung)</i> auswählt. <b>Hinweis:</b> Einige Suchmaschinen verwenden die Beschreibung nur, falls der Text nicht anderweitig im Inhalt vorhanden ist. Wiederholen Sie sich also nicht.

# abstract.description
source: Enter an abstract of the contents. It may be displayed in an overview of articles.
de: Geben Sie eine Zusammenfassung des Inhalts an. Sie kann in Artikelübersichten angezeigt werden.

# abstract.details
source: An abstract is a short description of the page content, that might be a little longer than the one in the <i>Description</i> field. Other than the description, the abstract is not meant for display in search engine result lists, but for use in your own project exclusively. By default, TYPO3 lets you create a content element of type <i>Sitemap</i> and then choose <i>Menu of subpages to these pages (with abstract)</i> to create an overview of articles. If an abstract is available it will be used instead of the description. <b>Note:</b> You do not have to enter the text of the description into the <i>Abstract field</i> again. Of course, admins can make custom use of this field via their TypoScript templates.
de: Eine Inhaltsangabe ist eine kurze Beschreibung des Seiteninhalts, die etwas länger sein kann als im Feld <i>Beschreibung</i>. Im Gegensatz zur Beschreibung ist die Zusammenfassung nur für die Anzeige in Suchmaschinen, sondern ausschließlich zur Nutzung in eigenen Projekten bestimmt. Im Allgemeinen ermöglicht TYPO3 die Erstellung eines Inhaltselementes vom Typ "Sitemap". Wenn Sie dabei den Untertyp "Menü der Unterseiten (mit Zusammenfassung)" auswählen, erhalten Sie einen Übersicht von Artikeln. Wenn eine Zusammenfassung verfügbar ist, wird diese statt der Beschreibung angezeigt. <b>Hinweis:</b> Es ist nicht erforderlich, den Text des Felds Beschreibung nochmals unter <i>Zusammenfassung</i> einzugeben. Natürlich können Administratoren dieses Feld über TypoScript-Vorlagen einer eigenen Nutzung zuführen.

# backend_layout.description
source: Select a backend layout for this particular page only.
de: Wählen Sie ein Backend-Layout aus, das ausschließlich für diese Seite verwendet wird.

# backend_layout.details
source: If you have created any additional backend layouts you can select them here to have the page module render the columns of this page with the selected layout. Usually it will reflect the frontend layout in a way so that you will be able to recognize easily to which area of the page the content belongs. You can select nothing or "none" to get the default column view of the page module for this page. If you select a layout or "none", it will override any settings that might have been inherited from pages in the rootline of the current page. The selection is <b>NOT</b> inherited automatically by subpages - use <b>Backend Layout (subpages of this page)</b> if you want to achieve this.
de: Falls Sie alternative Backend-Layouts erstellt haben, können Sie diese hier auswählen. Das Modul "Seite" stellt die Spalten dann gemäß des gewählten Layouts dar. Üblicherweise bildet das alternative Backend-Layout die Struktur des Frontend-Layouts dergestalt ab, dass Sie leicht erkennen können, welche Inhalte zu welchem Bereich der Seite im Frontend gehören. Falls Sie keine Auswahl treffen oder "Keins" auswählen, zeigt Ihnen das Modul "Seite" die Standard-Spalten-Ansicht der Seite an. Falls Sie ein Layout oder "Keins" auswählen, werden alle Einstellungen, die die aktuelle Seite von einer weiter oben in der Hierarchie des Seitenbaums stehenden Seite geerbt hat, außer Kraft gesetzt. Die Auswahl wird <b>NICHT</b> automatisch an Unterseiten vererbt - benutzen Sie das Feld <b>Backend-Layout (für Unterseiten dieser Seite)</b>, um dies zu erreichen.

# backend_layout_next_level.description
source: Select a backend layout for all subpages of this page.
de: Wählen Sie ein Backend-Layout für alle Unterseiten dieser Seite aus.

# backend_layout_next_level.details
source: If you have created any additional backend layouts you can select them here to have the page module render the columns of the subpages of this page with the selected layout. Usually it will reflect the frontend layout in a way so that you will be able to recognize easily to which area of the page the content belongs. You can select nothing or "none" to get the default column view of the page module for the subpages. If you select a layout or "none", it will override any settings that might have been inherited from pages in the rootline of the current page. The selection is inherited automatically by all subpages - so you don't have to set it seperately for each of them.
de: Falls Sie alternative Backend-Layouts erstellt haben, können Sie diese hier auswählen. Das Modul "Seite" stellt die Spalten dann gemäß des gewählten Layouts dar. Üblicherweise bildet das alternative Backend-Layout die Struktur des Frontend Layouts dergestalt ab, dass Sie leicht erkennen können, welche Inhalte zu welchem Bereich der Seite im Frontend gehören. Falls Sie keine Auswahl treffen oder "Keins" auswählen zeigt Ihnen das Modul "Seite" die standard Spalten-Ansicht der Seite an. Falls Sie ein Layout oder "Keins" auswählen, werden alle Einstellungen, die die aktuelle Seite von einer weiter oben in der Hierarchie des Seitenbaumes stehenden Seite erbt, außer Kraft gesetzt. Die Auswahl wird automatisch an alle Unterseiten vererbt - Sie müssen diese nicht für jede Unterseite wiederholen.

# newUntil.description
source: Enter the 'expiry date' of the page.
de: Geben Sie das Ablaufdatum der Seite ein.

# newUntil.details
source: The 'expiry date' of the page has no effect on the display of the webpage. This value is rather for internal use meant as a reminder of the date when the content of this page should be revised. So if the content of the page will be outdated at a certain point in time, you could set this value to that approximate date. In order to obtain an overview of the expiry dates of pages, use the 'Pagetree overview' in the 'Web>Info' module.
de: Das Ablaufdatum der Seite hat keinen Effekt auf die Anzeige der Webseite. Dieser Wert ist mehr für den internen Gebrauch gedacht als Erinnerung, wann der Inhalt der Seite überarbeitet werden sollte. Um einen Überblick über die Ablaufdaten zu bekommen, benutzen Sie die "Seitenbaum-Übersicht" des Moduls "Web > Info".

# newUntil.syntax
source: See Page / Start (click below)
de: Siehe auch Seite / Start (unten klicken)

# lastUpdated.description
source: Enter the time and date of the most recent update of this page.
de: Geben Sie Datum und Uhrzeit der letzten Aktualisierung der Seite ein.

# lastUpdated.details
source: How the value of this field is used is determined by the TypoScript template of the website. First of all a 'Last updated' notice needs to be inserted on the pages and secondly the template must be configured to use this value. The most common use which is found in the standard templates will automatically display the last update time and date <em>unless</em> this field specifies a value in which case this value is inserted.
de: Wie der Wert dieses Feldes genutzt wird liegt im Ermessen der Vorlage. Zunächst muss eine "Zuletzt geändert"-Notiz auf den Seiten vorhanden sein und außerdem muss die Vorlage diese Werte benutzen. Die häufigste Verwendung in Standardvorlagen ist die automtische Anzeige des Zeitpunkts der letzten Änderung <em>solange</em> dieses Feld keinen Wert enthält.

# lastUpdated.syntax
source: Format is HH:MM DD-MM-YYYY. If you insert eg. a 'd' the current time and date is inserted. You can also append any value in the field with eg. '+10' which will add 10 days to the current value.
de: Das Format ist HH:MM TT-MM-JJJJ. Geben Sie z.B. "d" ein, so wird das aktuelle Datum eingefügt. Sie können auch jedem Wert z.B. "+10" nachstellen, wodurch 10 Tage zum aktuellen Wert addiert werden. So würden Sie mit der Eingabe von "d+10" ein Datum eingeben, das 10 Tage in der Zukunft liegt.

# nav_hide.description
source: With this option the page will be hidden in navigation menus in the frontend. The page can still be viewed if linked by its ID directly.
de: Diese Option bewirkt, dass die Seite nicht mehr im Menü des Frontends gezeigt wird. Die Seite kann jedoch immer noch angezeigt werden, wenn sie über ihre ID direkt angesprungen wird.

# nav_title.description
source: Alternative title for menu items in the frontend. This value takes precedence over the page title if this value is filled in.
de: Alternativer Titel für die Menüeinträge im Frontend. Dieser Wert hat Vorrang vor dem Seitentitel, wenn Sie hier etwas eingeben.

# content_from_pid.description
source: If set, this is an alternative page id from where Content Elements will be selected instead of Content Elements from the current page. Depends on template implementation whether this applies.
de: Hier geben Sie die ID einer Seite ein, deren Inhaltselemente statt des Inhalts der aktuellen Seite angezeigt werden. Es hängt von der Vorlage ab, ob dies funktioniert.

# urltype.description
source: Set the URL prefix.
de: Bestimmt das URL-Präfix.

# shortcut_mode.description
source: Select a shortcut mode. By default the shortcut page type must have a page id to jump to. Alternative methods are to go to the first subpage of a page or to a random subpage.
de: Bestimmt den Verweismodus. Normalerweise springt eine Verweisseite zu einer bestimmten anderen Seite. Alternative Methoden erlauben es, zur ersten Kindseite einer Seite zu springen oder sogar zu einer zufällig ausgewählten Kindseite.

# mount_pid.description
source: Mount this page id. If set it means that the subpages of this page comes from the mounted page instead.
de: Bindet die andere Seite ein ('mounted' sie). Wenn dies gesetzt ist, werden die Kindseiten der eingebundenen Seite als Kindseiten dieser Seite angezeigt.

# mount_pid.details
source: In the frontend this is done by adding a new variable, &MP, to the parameters which links the mounted branch to the main branch by pairing page ids.
de: [Technisch] Im Frontend wird dies bewirkt durch einen neuen Parameter in der URL, &MP, der den eingebundenen Zweig zum Seitenbaum hinzufügt (mittels ID-Paaren).

# mount_pid_ol.description
source: If set, the mount point is "overlaid" by the mounted page. It will look like if the mount point does not exist and the mounted page is inserted in its position instead.
de: Wenn Sie diese Option setzen, dann wird die eingebundene Seite selbst anstelle dieser Seite gezeigt und nicht nur die Kindseiten von dort geholt. Es sieht dann so aus, als ob diese Seite gar nicht existiert.

# title.description.+
source: This is normally shown in the website navigation.
de: Der Titel wird normalerweise in den Frontend-Menüs gezeigt.

# TSconfig.details.+
source: <strong>Example:</strong> Normally the 'Web>Page' module lets you create content in four columns, Left, Normal, Right, Border. However most websites use only a single or two columns. So some of these content columns are just taking up space and may even be confusing to users. If you enter this string in the 'TSconfig' field, the 'Web>Page' module will allow you to work only in the 'Normal' and 'Border' column! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Must be entered in a single line!)
de: <strong>Beispiel:</strong> Normalerweise können Sie über das Modul "Web > Seite" Inhalte in vier Spalten einfügen: Links, Normal, Rechts und Rand. Viele Sites verwenden jedoch nur eine oder zwei Spalten. Daher nehmen einige dieser Spalten nur Platz weg und verwirren den Anwender. Wenn Sie den folgenden Text in das Feld "TSconfig" eingeben, wird das Modul "Web > Seite" nur noch die Spalten "Normal" und "Rand" anzeigen! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Muss in einer einzigen Zeile stehen!)

# l18n_cfg.description
source: Affect availability of pages in the various languages.
de: Bestimmt die Verfügbarkeit von Seiten in den verschiedenen Sprachen.

# l18n_cfg.details
source: <b>Hide default translation of page</b> If set the page is only available in one of the translations. So any attempt to access the page in the default language will show an error message. <b>Hide page if no translation for current language exists</b> If set the page access will be blocked with an error message if there is no translation in the current language. By default access to a non-translated page will just show the default language content.
de: <strong>Standardübersetzung der Seite verbergen</strong> Ist die Option aktiviert, ist die Seite nur in einer der Übersetzungen verfügbar. Jeder Versuch, auf die Seite in der Standardsprache zuzugreifen, führt zu einer Fehlermeldung. <strong>Seite verbergen, wenn keine Übersetzung für aktuelle Sprache vorhanden</strong> Ist die Option aktiviert, wird der Zugriff auf die Seite mit einer Fehlermeldung quittiert, wenn keine Übersetzung für die aktuelle Sprache vorhanden ist. Standardmäßig wird beim Zugriff auf eine nicht übersetzte Seite der Inhalt der Standardsprache angezeigt.
