Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_fe_users.xlf
Languages: de

# username.description
source: Enter the username of the website user. This is needed to login.
de: Geben Sie den Benutzernamen des Website-Benutzers an. Dieser Benutzername wird zur Anmeldung benötigt.

# username.syntax
source: A username is required and must be in lowercase without spaces in it. The username must be unique among other usernames in the page where it's saved. If it is not unique a number will be prepended automatically.
de: Der Benutzername wird auf jeden Fall benötigt. Er darf nur aus Kleinbuchstaben bestehen und kein Leerzeichen enthalten! Innerhalb des SysOrdners, in dem Sie Website-Benutzer anlegen und speichern muss dieser Benutzername außerdem <em>eindeutig</em> sein. Sollten Sie dennoch versuchen, zwei gleichlautende Benutzer anzulegen, wird dem neu angelegten Benutzernamen automatisch eine Ziffer angehängt (z.B. <em>Benutzer01</em>).

# _username.seeAlso
source: Creating Frontend Users and Groups | http://typo3.org/documentation/document-library/doc_tut_quickstart/Create_users_group/
de: Erstellung von Frontend-Benutzern und -Gruppen | http://typo3.org/documentation/document-library/doc_tut_quickstart/Create_users_group/

# password.description
source: Enter the password for the username above. This is needed to login.
de: Geben Sie das Passwort für den Benutzernamen an. Dieses Passwort wird zur Anmeldung benötigt.

# password.syntax
source: A password is required and must be in lowercase without spaces in it.
de: Das Passwort wird auf jeden Fall benötigt. Es darf nur aus Kleinbuchstaben bestehen und kein Leerzeichen enthalten!

# usergroup.description
source: Select a user group for the username.
de: Weisen Sie dem Benutzer eine Benutzergruppe zu.

# usergroup.details
source: When a user logs in he is able to view all content which is access restricted to the user <em>group(s)</em> the user is a member of. Therefore the user login primarily makes sense with regard to the member groups.
de: Sobald sich ein Benutzer innerhalb der Website anmeldet, erhält er Zugang zu allen Bereichen, deren <em>Gruppen</em>mitglied er ist. Mit Benutzergruppen lassen sich also geschützte, gruppenspezifische Website-Bereiche erstellen.

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
de: Geben Sie den Rechnernamen oder die Netzwerkadresse an, von welchem sich der Benutzer einloggen muss.

# lockToDomain.details
source: A TYPO3 system may have multiple domains pointing to it. Therefore this option secures that users can login only from a certain host name.
de: Ein TYPO3-System kann unter Umständen über mehrere verschiedene Domänennamen erreichbar sein. Deshalb kann mit dieser Einstellung sicher gestellt werden, dass sich Benutzer nur von einer bestimmten Domain aus anmelden können.

# lockToDomain.syntax
source: Either a domain name, "www.typo3.org" or an IP address, "10.34.222.83"
de: Entweder ein Domänenname wie "www.typo3.com" oder eine IP-Adresse wie "10.20.7.70".

# name.description
source: Enter the regular name of the user, both first- and surname.
de: Geben Sie den Klarnamen des Benutzers an (Vor- und Nachname).

# address.description
source: Enter the street address of the user.
de: Geben Sie die Adresse des Benutzers an.

# www.description
source: Enter the homepage URL
de: Geben Sie die Homepage (URL) des Benutzers an.

# title.description
source: Enter the job title, eg. 'Director' or 'Accountant'.
de: Geben Sie hier gegebenenfalls eine Berufsbezeichnung an (z.B. "Direktor" oder "Produktmanager").

# company.description
source: Enter the name of the company in which the user is employed.
de: Geben Sie den Namen der Firma an, für die der Benutzer tätig ist.

# image.description
source: Insert a photo of the user.
de: Fügen Sie ein Bild des Benutzers ein.

# disable.description
source: This option will temporarily disable the user from logging in.
de: Mit dieser Option können Sie dem Benutzer zeitweise das Anmelderecht entziehen, er kann sich dann also nicht mehr an der Website anmelden.

# starttime.description
source: Enter the date from which the account is active.
de: Geben Sie einen Zeitpunkt an, ab welchem das Benutzerkonto gültig sein soll.

# starttime.syntax
source: The syntax is dd-mm-yy, but you can just enter a "d" in the field to insert todays date. Or "d+10" to insert the date 10 days from now etc. The field will re-format any input to fit the format it understands so you can just experiment and you will be able to clearly see how dates should be entered.
de: Die Syntax für Datumsangaben entspricht dem Muster "dd-mm-yy", Sie können aber auch einfach "d" für das aktuelle Datum oder "d+10" für ein Datum 10 Tage ab heute eingeben. Die eingegebenen Datumswerte werden sofort reformatiert, damit TYPO3 die Zeitangaben auch verarbeiten kann. Experimentieren Sie einfach ein bisschen, um zu verstehen, wie TYPO3 Ihre Angaben interpretiert.

# endtime.description
source: Enter the date from which the account is disabled.
de: Geben Sie ein Zeitpunkt an, ab welchem das Benutzerkonto ungültig (deaktiviert) sein soll.

# endtime.syntax
source: See "Start"
de: Siehe "Start".

# lastlogin.description
source: This field shows the user's last log in date.
de: Zeigt das Datum an, zu dem sich der Benutzer zuletzt angemeldet hat.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
de: Nehmen Sie zusätzliche TSconfig-Einstellungen für den Benutzer vor (fortgeschrittene Konfiguration).

# TSconfig.details
source: This field allows you to enter TypoScript style configuration values for the user. Currently there are no system defined keys. If there ever will be, they will be described in detail in the administrative documentation. The primary use of this field (as well as the 'sister'-field in the Website usergroup table) is for custom purposes. In this case, you should use the root-key "user" for your customly defined values. Thus you don't risk any future system keys to interfere with your configuration. You access the values of the configuration from your frontend plugins by calling the function <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> which will return an array with the valuetree in it. <b>Warning:</b> You should use Website user/group TSconfig in your PHP-scripts ONLY if your resulting content is NOT being cached! So call it from TypoScript USER_INT cObjects or disable caching from your PHP-code by calling <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig from Website usergroups:</b> Notice that the configuration from the field TSconfig in the member groups of the user is accumulated and prepended to the TSconfig of the user before it's parsed. This means for instance that a key defined in the TSconfig of the user (this field) will override the same key defined in the last (bottom) usergroup in the list which will again override the same key defined in the first (top) usergroup in the list. <b>Example:</b> Let's imagine you want to define for a user that his name is printed in the bottom of the webpages when he is logged in. First of all you must write a PHP-function and insert the result from it as a USER_INT cObject in the bottom of the page. But your function needs to know, whether or not this user is configured to have his name printed. So you decide to use a custom TSconfig key, 'user.printUserName': <em>In the TSconfig field of the user or usergroup:</em> user.printUserName = 1 <em>In your PHP-function:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }
de: In diesem Feld können Sie spezielle TypoScript-Konfigurationen für den Benutzer vornehmen. Derzeit existieren in TYPO3 hierfür noch keine globalen Einstellungen. Sollte sich das in einer zukünftigen Version ändern, so finden Sie nähere Angaben hierzu in den entsprechenden Administrationshandbüchern. Dieses Feld (genauso wie das entsprechende Feld für Website-Benutzerguppen) soll vor allem kundenspezifischen TYPO3-Anpassungen dienen. In diesem Fall sollten Sie unbedingt das für solche Fälle reservierte Schlüsselwort "user" für alle selbstdefinierten Werte verwenden. Damit wird sichergestellt, dass diese Werte niemals durch TYPO3-eigene Werte überschrieben werden können. Innerhalb Ihres Frontend-Plug-Ins können Sie die einzelnen Werte mit der Funktion <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> auslesen. Als Rückgabewert erhalten Sie dann den entsprechenden Wertebaum. <b>Warnung:</b> In Ihren eigenen PHP-Programmen sollten Sie Website-Benutzer- und Benutzergruppen-TSconfig NUR dann verwenden, wenn der dadurch generierte Inhalt NICHT zwischengespeichert (gecached) wird! Rufen Sie also Ihre eigene Funktion in TypoScript-USER_INT-cObjects auf oder unterbinden Sie das Caching Ihrer PHP-Programme mit <em>$GLOBALS["TSFE"]->set_no_cache();</em>. <b>TSconfig von Website-Benutzergruppen:</b> Bitte beachten Sie, dass evtl. vorhandene TSconfig-Konfigurationen aus Website-Benutzergruppen, deren Mitglied der Benutzer ist, den hier erstellten Werten vorangestellt wird! Die Reihenfolge der Abarbeitung für die endgültige TSconfig-Konfiguration ist dabei: 1. Erste Website Benutzergruppe TSconfig 2. Weitere Website Benutzergruppen TSconfig 3. Letzte Website Benutzergruppen TSconfig 4. Benutzer-TSconfig (Werte in diesem Feld) Die letzte Website-Benutzergruppen-TSconfig wird also gegebenenfalls durch Werte aus der Benutzer-TSconfig überschrieben. <b>Beispiel:</b> Stellen Sie sich vor, Sie wollen Ihre Website ein wenig persönlicher gestalten und deshalb jeweils den Namen des gerade angemeldeten Besuchers anzeigen. Als erstes dürfte Ihnen jetzt entgültig klar werden, warum Sie die Ausgabe Ihrer Funktion NICHT zwischenspeichern dürfen, denn sonst würden Sie bei jedem Seitenaufruf den gleichen Namen für alle angemeldeten Benutzer angezeigt bekommen... Nun müssen Sie eine PHP-Funktion schreiben und den so erhaltenen Rückgabewert als USER_INT-cObject auf der Seite ausgeben. Sie wollen aber, dass die Ausgabe des Namens wahlweise erfolgen kann. Also entscheiden Sie sich dafür, dafür einen TSconfig-Schlüsselwert namens "user.printUserName" zu verwenden: <em>Im TSconfig-Feld des Benutzers oder der Benutzergruppe:</em> user.printUserName = 1 <em>Innerhalb Ihrer PHP-Funktion:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
de: Normale TypoScript-Syntax ohne Bedingungen und Konstanten.

# _TSconfig.seeAlso
source: TSconfig for TSFE | http://typo3.org/documentation/document-library/doc_core_tsconfig/TCEMAIN/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig
de: TSconfig für TSFE | http://typo3.org/documentation/document-library/doc_core_tsconfig/TCEMAIN/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig

# .description
source: A website login user.
de: Ein Website-Benutzerkonto.

# .details
source: These are users with a username and password who are allowed specific access to otherwise restricted areas on your website.
de: Website-Benutzer können sich mit ihrem Benutzernamen und Passwort auf der Website anmelden. Dadurch erlangen sie u.a. Zugang zu solchen Bereichen der Website, die normalen (unregistrierten) Benutzern nicht zur Verfügung stehen.

# .image_descr
source: Part of the form for editing a frontend user. A typical login box (standard) on the website where frontend users can login.
de: Ein Teil der Eingabemaske für Benutzerdaten eines Frontend-Benutzers. Ein typisches Anmeldeformular, mit dem sich Website-Benutzer anmelden können.
