Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_fe_groups.xlf
Languages: de

# hidden.description
source: This option disables the user group.
de: Mit dieser Option können Sie die Benutzergruppe deaktivieren.

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them. For instance if a page or content element was assigned access only by this group and you disable the group, no one would gain access to that page or content element.
de: Wenn Sie eine Benutzergruppe deaktivieren, wird die Vererbung der Eigenschaften dieser Gruppe an ihre Mitglieder unterbunden! Wenn beispielsweise eine Seite oder ein Inhaltselement so konfiguriert wurde, dass darauf nur diese Gruppe Zugriff hat, kann bei Deaktivierung dieser Gruppe niemand mehr darauf zugreifen.

# title.description
source: Name of the group.
de: Name der Gruppe.

# title.details
source: This title will appear as the group name in the 'Access'-list in other records.
de: Dieser Name erscheint in den Auswahlfeldern aller Elemente, für die eine Zugriffsbeschränkung definiert werden kann.

# lockToDomain.description
source: Enter the host name from which the group will be available only.
de: Geben Sie hier den Namen der Domäne an, für welche diese Benutzergruppe gelten soll.

# lockToDomain.details
source: This options may be important if you have multiple websites in the same TYPO3 database but still only one main storage page for all Website users. Thus the users may log in on any of the website URLs. This may be considered a feature (having a global login as a user) or a problem (in which case you should have multiple user storages anyway). However you may wish to limit the use of a Website usergroup to a specific website and thus you don't want the group to be enabled for the user when he logs in at another URL (still from the same database of course). By entering the host name of the website here, you restrict the group to be used only from within this domain. <b>Notice:</b> The use for this option is not critical if you have multiple Website user storages, namely one for each site.
de: Diese Option kann wichtig für Sie sein, wenn Sie mehrere Websites in der gleichen TYPO3-Datenbank speichern, aber nur einen Speicherort für <em>alle</em> Website-Benutzer verwenden möchten. Dadurch können sich die Website-Benutzer an allen Websites anmelden. Dieses Verhalten kann man entweder als Feature (eine globale Anmeldung für alle Websites) oder als Problem betrachten - im letzteren Fall sollten Sie sowieso pro Website einen eigenen Speicherort für die Website-Benutzer definieren. Trotzdem könnte es Ihr Wunsch sein, einer globalen Website-Benutzergruppe lediglich den Zugriff auf eine bestimmte Website zu gestatten. Dies können Sie erreichen, indem Sie hier einen Domänennamen oder eine IP-Adresse eintragen. <b>Hinweis:</b> Diese Option ist wirkungslos, wenn Sie mehrere Speicherorte für Website-Benutzer definiert haben (also etwa für jede Website einen Benutzerordner).

# subgroup.description
source: Member of other groups.
de: Mitglieder anderer Gruppen

# subgroup.details
source: List of other groups that this group is a member of.
de: Liste anderer Gruppen, bei denen diese Gruppe Mitglied ist

# description.description
source: Enter a description of the group.
de: Geben Sie eine Beschreibung für die Gruppe an.

# description.details
source: This is for internal use and is just a way to put a note on what the group is for, why you created it and who should be members. Use it as you like.
de: Diese Beschreibung wird lediglich intern verwendet und bietet Ihnen die Möglichkeit zu notieren, warum diese Gruppe erstellt wurde, wozu die Gruppe dient, wer Mitglied sein sollte etc. Verwenden Sie dieses Feld einfach Ihren Vorstellungen entsprechend.

# TSconfig.description
source: TSconfig for the group (advanced).
de: TSconfig für die Gruppe (fortgeschrittene Konfiguration).

# TSconfig.details
source: This is the user TSconfig for the group. The values are inherited by any Website user who is a member of this group. The configuration is subject to being overridden in other groups and by the TSconfig of the user himself.
de: Diese Werte werden an jedes Mitglied der Gruppe vererbt. Die Werte werden unter Umständen von TSconfig-Konfiguration andere Gruppen überschrieben.

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
de: TypoScript-Syntax ohne Bedingungen und Konstanten.

# .description
source: Usergroups for Website users.
de: Definiert Benutzergruppen für Website-Benutzer.

# .details
source: The access restriction in TYPO3 is assigned to these usergroups. When a page or other element is access restricted to a group, only Website users which are members or that group will be able to view the element on the website.
de: Bei TYPO3 werden Website-Zugriffsbeschränkungen über Gruppenmitgliedschaften geregelt. Wenn eine Seite oder andere Inhaltselemente nur bestimmten Benutzern zugänglich sein soll, überprüft TYPO3, ob der angemeldete Benutzer Mitglied einer zugangsberechtigten Gruppe ist.

# _.seeAlso
source: fe_users, About access restricting pages | http://typo3.org/documentation/document-library/doc_tut_quickstart/Create_restricted_pa/
de: fe_users, Über zugriffsbeschränkte Seiten | http://typo3.org/documentation/document-library/doc_tut_quickstart/Create_restricted_pa/

# .image_descr
source: The form for editing frontend users groups. Pages, Content Elements and other records for frontend display often have a selector box where you can define access restriction by selecting access for a certain group only.
de: Ein Teil der Eingabemaske für Frontend-Benutzergruppen. Seiten, Inhaltselemente und andere Datensätze, die auf der Website angezeigt werden sollen, besitzen oftmals ein Auswahlfeld, über die man Zugriffsbeschränkungen für diese Elemente regeln kann.
