Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: de

# pages.details
source: With this field you can generally create a relation to a page (or more) in TYPO3. This field is used by many of the content element types. If you don't specify a page here, the current page will generally be used. Using the "Search" type, the page you insert will be the page to which the search is targeted. You must make sure that this page has a similar "Search" content element (or something similar) to render a search result. Else it makes no sense. The "Login" type content element also uses this field to direct the login to a certain page. However that page does not need to contain a Login content element in order to perform the authentication - you can in fact submit a login request to any TYPO3 page and it will be evaluated! If you specify a second page in this list, the id will be passed to the login system as being the page inside TYPO3 where the database of users to look up is found. You should use this only if your template is not configured to pass this value on. In order for the login procedure to work, you must make sure that 1) you have created at least one Website user and member usergroup and is using the correct username and password, 2) you have configured in your TypoScript template on which page (typically a SysFolder) the users can be found - or alternatively have specified this by the second page in the this page list, 3) cookies must be enabled. The "Menu/Sitemap" element also uses this field. In that case the page(s) will determine from which point the menu is drawn or maybe even represent the actual pages to which the menu links. All this depends on the subtype of Menu/Sitemap you have selected. Finally the "Form" element uses this field as the page to which the form is submitted. You might thus insert a page which is the "Thank you" page of the form mail.
de: Mit diesem Feld können Sie eine Beziehung zu einer Seite (oder mehreren) in TYPO3 herstellen. Dieses Feld wird von mehreren Inhaltstypen verwendet. Wenn Sie hier keine Seite angeben, wird grundsätzlich die aktuelle Seite verwendet. Für den Typ "<b>Suche</b>" beinhaltet das Feld die Seite, auf der das Suchergebnis angezeigt wird. Sie müssen sicherstellen, dass das Ziel ein solches "Suche"-Element (oder etwas ähnliches) besitzt, um das Ergebnis darzustellen. Ansonsten ist es nicht sinnvoll. Das Element "<b>Anmeldeformular</b>" benutzt dies Feld ebenfalls, um den angemeldeten Benutzer auf eine neue Seite zu umzuleiten. Dieses Ziel benötigt allerdings kein Anmeldeformularelement, um die Anmeldung durchzuführen - Sie können den Anwender auf jede beliebige TYPO3-Seite weiterleiten! Wenn Sie in der Liste eine zweiter Seite angeben, so wird diese Seite an das Anmeldesystem als diejenige Seite weitergeleitet, wo die Datenbank der Anwender zu finden ist. Sie sollten dies nur verwenden, wenn Ihre Vorlage diesen Wert nicht von sich aus weiterleitet. Damit die Anmeldung funktioniert, müssen Sie sicherstellen, dass 1) Sie einen Benutzer und eine Benutzergruppe erstellt haben, 2) Sie in der Vorlage definiert haben, auf welcher Seite (typisch ein SysOrdner) die Benutzer gefunden werden können - oder sie haben dies durch die zweite Seite in der Seitenliste getan, 3) Cookies im Browser des Anwenders aktiviert sind. Der Inhaltstyp "<b>Menü/Sitemap</b>" benutzt dieses Feld ebenfalls. In diesem Fall wird damit spezifiziert, von welcher Seite aus das Menü erzeugt wird oder enthält sogar diejenigen Seiten, auf die das Menü verweist. All dies hängt vom ausgewählten Untertyp ab. Schließlich benutzt das Element "<b>Formular</b>" dieses Feld als Angabe, welche Seite nach Absenden des Formulars angezeigt wird. Sie können auf diese Art eine "Vielen Dank"-Seite für das Mail-Formular erstellen.

# recursive.description
source: Select how many subleves should be additionally selected for each page in the list.
de: Entscheiden Sie, wie viele Unterebenen für jeder der ausgewählten Seiten zusätzlich ausgewählt werden sollen.

# recursive.details
source: Whether this feature makes sense or not depends solely on the template implementation and/or content element type. But basically if this feature is enabled it means that for each page listed in the "Send to page/Starting point" box subpages - to the depth specified here - will <em>also</em> be selected! <strong>Warning:</strong> If there are many subpages, be aware of this option. It may select an incredible amount of pages then!
de: Ob diese Funktion sinnvoll ist, entscheidet die Vorlage und/oder der Inhaltstyp. Aber grundsätzlich bedeutet die Aktivierung dieser Option, dass alle Unterseiten der ausgewählten Seiten in "Ausgangspunkt" bis zur gewählten Tiefe ebenfalls ausgewählt werden! <strong>Warnung:</strong> Falls es viele Unterseiten gibt, sollten sie mit dieser Option vorsichtig umgehen. Sie könnten eine unglaubliche Anzahl an Seiten auswählen!

# menu_type.description
source: Select which kind of menu you wish to create.
de: Wählen Sie, welche Art von Menü Sie erstellen wollen.

# menu_type.details
source: This is a short description of each type: <strong>Menu of these pages</strong> This will create a list of links to the pages you insert in the Startingpoint list. <strong>Menu of subpages to these pages</strong> This results in a list of links to the subpages of the pages in the Startingpoint list. If you do not specify a startingpoint, subpages to the current page will be selected. <strong>Menu of subpages to these pages (with abstract)</strong> Like the previous, but this will include the content of the Abstract field of the pages. <strong>Menu of subpages to these pages + sections</strong> Like the previous, but including 'submenu' links to all content elements on the page which has the "Index" checkbox set. <strong>Sitemap</strong> Generates a classic tree sitemap. Maybe your TypoScript template is configured to another design of the sitemap, but anyhow you'll get a sitemap out of this. Notice that the sitemap will begin from the current page unless you specify another "Startingpoint" page in the list below. <strong>Section index (pagecontent w/Index checked)</strong> This makes a menu to the content elements on this page (or the page specified in the Starting point list). Great way to make an index in the top of the page. Notice that all content elements with the "Index" checkbox set is selected. So if you don't want certain content elements to appear in the list, just un-check the Index checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and this list seems not to be updated instantly, just clear the cache of the page and the problem is solved. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords set for this page matched up with the keywords on other pages. <b>Notice:</b> With many of the above menu types, the default starting point is the current page. However you can specify another startingpoint (or more than one in fact!) by adding pages to the "Startingpoint" list. See link below.
de: Dies ist eine kurze Beschreibung jedes Typs: <strong>Menü dieser Seiten</strong> Dies erzeugt eine Liste von Links auf die in "Ausgangspunkt" angegebenen Seiten. <strong>Menü der Unterseiten</strong> Dies erzeugt eine Liste von Links auf die in "Ausgangspunkt" angegebenen Seiten und deren Unterseiten. Wenn Sie keine Startseite(n) angeben, werden die Unterseiten der aktuellen Seite aufgelistet. <strong>Menü der Unterseiten (mit Inhaltsangabe)</strong> Wie das Vorherige. Aber dieses enthält den Inhalt des Feldes "Inhaltsangabe" jeder Seite. <strong>Menü der Unterseiten (mit Seiteninhalt)</strong> Wie das Vorherige, inklusive 'Untermenü'-Links auf alle Seiteninhalte der Seite deren Index-Feld markiert ist. <strong>Sitemap</strong> Erzeugt einen klassischen Sitemap-Baum. Vielleicht definiert Ihre Vorlage eine andere Ansicht, aber Sie bekommen eine Sitemap. Beachten Sie, dass die Sitemap auf der aktuellen Seite beginnt, es sei denn, Sie definieren einen davon abweichenden "Ausgangspunkt". <strong>Abschnittsübersicht (mit Seiteninhalt)</strong> Dies erzeugt ein Menü der Seiteninhalte dieser (oder der in "Ausgangspunkt" ausgewählten) Seite. Gut geeignet, um einen Index am Anfang umfangreicher Seiten zu erstellen. Beachten Sie, dass alle Elemente angezeigt werden, deren Index-Feld markiert ist. Falls Sie einige Elemente in der Liste nicht angezeigt bekommen möchten, so deaktivieren Sie das Index-Feld für diese Elemente. <strong>Geänderte Seiten</strong> Zeigt die 10 zuletzt geänderten Seiten an. <strong>Hinweis:</strong> Wenn Sie eine Seite ändern und die Liste sich nicht ändert, löschen Sie einfach den Cache dieser Seite und das Problem ist behoben. <strong>Verwandte Seiten (nach Stichworten)</strong> Zeigt verwandte Seiten basierend auf den Stichworten dieser Seite verglichen mit den Stichworten anderer Seiten an. Hinweis: Für viele der beschriebenen Menütypen ist der Startpunkt die aktuelle Seite. Davon abweichend können Sie jede andere Seite (oder sogar mehrere) als Startpunkt festlegen, indem Sie sie in die Liste "Ausgangspunkt" aufnehmen. Siehe Link unten.

# list_type.description
source: Select a plugin to insert.
de: Wählen Sie das einzufügende Plug-In aus. (Verfügbarkeit hängt von der Vorlage ab).

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depends on which extensions are installed.
de: Die Liste der Plug-Ins, die Sie auf der Seite einfügen können. Die verfügbaren Plug-Ins hängen davon ab, welche Erweiterungen installiert sind.

# select_key.description
source: Enter a code string.
de: Geben Sie einen Code ein.

# select_key.details
source: Whether or not the content of this field is used and how it's intepreted depends on the context. It is considered obsolete today.
de: Ob ein Code verwendet wird und wie er interpretiert wird, ist vom Kontext abhängig. Heutzutage gilt er als überholt.

# table_bgColor.description
source: Select table background color.
de: Wählen Sie eine Hintergrundfarbe für die Tabelle.

# table_border.description
source: Select table border thickness.
de: Wählen Sie eine Rahmenbreite für die Tabelle.

# table_cellspacing.description
source: Select table cell spacing.
de: Wählen Sie einen Zellenabstand für die Tabellenelemente.

# table_cellspacing.details
source: Cell spacing is the distance between table cells in rows an columns. The distance is equally applied in all directions, top, bottom, left and right.
de: Zellenabstand ist der Abstand zwischen Zellen in Zeilen und Spalten. Die Distanz wird in allen Richtungen gleich angewandt: oben, unten, links und rechts.

# table_cellpadding.description
source: Select table cellpadding.
de: Wählen Sie einen Zelleninnenabstand.

# table_cellpadding.details
source: Cell padding is the 'internal' margin of a table cell. The distance is equally applied in all directions, top, bottom, left and right.
de: Mit Zelleninnenabstand bestimmen Sie den "inneren" Rand einer Zelle, also den Abstand zwischen Zellenrand und Zelleninhalt in Pixeln.

# media.description
source: Add files to the list here.
de: Fügen Sie der Liste Dateien hinzu.

# multimedia.description
source: Insert the multimedia element, eg. a flash movie here.
de: Fügen Sie hier das Multimediaelement ein, z.B. eine Flash-Animation.

# filelink_size.description
source: Check this, if you wish the filesizes to be displayed.
de: Markieren Sie dieses Feld, wenn Sie Dateigrößen angezeigt bekommen möchten.

# records.description
source: Insert relations to records.
de: Fügen Sie Verweise auf Datensätze ein.

# spaceBefore.description
source: Enter the amount of whitespace (in pixels) to insert <em>before</em> this content element.
de: Geben Sie den Abstand (in Pixeln) ein, der vor diesem Inhalt eingefügt werden soll.

# spaceAfter.description
source: Enter the amount of whitespace (in pixels) to insert <em>after</em> this content element.
de: Geben Sie den Abstand (in Pixeln) ein, der nach diesem Inhalt eingefügt werden soll.

# section_frame.description
source: Select a framing option for the content element.
de: Wählen Sie eine Rahmenoption für das Element aus.

# splash_layout.description
source: Select the design for the Text box.
de: Wählen Sie das Design des Textfeldes aus.

# splash_layout.details
source: <strong>Notice:</strong> The Textbox type has a few default renderings but are primarily designed to be used for custom purposes. Therefore the availability of features will depend on the current website template.
de: <strong>Hinweis:</strong> Die Textbox hat einige Standardansichten, ist aber hauptsächlich für benutzerspezifische Anwendungen gedacht. Daher hängt die Verfügbarkeit von Funktionen von der Vorlage ab.

# sectionIndex.description
source: If set, the content element will appear in section indices.
de: Falls markiert, taucht der Seiteninhalt in Menüs auf.

# sectionIndex.details
source: See details for the Menu-type selector (click below).
de: Siehe Details zum Menütyp (unten klicken).

# linkToTop.description
source: If checked, a little "To top" link will be inserted after the content element.
de: Falls markiert, erscheint ein kleiner "Nach oben"-Link nach dem Inhaltselement.

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text w/Image" types (<em>in this element only</em>).
de: Der Rich-Text-Editor wird für dieses Element deaktivert, falls diese Option markiert ist (<em>nur für dieses Element</em>).

# pi_flexform.description
source: FlexForm Configuration of Plugins
de: FlexForm-Konfiguration von Plug-Ins

# pi_flexform.details
source: Some plugins may require configuration of their options. They may use this field for FlexForm based configuration settings (stored as XML).
de: Manche Plug-Ins erfordern eine Konfiguration ihrer Optionen. Sie können dies Feld für FlexForm-basierte Konfigurationseinstellungen (als XML gespeichert) benutzen.
