Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: de

# .description
source: All visible content on webpages in TYPO3 is typically made by "Pagecontent" records. They are typically referred to as "Content Elements". Often Content Elements are managed by the "Page" module which is designed to handle Content Elements in multiple columns and languages.
de: Alle sichtbaren Inhalte auf Web-Seiten in TYPO3 werden typischerweise mittels "Seiteninhalt"-Datensätzen erzeugt. Sie werden in der Regel als "Inhaltselemente" bezeichnet. Inhaltselemente werden meist durch das Modul "Seite" verwaltet, das dafür eingerichtet ist, Inhalte in mehreren Spalten und mehreren Sprachen zu handhaben.

# .details
source: "Pagecontent" records is ordered and can thus be rearranged. Also notice that the "Language" and "Column" selector of the "Pagecontent" records determines where and in which situation they appear. If you do not change the value of the "Language" and "Column" selectors you are most sure that the element will appear by default.
de: Seiteninhalte sind geordnet und können daher in beliebiger Reihenfolge angeordnet werden. Beachten Sie auch, dass die Auswahlfelder "Spalte" und "Sprache" bestimmen, wo und unter welchen Umständen die Inhalte erscheinen. Wenn Sie diese Werte nicht ändern, können Sie davon ausgehen, dass Ihre Inhalte standardmäßig erscheinen.

# _.seeAlso
source: Page Content principles | http://typo3.org/documentation/document-library/doc_tut_quickstart/Page_content/, _MOD_web_layout
de: Grundlagen zu Seiteninhalt | http://typo3.org/documentation/document-library/doc_tut_quickstart/Page_content/, _MOD_web_layout

# .image_descr
source: The Page module is used to manage Content Elements effectively as they appear arranged in columns and languages. A Content Element has a large editing form with many options. The "Type" determines which options are visible. In the frontend - on the webpage - a Content Element like the above could look like this.
de: Das Modul "Seite" wird benutzt, um Inhaltselemente effizient zu verwalten: Sie sind in Spalten und Sprachen arrangiert. Ein Inhaltselement wird über ein großes Formular mit vielen Optionen bearbeitet. Der "Typ" bestimmt, welche Optionen sichtbar sind. Im Frontend - der Web-Seite - könnte ein Inhaltselement, wie das oben sichtbare, etwa so aussehen wie hier gezeigt.

# CType.description
source: Select the kind of page content this element represents. New options will appear when you save the record.
de: Wählen Sie die Art des Seiteninhalts aus, den dieser Datensatz darstellt. Neue Optionen erscheinen, sobald Sie den Datensatz speichern.

# CType.details
source: The 'Type' of content you select determines which options you have in the editform, so make sure to save the record before you make changes. This is a description of the various types: <strong>Header</strong> This type allows you insert a standard content element header and nothing more. Almost all the other types described below also includes the header with the exact same options. So the Header type just provides a way to insert a header <em>only</em> without anything else. <strong>Text</strong> The Text type allows you to insert regular page content. <strong>Text w/image</strong> This is the same as the Text type (regular page content) but with the option of attaching images. <strong>Image</strong> The same as Text w/image but without the text field - so only images. <strong>Bullet list</strong> Lets you create a bullet list. Each line in the text-field will appear as a single line in the bulletlist. <strong>Table</strong> Lets you create <em>simple</em> tables. Each line represents a tablerow and vertical bars '|' separates each column. <strong>Filelinks</strong> Allows you to present a list of files for download. You can have thumbnails attached to the list including filesize. <strong>Multimedia</strong> Lets you insert multimedia elements such as sound, video, java applets and flash animations. <strong>Form</strong> Lets you create mail forms. There is a special syntax to use when you wish to create form fields. <strong>Search</strong> This inserts a search box and it will also display the search result if a query is performed to the page. <strong>Login</strong> Displays a login box for website users. You must create at least one Website user and user group before this makes any sense to use. <strong>Textbox</strong> This is mainly for customly defined design which includes typically some text and an image. So in other words the function is not generally defined. However the default subtypes will let you choose various ways to display some text with an image. Use only if instructed to. <strong>Menu/Sitemap</strong> Offers a selection of various link menus and a sitemap you can insert on a page. <strong>Insert records</strong> This is a placeholder for other records. In other words, by this element you can attach other content elements from elsewhere and thus insert them this page. <strong>Insert plugin</strong> This will allow you to insert a forum, guestbook, list of addresses, shopping basket etc. The various features are available <em>only</em> if they are configured correctly in the template of your website. So before you use it, make sure this is the case. <strong>HTML</strong> This is plain HTML content. Everything put here will be displayed directly on the page without any preprocessing.
de: Der "Typ" des Inhalts-Elements, den Sie auswählen, entscheidet darüber, welche Optionen Ihnen im Formular angezeigt werden. Stellen Sie sicher, dass Sie einen Datensatz sichern, nachdem Sie den Typ geändert haben und bevor Sie weitere Änderungen vornehmen. Dies ist eine Beschreibung der verschiedenen Typen: <strong>Überschrift</strong> Dieser Typ erlaubt Ihnen ausschließlich, eine Überschrift einzufügen. Fast alle anderen Typen erlauben es ebenfalls, eine Überschrift mit genau den selben Optionen anzugeben. Der Typ "Überschrift" bietet also die Möglichkeit, eine Überschrift <em>ohne</em> irgendetwas anderes einzufügen. <strong>Text</strong> Der Text Typ ermöglicht die Eingabe von normalen Seiteninhalten. <strong>Text und Bilder</strong> Dies entspricht dem Typ "Text" (normale Seiteninhalte) mit der zusätzlichen Option, Bilder anzuhängen. <strong>Bild</strong> Das gleiche wie "Text und Bilder", aber ohne Textfeld (also nur Bilder). <strong>Aufzählung</strong> Damit können Sie eine Aufzählung erstellen. Jede Zeile des Textfeldes erscheint als ein Punkt in einer Liste. <strong>Tabelle</strong> Bietet die Möglichkeit, <em>einfache</em> Tabellen zu erstellen. Jede Zeile stellt eine Tabellenzeile dar und vertikale Striche ('|') trennen die Spalten. <strong>Dateilinks</strong> Präsentiert eine Liste von Dateien zum Herunterladen. Sie können Vorschausymbole zuordnen und die Dateigröße anzeigen lassen. <strong>Multimedia</strong> Damit können Sie Multimediaelemente einfügen, wie z.B. Sound, Video, Java-Applets und Flash-Animationen. <strong>Formular</strong> Lässt Sie Mail-Formulare erstellen. Für die Erstellung von Formular-Feldern gibt es eine spezielle Syntax (siehe Dokumentation). <strong>Suche</strong> Dies fügt ein Suchfeld ein und zeigt auch das Ergebnis der Suche an, wenn diese Seite als Ziel der Suchergebnisse angegeben wird. <strong>Anmeldeformular</strong> Zeigt eine Anmeldemaske für Website-Benutzer an. Sie müssen mindestens einen Website-Benutzer und eine Benutzergruppe anlegen, damit dieser Typ Sinn hat. <strong>Textbox</strong> Dieser Typ ist vorgesehen für maßgeschneiderte Designs, die typisch einigen Text und ein Bild enthalten. In anderen Worten, dieser Typ ist nicht immer verfügbar. Benutzen Sie diesen Typ also nur, wenn Sie dazu angewiesen werden. Es existieren andere Typen zur Anzeige von Text und Bildern. <strong>Menü/Sitemap</strong> Bietet eine Auswahl von verschiedenen Link-Menüs und eine Sitemap, die Sie auf einer Seite einfügen können. <strong>Datensatz einfügen</strong> Dies ist ein Platzhalter für andere Datensätze. Mit anderen Worten: Mit diesem Element können Sie andere Datensätze von anderen Seiten anhängen und damit in diese Seite integrieren. <strong>Plug-In einfügen</strong> Dies erlaubt es Ihnen, ein Forum, ein Gästebuch, eine Adressliste, einen Einkaufskorb etc. einzubinden. Die verschiedenen Möglichkeiten sind <em>nur</em> dann verfügbar, wenn sie in der Vorlage richtig konfiguriert wurden. Vergewissern Sie sich also, welche Plug-Ins in Ihrer Website verfügbar sind. <strong>Skript</strong> Dies ist reserviert für benutzerdefinierte Zwecke, womit es Ihnen der Vorlagenprogrammierer erlauben kann, spezialisierte Inhalte einzufügen. <strong>Trenner</strong> Damit fügen Sie eine Trennlinie ein. <strong>HTML</strong> Dies ist reiner HTML-Inhalt. Alles, was hier eingegeben wird, wird ohne weitere Verarbeitung auf der Seite angezeigt.

# _CType.seeAlso
source: tt_content:colPos, tt_content:sys_language_uid, About Content Elements | http://typo3.org/documentation/document-library/doc_tut_quickstart/Content_element_type/
de: tt_content:colPos, tt_content:sys_language_uid, Über Inhaltselemente | http://typo3.org/documentation/document-library/doc_tut_quickstart/Content_element_type/

# hidden.description
source: Check this box if you wish to hide the content element from being displayed.
de: Ist diese Option aktiviert, wird das Element nicht auf der Seite angezeigt.

# starttime.description
source: Enter the date from which the content element will be visible.
de: Geben Sie das Datum ein, ab dem das Element sichtbar sein wird. Wie in allen Datumsfeldern können Sie "d" eingeben, um das aktuelle Datum zu erhalten und Sie können einfach Tage addieren oder subtrahieren: mit "d+7" etwa erhalten Sie das Datum in einer Woche.

# endtime.description
source: Enter the date from which the content element will disappear from the website.
de: Geben Sie das Datum ein, ab dem das Element von der Website verschwindet. Wie in allen Datumsfeldern können Sie "d" eingeben, um das aktuelle Datum zu erhalten und Sie können einfach Tage addieren oder subtrahieren: mit "31-12-2004-7" etwa erhalten Sie das Datum eine Woche vor Sylvester 2004.

# fe_group.description
source: Select a Website usergroup which is exclusively allowed to view the element.
de: Wählen Sie eine Benutzergruppe aus, die als einzige befugt ist, das Element zu betrachten.

# fe_group.details
source: The options in this box depends on which Website usergroups are created and available for you. When you select a user group here, the content element will no longer be visible to users which are not logged in. Only Website users which are logged in and members of the group you selected will be allowed to see the element. If you select "Hide at login" the effect is kind of reversed in that the element <em>disappears</em> if <em>any</em> Website user is logged in. This is useful if you want to present information like "How to login" and such which is irrelevant if a user is finally logged in.
de: Die Optionen in diesem Auswahlfeld sind davon abhängig, welche Benutzergruppen erstellt wurden und für Sie verfügbar sind. Wenn Sie hier eine Benutzergruppe auswählen, wird das Element nicht mehr für Anwender sichtbar sein, die nicht angemeldet sind. Nur angemeldete Benutzer, die Mitglied der ausgewählten Gruppe sind, bekommen das Element zu sehen. "Anzeigen, wenn angemeldet" erweitert die Anzeige: solche Inhalte werden nur angemeldeten Benutzern gezeigt, aber unabhängig davon, welcher Gruppe sie angehören. "Nach Anmeldung verbergen" bewirkt das genaue Gegenteil, d.h. das Element <em>verschwindet</em>, wenn <em>irgendein</em> Benutzer angemeldet ist. Dies ist z.B. sinnvoll, um Informationen wie "Wie melde ich mich an?" oder ähnliches anzuzeigen, die irrelevant sind, wenn der Benutzer letzlich angemeldet ist.

# sys_language_uid.description
source: Select the system language of this element. <strong>Notice</strong> this will affect whether the element is visible.
de: Wählen Sie die Systemsprache des Elements aus. Beachten Sie, dass dies Einfluss darauf hat, ob das Element sichtbar ist.

# sys_language_uid.details
source: This allows you to assign a specific language to the content element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
de: Dies erlaubt es Ihnen, dem Element eine spezifische Sprache zuzuordnen. Falls Sie etwas anderes als die Standardsprache auswählen, wird das Element <em>nicht</em> sichtbar sein, solange diese Sprache nicht in der Vorlage konfiguriert wurde. Die verfügbaren Systemsprachen werden vom Administrator eingestellt.

# _sys_language_uid.seeAlso
source: tt_content:colPos, sys_language, Localization concepts [Technical] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
de: tt_content:colPos, sys_language, Lokalisierungskonzepte [Technisch] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list

# layout.description
source: Select a layout.
de: Wählen Sie ein Layout aus.

# layout.details
source: This option is not used in the default templates but may be used by any custom rendering. There are a number of default implementations depending on the content element type: <b>"Filelinks":</b> "Normal" will provide a list of filelinks with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail if the file is an image file and if not an icon. A black border is wrapped around. "Layout 3" is like Layout 2, but without the black border.
de: Diese Option wird von den Standardvorlagen nicht verwendet und kann für benutzerdefinierte Ansichten verwendet werden. Es gibt einige Standardimplementierungen, die vom Inhaltstyp abhängig sind: <b>"Dateilinks":</b> "Normal" erzeugt eine Liste ohne Vorschau-Symbole. "Layout 1" fügt ein Dateisymbol links vom Link ein. "Layout 2" Fügt ein Vorschausymbol ein, falls die Datei ein Bild ist. Ein schwarzer Rahmen wird hinzugefügt. "Layout 3" ist wie Layout 2, aber ohne schwarzen Rahmen.

# colPos.description
source: Select the column position this element. <strong>Notice</strong> this will affect whether the element is visible.
de: Wählen Sie die Spaltenposition des Elements. Beachten Sie, dass damit die Sichtbarkeit des Elements beeinflusst wird.

# colPos.details
source: Most websites use only one column of content. However some templates lets you put content in multiple columns and this option allows you to select another column for the element. <strong>Notice</strong> that selecting another column than "Normal" will make the content element disappear unless that column is also displayed in the website template. If your content element is 'strangely' not visible please make sure the Column and Language selectors are set correctly.
de: Die meisten Web-Auftritte verwenden nur eine Spalte für Inhalte. Manche Vorlagen lassen Sie jedoch Inhalte in mehrere Spalten einfügen und diese Option erlaubt es Ihnen, eine andere Spalte auszuwählen. <strong>Beachten Sie,</strong> dass die Auswahl einer anderen Spalte als "Normal" das Inhaltselement verschwinden lässt, solange diese Spalte nicht auch von der Vorlage vorgesehen ist. Normalerweise werden allerdings Spalten, die die Vorlage nicht darstellt, auch nicht angeboten. Falls Ihr Inhalt aber "seltsamerweise" nicht sichtbar ist, stellen Sie bitte sicher, dass Spalte und Sprache richtig ausgewählt wurden. Beachten Sie bitte ausserdem, dass der Begriff "Spalte" nicht zu wörtlich genommen werden sollte. Es gibt durchaus Vorlagen, die die "Spalten" ganz anders im Web-Auftritt anzeigen, z.B. könnte die Spalte "Links" im oberen Bereich und die Spalte "Rechts" im unteren Bereich angezeigt werden.

# date.description
source: Enter a date to be displayed above the header.
de: Geben Sie ein Datum ein, das oberhalb der Überschrift angezeigt wird.

# header.description
source: Enter a headline for the content element.
de: Geben Sie eine Überschrift für das Inhaltselement ein.

# header.details
source: Almost all content elements (except the HTML type for instance) will display this header above the content. If you don't want a header displayed, select the header Layout to "Hidden". Alternatively you can choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One of these are the HTML type content element.
de: Fast alle Elemente (außer z.B. HTML) können eine Überschrift vor dem Inhalt anzeigen. Falls Sie nicht wollen, dass ein Titel angezeigt wird, wählen Sie den Überschriftstyp "verborgen" aus. Alternativ können Sie das Feld auch leer lassen. Einige Inhaltselemente zeigen die Überschrift standardmäßig nicht an. In solchen Fällen wird das Feld "Name" genannt. Einer dieser Typen ist "HTML".

# header_position.description
source: Places the header to the left, centered or to the right.
de: Richtet die Überschrift links, mittig oder rechts aus.

# header_link.description
source: Creates a link from the header. Insert a page id, email address or URL.
de: Macht aus der Überschrift auch einen Link. Geben Sie eine Seitennummer, E-Mail-Adresse oder URL ein.

# header_link.syntax
source: If you insert an id-number, eg. "51", the link will refer to page with id=51 <em>inside</em> TYPO3. If you insert an email address, eg. "name@my-domain.test", the link will point to that email address. If you insert an URL or domain, eg. "www.typo3.org" or "http://www.my-domain.org", the link will point to that website.
de: Wenn Sie eine ID-Nummer, z.B. "51" eingeben, verlinkt die Überschrift zu der Seite mit der id=51 <em>innerhalb</em> Ihres TYPO3-Web-Auftritts. Wenn Sie eine E-Mail-Adresse, z.B.. "name@my-domain.test" eingeben, wird der Link auf diese E-Mail-Adresse zeigen. Wenn Sie eine URL oder Domäne eingeben, z.B. "www.typo3.com" oder "http://www.my-domain.org", wird der Link auf diese externe Website zeigen.

# header_layout.description
source: Select a visual design for the header.
de: Wählen Sie ein Layout für die Überschrift aus.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful if you wish a header for the content element (in order to identify it in the backend) but do not wish the header to be displayed on the website.
de: Wenn Sie "Normal" auswählen, wird das Standardlayout (eines der Layouts 1-5) verwendet. Der Standard ist in der Vorlage festgelegt. Alternativ können Sie auch ein Layout ausdrücklich (von 1 bis 5) festlegen, das in der Vorlage der Website individuell konfiguriert ist. Wenn Sie "Verborgen" auswählen, erscheint die Überschrift einfach nicht. Dies ist hilfreich, wenn Sie dem Element einen Namen geben wollen (um es im Backend zu identifizieren), auf der Seite aber keine Überschrift erscheinen soll.

# subheader.description
source: Enter a subheader. This is displayed below the ordinary headline. If the content element type is "Form" this field is the recipient email.
de: Geben Sie einen Untertitel ein. Dieser wird unterhalb der Überschrift angezeigt. Falls es sich um den Inhaltstyp "Formular" handelt, ist hier die E-Mail-Adresse des Empfängers einzutragen.

# subheader.details
source: A subheader is displayed only with the "Header" content element type. <b>Notice:</b> When using the content element type "Form", this field is named 'Recipient-email:' and contains the email address of the form mail recipient. It's therefore important to allow access to this field for the users.
de: Ein Untertitel wird nur für den Inhaltstyp "Überschrift" angezeigt. <b>Hinweis:</b> Wenn Inhalte des Typs "Formular" eingesetzt werden, wird dieses Feld "E-Mail-Empfänger:" benannt und enthält die E-Mail-Adresse des Formularempfängers. Daher ist es wichtig, dass die Anwender Zugriff auf dieses Feld bekommen.

# bodytext.description
source: Enter the body text.
de: Geben Sie hier den Inhalt ein.
