Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/context_help/*.locallang_csh_pages.xlf
Languages: de

# layout.description
source: Select a layout for the page. Any effect depends on the website template.
de: Wählen Sie ein Layout für diese Seite aus. Die Auswirkung hängt von der Vorlage des Web-Auftritts ab.

# layout.details
source: This option may not have any impact on the page design since it depends on how (and if) the front end template uses it. In most default templates it's not used.
de: Diese Option hat eventuell keine Auswirkungen auf die Darstellung, denn dies ist abhängig davon, ob und wie die Frontend-Vorlage Gebrauch von der Auswahl macht. Von den meisten Vorlagen wird sie nicht genutzt.

# doktype.description
source: Select a page type affects whether the page represents a visible webpage or is used for other purposes.
de: Wählen Sie den Seitentyp aus. Dies hat Einfluss darauf, ob die Seite als normale Web-Seite dargestellt oder für andere Zwecke genutzt wird.

# doktype.details
source: 'Standard' and 'Advanced' types are regular webpages, just differing in the number of options. 'External URL' and 'Shortcut' types allows you to let a page be a shortcut to either an external URL or in the latter case a page in the page tree. 'Not in menu' is also a regular page, but will not be shown in the navigation. <em>This page type is deprecated! Please use the "Hide in menu" option!</em> 'Backend User Section' is an option which requires a backend user to be logged in for the page to be visible. <b>Special types:</b> 'Spacer' is only meaningfull if your frontend navigation is programmed to use it. In this case it does not represent a page with content but is intended to be a non-clickable placeholder in the navigation. 'SysFolder' is a page type which cannot be shown as a webpage but is rather acting as a storage for records of your choice. 'Recycler' is a garbage can. Pages and records in a recycler are not visible in the frontend. <b>Notice:</b> Each type usually has a specific icon attached. Also certain types may not be available for a user (so you may experience that some of the options are not available for you!). And finally each type is configured to allow only certain table records in the page (SysFolder will allow any record if you have any problems).
de: "Standard" und "Erweitert" sind normale Web-Seiten, die sich nur in der Anzahl der Optionen unterscheiden. "Externe URL" und "Verweis" ermöglichen einen Verweis auf eine externe Seite oder eine Seite innerhalb des eigenen Seitenbaums. "Nicht im Menü" ist ebenfalls eine normale Seite, die aber nicht in erzeugten Menü angezeigt wird. <em>Dieser Typ sollte nicht mehr verwendet werden! Bitte stattdessen die Option "Nicht im Menü" verwenden!</em> "Backend-Benutzerbereich". Solche Seiten werden nur angemeldeten Backend-Benutzern (Redakteuren bzw. Administratoren) angezeigt. Sie entsprechen ansonsten den Seiten vom Typ "Erweitert". <b>Spezielle Typen:</b> "Abstand" hat nur eine Bedeutung, wenn ihr System dafür eingerichtet ist. In diesem Falle erzeugt eine soche "Seite" einzig ein Trennzeichen im erzeugten Menü, das nicht anklickbar ist. "SysOrdner" ist eine Seite, die niemals als Web-Seite angezeigt wird, sondern als Behälter ("Container") für beliebige Daten dient. "Papierkorb". Seiten und Datensätze im Papierkorb werden auf den Web-Seiten nicht angezeigt. Sie sind jedoch noch nicht endgültig gelöscht, sondern können zurück an eine geeignete Stelle verschoben werden. <b>Hinweis:</b> Jedem Typ ist ein spezielles Symbol zugewiesen. Manche Typen stehen einem Anwender möglicherweise auch nicht zur Verfügung (Sie werden daher eventuell feststellen, dass einige Optionen nicht zur Auswahl stehen!). Beachten Sie außerdem, dass jeder Seitentyp nur bestimmte Inhalte/Datensätze erlaubt. (Im Zweifel erlaubt "SysOrdner" beliebige Daten.)

# hidden.description
source: If this is checked, the page will be hidden on the website.
de: Ist diese Option aktiviert, wird die Seite nicht angezeigt.

# hidden.details
source: The 'Hidden', 'Start', 'Stop' and 'Access' options are all about limiting access to pages and thus they are related in functionality. In any case where a page is not visible due to one of these options, the page will not show up in the site navigation. Notice, these options are related <em>only</em> to the page for which they are set. If you want their effect to cover the subpages as well, you must enable the 'Include subpages' option. When you're logged in as a backend user you can preview hidden pages if you have read access to them.
de: Die Optionen "verbergen", "Start", "Stopp" und "Zugriff" dienen der Zugriffsbeschränkung auf die Seite und sind daher verwandt. Ist die Seite auf Grund einer dieser Optionen nicht sichtbar, so wird sie im erzeugten Menü nicht angezeigt. Beachten Sie, dass die Optionen <em>nur</em> jene Seiten betreffen, auf denen sie gesetzt sind. Wenn Sie Unterseiten ebenfalls beeinflussen wollen, müssen Sie die Option "Inklusive Unterseiten" auswählen. Wenn Sie als Backend-Benutzer angemeldet sind, können Sie versteckte Seiten betrachten, falls Sie Lesezugriff darauf haben.

# hidden.image_descr
source: The page icon of a hidden page is dimmed and a red X is added. If you view a page that is hidden and you are logged in into the backend you will still be able to see the page. The red "Preview" box will tell you that this page is visible to you because of this special circumstance.
de: Das Symbol einer versteckten Seite ist grau und mit einem roten X versehen. Sind Sie im Backend angemeldet, können Sie eine versteckte Seite trotzdem ansehen. Der rote "Preview"-Kasten weist auf den Umstand der Vorschau hin. Ansonsten wird die Seite aber so dargestellt, wie sie es auch im Frontend würde.

# starttime.description
source: The 'Start' time determines the date from which the page will be visible online. Use this to 'publish' the page on a certain date. If 'Start' time is not set, the page will be online instantly (unless the page is hidden otherwise).
de: Die "Start"-Zeit legt den Zeitpunkt fest, ab dem die Seite online sichtbar wird. Benutzen Sie diese Einstellung, um die Seite zu einem bestimmten Zeitpunkt zu "veröffentlichen". Falls "Start" nicht gesetzt ist, wird die Seite sofort angezeigt (solange die Seite nicht anderweitig verborgen ist).

# starttime.syntax
source: Format is DD-MM-YYYY. You may enter the value in other ways - it will be evaluated immediately. If you insert eg. a 'd' the current date is inserted. You can also append any value in the field with eg. '+10' which will add 10 days to the current value. For instance setting the value to 'd+10' would select a date 10 days from now.
de: Das Format ist: TT-MM-JJJJ. Sie können den Wert auch auf andere Weise eingeben - es wird umgehend ausgewertet. Geben Sie z.B. "d" ein, so wird das aktuelle Datum eingefügt. Sie können auch jedem Wert z.B. "+10" anhängen, wodurch 10 Tage zum aktuellen Wert addiert werden. So würden Sie mit der Eingabe von "d+10" ein Datum eingeben, das 10 Tage in der Zukunft liegt. Selbstverständlich wird eine korrekete Datumsberechnung vorgenommen, so erzeugt etwa die Eingabe von "03-10-2004-3" (3. Oktober 2004 minus 3 Tagen) das Datum "30-09-2004" (30. September 2004).

# endtime.description
source: The 'Stop' time is the date from which the page will not be online anymore.
de: Die "Stopp"-Zeit ist das Datum, von dem an die Seite nicht mehr online angezeigt wird.

# endtime.syntax
source: See Page / Start (click below)
de: Siehe Seite / Start (unten anklicken)

# fe_group.description
source: If 'Access' is set to a usergroup name, only website users which are members of the selected usergroup will be able to view the page when they are logged in. The special option 'Hide at login' means the page will <em>not</em> be visible for website users that are logged in. Likewise "Show at login" will make the page visible for any logged in frontend user.
de: Wenn "Zugriff" mit dem Namen einer Benutzergruppe belegt ist, sind nur Benutzer, die zu dieser Gruppe gehören, in der Lage, die Seite zu betrachten, sofern sie angemeldet sind. Die spezielle Option "Nach Anmeldung verbergen" bedeutet, dass die Seite angemeldeten Benutzern <em>nicht</em> gezeigt wird. Im Gegensatz werden mit "Anzeigen, wenn angemeldet" markierte Seiten allen angemeldeten Benutzern gezeigt.

# extendToSubpages.description
source: By default the Start, Stop, Access and Hidden options are effective <em>only</em> for the page on which they are set. If the option 'Include subpages' is checked for the page, then their effect is inherited by all subpages to that page.
de: Standardmäßig betreffen die Optionen "Start", "Stopp", "Zugriff" und "Verbergen" <em>nur</em> diejenigen Seiten, auf denen sie eingestellt sind. Falls die Option "Inklusive Unterseiten" für die Seite ausgewählt ist, wird der Effekt an die Unterseiten vererbt.

# extendToSubpages.details
source: Consider a scenario where you want to create a whole section of subpages only visible for users which are logged in. Setting the 'Access' option for the top page in the section would affect access to that page only. So the page would not show up in the navigation unless you are logged in. However the subpages would still be visible if one could guess the id-number of the pages and enter it manually in the URL. But setting this option would extend the effect of the top page setting to cover all subpages as well.
de: Denken Sie an ein Szenario, bei dem ein ganzer Bereich Ihrer Internetpräsenz nur für angemeldete Benutzer zur Verfügung stehen soll. Wenn Sie die Option "Zugriff" für die oberste Seite setzen, so gilt diese Einstellung nur für diese eine Seite. Die Seite würde also nicht in der Navigation erscheinen, solange Sie nicht angemeldet sind. Trotzdem wären die Unterseiten sichtbar, falls jemand die Seitennummer errät und die URL von Hand eingibt (oder die URL etwa als "Favorit" im Browser gespeichert hatte). Durch Markieren der Option "Inklusive Unterseiten" wird die Zugriffsbeschränkung auf alle Unterseiten ausgedehnt.

# extendToSubpages.image_descr
source: This page icon has access restricted to a certain group and "Include subpages" set as well. This is reflected in the way the icon changed look.
de: Das Symbol der Seite zeigt, dass die Seite einer Benutzerbeschränkung unterliegt und dass "Inklusive Unterseiten" ebenfalls wirksam ist. Die zwei blauen Pfeile deuten dies an.

# alias.description
source: An 'alias' is a unique identification string for a page. You can use this string instead of the id-number to refer to the page.
de: Ein "Alias" ist ein eindeutiger Name für eine Seite. Sie können den Aliastext anstelle einer numerischen ID verwenden, um auf die Seite zu verweisen.

# alias.details
source: Ultimately a page is identified by its id-number. For instance you may refer to a page in TYPO3 by '.../?id=123'. If the page with id '123' has the alias 'one_two_three', then the URL '.../?id=one_two_three' would display exactly the same page, because 'one_two_three' is an alias for the id '123'. Normally you should assign aliases only to a limited number of pages, preferably those you need to link to a lot. In most TYPO3 configurations you would be able to use the syntax '.. &lt;link one_two_three&gt;go to the page&lt;/link&gt; ..' to create a link to the page. This is easier to remember. Another use is if you need to change which page such a link is referring to. In that case you can delete the alias for one page and enter it for another and all links pointing to the alias would now refer to another id-number.
de: Letztendlich wird eine Seite durch ihre ID eindeutig identifiziert. Sie können auf eine Seite bei TYPO3 z.B. mit ".../?id=123" verweisen. Falls die Seite mit der ID "123" den Alias "wichtige_seite" hat, dann zeigt die URL ".../?id=wichtige_seite" exakt die selbe Seite an, da "wichtige_seite" ein Alias für die ID "123" ist. Normalerweise sollten Sie nur einer kleinen Anzahl von Seiten einen Alias zuweisen, vorzugsweise solchen, auf die Sie oft verweisen. In den meisten TYPO3-Konfigurationen können Sie die Syntax '.. &lt;link&nbsp;wichtige_seite&gt;zur&nbsp;wichtigen&nbsp;Seite&lt;/link&gt; ..\' verwenden, um einen Verweis auf die Seite einzufügen. Dies ist einfacher zu merken als deren ID. Eine weitere Verwendung wäre, wenn Sie die Seite, auf die verwiesen wird, austauschen möchten. In diesem Fall löschen Sie den Alias einer Seite und geben ihn auf einer anderen Seite ein und alle Verweise auf den Alias zeigen nun automatisch auf die neue ID.

# alias.syntax
source: An alias can contain only lowercase alphanumeric characters and must be unique. Please notice: If the entered value was not unique, it will automatically be prepended with a number.
de: Ein Alias darf nur nur kleine alphanumerische Zeichen und den Unterstrich enthalten und muss eindeutig sein. Bitte beachten Sie: Falls der eingegebene Alias nicht eindeutig ist, so wird automatisch eine eindeutige Zahl vorangestellt.

# target.description
source: The HTML target of menu items linking to this page. Also can be used for open page in popup.
de: Das HTML-Ziel von Menüeinträgen, die auf diese Seite verweisen. Kann auch zum Öffnen einer Seite als Pop-Up verwendet werden.

# target.details
source: Set this value only to overrule the default link, which should be configured correctly for most pages in the website TypoScript template. There are more options with the target field Setting an integer value at the start of the field adds it as the default type for the page. For example, if an RSS feed is configured in Typoscript as typeNum=100, setting the target to 100 could be used to add an RSS link in the menu. For open in popup use following syntax: 400x200 - this opens page in a popup of size 400x200 230x450:resizable=0,location=1 - opens page in popup with parameters Combined: 100 600x350 - opens page in popup with type 100 2 _blank - opens page with target "_blank" and type 2
de: Verwenden Sie diesen Wert nur zum Übersteuern des Standard-Links, der für die meisten Seiten über das TypoScript-Template konfiguriert sein sollte. Über das Feld "Ziel" gibt es weitere Optionen. Durch Setzen eines ganzzahligen Wertes am Anfang des Feldes wird dieser als Standardtyp für die Seite verwendet. Wenn beispielsweise über TypoScript ein RSS-Feed als typeNum=100 konfiguriert wurde, kann durch Setzen des Ziels auf 100 ein RSS-Link in das Menü eingebaut werden. Zum Öffnen in einem Pop-Up-Fenster verwenden Sie folgende Syntax: 400x200 - öffnet die Seite in einem Pop-Up-Fenster der Größe 400x200 230x450:resizable=0,location=1 - öffnet die Seite in einem Pop-Up-Fenster mit den entsprechenden Parametern Kombiniert: 100 600x350 - öffnet die Seite vom Typ 100 in einem Pop-Up-Fenster 2 _blank - öffnet die Seite mit Ziel "_blank" und Typ 2

# no_cache.description
source: This option disables server caching of the page.
de: Deaktiviert das serverseitige Vorhalten (Cachen) der fertigen Seite.

# no_cache.details
source: Normally pages in TYPO3 are cached on the server after being constructed for the first time. This means a page is displayed much faster the second time it's requested. For most pages this presents no problems - rather it's boosting the performance of the website. However you may need to disable caching for a page if it contains dynamic content which must not be cached under any circumstances. Normally the PHP-code rendering such content is programmed to disable the caching automatically. But in any case you can force the page not to be cached via this option.
de: Normalerweise werden Seiten bei TYPO3 in ihrer fertigen Form gespeichert und so vorgehalten, sobald sie zum ersten Mal erzeugt wurden. Dies bedeutet, dass die Seite bei den folgenden Anfragen wesentlich schneller angezeigt wird. Für die meisten Seiten stellt dies kein Problem dar - im Gegenteil: es steigert die Geschwindigkeit des Web-Auftritts erheblich. Selbstverständlich wird die vorgehaltene fertige Kopie automatisch sofort verworfen, wenn die Seite oder deren Inhalt verändert wird. Trotzdem mag es notwendig sein, das Vorhalten für Seiten zu deaktivieren, die ständig ändernde, dynamische Inhalte beinhalten. Normalerweise wird das Vorhalten für solche Seiten automatisch deaktiviert. Für alle Fälle können Sie mit dieser Option das Vorhalten zuverlässig unterbinden.

# cache_timeout.description
source: Sets the cache timeout for the page.
de: Setzt die Verfallszeit des Vorhaltens (Caches).

# cache_timeout.details
source: By default pages last for 24 hours in the cache. After that period the page is constructed again and rewritten to the cache. Depending on your configuration, the cache may also be cleared at midnight. Anyhow you may here set another timeout time for the page in cache if you need to. This option is used quite rarely.
de: Standardmäßig werden alle Seiten 24 Stunden lang im Cache vorgehalten. Nach dieser Zeitspanne wird die Seite, bei Bedarf, erneut aufgebaut und die vorgehaltene Kopie aktualisiert. Abhängig von Ihrer Konfiguration kann der Cache auch zu einer bestimmten Uhrzeit (etwa Mitternacht) gelöscht werden. Sie können hier eine andere Verfallszeit angeben, falls Sie dies benötigen. Diese Option wird sehr selten genutzt.

# no_search.description
source: If enabled, this option excludes the page from searching operations on the website.
de: Falls aktiviert, verhindert diese Option, dass diese Seite in eine Suche einbezogen wird.

# author.description
source: Enter the page authors name.
de: Geben Sie den Namen des Seitenautors ein.

# author.details
source: Whether the author name is used or not depends on the setup of your TypoScript template. - You may use it in a meta-tag. - If you're using TYPO3 pages as 'articles' then you could use this field to display the name of the page (article) author.
de: Ob der Name des Autor genutzt wird, hängt von der Vorlage des Web-Auftritts ab. - Sie können es in einem Meta-Tag verwenden. - Wenn Sie TYPO3-Seiten als Artikel benutzen, dann können Sie dieses Feld benutzen, um den Namen des Autors des Artikels anzuzeigen.

# author_email.description
source: Enter the page authors email address.
de: Geben Sie die E-Mail-Adresse des Autors ein.

# module.description
source: Define the page as a frontend 'module'.
de: Definiert die Seite als Frontend-"Modul".

# module.details
source: In the backend there is a module called 'Web>Modules' as well as a header 'Modules' in the 'User>Task Center'. Both functions list the available 'Frontend modules' to which the user has access. Basically, setting this option just marks the page so the backend knows this page contains eg. a forum or is the root page of a shopping section on the website. And based on this knowledge the backend is able to display a shortcut list as well as relevant functionality in the 'Web>Modules' module. The frontend display is - largely - not affected. So in effect, by 'marking' a page to be a 'Shop' module simply means it'll show up in the shortcut list of modules in the backend. There may be a little more to it than this, but for details on the subject, you must refer to the administration documentation. It's recommended that only admin-users are allowed access to this field!
de: Im Backend gibt es ein Modul "Web > Erweiterungen", sowie einen Punkt "Erweiterungen" unter "Benutzer > Aufgaben". Beide Funktionen zeigen eine Liste von "Erweiterungen" an, auf die der Anwender Zugriff hat. Grundsätzlich markiert diese Option die Seite nur z.B. als Forum oder Einkaufsbereich Ihres Web-Auftritts. Basierend auf dieser Information ist das Backend in der Lage, eine Liste der Erweiterungen anzuzeigen, sowie relevante Funktionalität im Modul "Web > Erweiterungen". Die Darstellung der Seite wird davon nicht beeinflusst. Effektiv bedeutet die "Markierung" der Seite als "Shop"-Erweiterung einfach, dass sie in der Liste der Erweiterungen im Backend erscheint. Weitere Informationen darüber finden Sie in der Dokumentation für Administratoren. Es wird empfohlen, dass nur Administratoren Zugriff auf dieses Feld erhalten!

# media.description
source: Attach media files related to the page.
de: Hängen Sie Mediendateien an, die zu der Seite gehören.

# media.details
source: This fields allows you to attach various files to the page record. If and how these files are used depends on your template. So basically which files you attach here and in which order they must be listed is determined by your specific website template and thus you should seek instructions in the documentation for your specific website. As an example this field could be used from the template to allow you to attach a logo-image to the page. Or the template might be programmed to expect the first file to be an image used as a link in the navigation menu. But remember, this totally depends on how this field is used in the programming of the template.
de: Dieses Feld ermöglicht es Ihnen, der Seite verschiedene Dateien anzuhängen. Ob und wie diese Dateien verwendet werden, hängt von der Vorlage ab. Welche Dateien Sie anhängen und in welcher Reihenfolge dies geschehen muss, ist also grundsätzlich von der speziellen Vorlage Ihres Web-Auftritts abhängig. Schauen Sie in die Dokumentation Ihres Web-Auftritts. Beispielsweise könnte dieses Feld dazu benutzt werden, in Seitenlogo anzuhängen. Oder die Vorlage könnte so programmiert sein, dass die erste Datei ein Symbol ist, das im Menü angezeigt wird. Aber bitte denken Sie daran, dass dies völlig von der Programmierung der Vorlage abhängt.

# subtitle.description
source: Enter a subtitle if needed.
de: Geben Sie einen Untertitel ein, falls benötigt.

# subtitle.details
source: Whether this field is used or not depends on the template. In most cases it's not used. You may use this field as you like in your own templates.
de: Ob das Feld genutzt wird oder nicht hängt von der Vorlage ab. In den meisten Fällen wird es nicht genutzt. Sie können dieses Feld nach Bedarf in eigenen Vorlagen verwenden.

# url.description
source: Enter the URL to which this page is supposed to link.
de: Geben Sie die URL ein, auf die diese Seite verweisen soll.

# url.details
source: Example: 'http://www.typo3.org' or just 'www.typo3.org' provided the 'Type' selector is set to 'http://'. Use the 'Type' selector to select a prefix for the URL. This option is used only if the page 'Type' is set to 'External URL'.
de: Beispiel: "http://www.typo3.com" oder einfach "www.typo3.com", vorausgesetzt als "Typ" ist "http://" ausgewählt. Benutzen Sie die Auswahlbox "Typ" um ein Präfix für die URL auszuwählen. Diese Option wird nur dann genutzt, wenn der "Seitentyp" auf "Externe URL" gesetzt ist.

# shortcut.description
source: Insert a reference to the page to which this page is supposed to be a shortcut. Requesting this ID in the frontend will redirect people to the page referred to by this value.
de: Geben Sie die Seitenreferenz an, auf die diese Seite verweisen soll. Wird diese Seite im Frontend aufgerufen, dann wird stattdessen die referenzierte Seite gezeigt.

# shortcut.details
source: Click the 'Browse for records' icon and a new window will appear in which you can easily select the page to which the shortcut is supposed to link. This option is used only if the page 'Type' is set to 'Shortcut'.
de: Klicken Sie auf das Symbol "Datensatz suchen", und ein neues Fenster erscheint, in dem Sie die Seite auswählen können, auf die verwiesen werden soll. Diese Option wird nur dann genutzt, wenn der "Seitentyp" auf "Verweis" gesetzt ist.

# shortcut.image_descr
source: Select a page to shortcut to by the Element Browser.
de: Wählen Sie die Seite, auf die verwiesen werden soll, im Element-Browser.

# keywords.description
source: Enter keywords for the page separated by commas. You may also use short phrases.
de: Geben Sie Schlüsselwörter für diese Seiten durch Kommas getrennt ein. Es können auch kurze Ausdrücke eingegeben werden.
