Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/rtehtmlarea/*.locallang_csh.xlf
Languages: de

# .description
source: htmlArea RTE is a free, open-source, ExtJS-based editor for <textarea> fields featuring tight integration with TYPO3.
de: htmlArea RTE ist ein freier Open-Source-Editor auf Basis von Ext JS zur Bearbeitung in <textarea>-Feldern. Er bietet eine enge Integration an TYPO3.

# .details
source: htmlArea RTE supports the following browsers: Firefox 1.5+, SeaMonkey 1.0+, Safari 3.0.4+, Google Chrome 1.0+ and Opera 9.62+ on any platform, and Internet Explorer 6.0+ on Windows.
de: htmlArea RTE unterstützt die folgenden Browser: Firefox 1.5+, SeaMonkey 1.0+, Safari 3.0.4+, Google Chrome 1.0+ und Opera 9.62+ auf jeder Plattform und Internet Explorer 6.0+ unter Windows.

# beUserSettings.alttitle
source: BE User settings
de: Einstellungen des BE-Benutzers

# beUserSettings.description
source: BE User settings let you specify some options of the RTE.
de: In den Einstellungen des Backend-Benutzers können Sie einige Einstellungen des RTE festlegen.

# rteWidth.alttitle
source: Default width of the RTE in px or %
de: Standardbreite des RTE in px oder %

# rteWidth.description
source: This option lets you specify the initial width of the RTE.
de: Mit dieser Optionen können Sie die Ausgangsbreite des RTE festlegen.

# rteWidth.details
source: The option specifies the width of the RTE when it is initially displayed. The width may be specified as a fixed number of pixels or as a percentage.
de: Diese Option legt die Breite des RTE fest, wenn er das erste Mal angezeigt wird. Sie kann als Zahl in Pixel oder in Prozent angegeben werden.

# rteHeight.alttitle
source: Default height of the RTE in px
de: Standardhöhe des RTE in px

# rteHeight.description
source: This option lets you specify the initial height of the RTE.
de: Mit dieser Optionen können Sie die Ausgangshöhe des RTE festlegen.

# rteHeight.details
source: The option specifies the height of the RTE when it is initially displayed. The height of the RTE must be specified as a fixed number of pixels not as a percentage. The value you set should allow sufficient height for the tool bar, the editing area and the status bar of the RTE.
de: Diese Option legt die Höhe des RTE fest, wenn er das erste Mal angezeigt wird. Sie muss als Zahl in Pixel, nicht in Prozent angegeben werden. Die Höhe, die Sie angeben, sollte genügend Raum für die Menüleiste, den Editierbereich und die Statusleiste des RTE lassen.

# rteResize.alttitle
source: Make RTE resizable
de: Größe des RTE veränderbar machen

# rteResize.description
source: This option will make RTE-enabled fields resizable. A resize handle will appear at the bottom right corner of the RTE.
de: Mit dieser Option können Sie die Größe des RTE veränderbar machen. Es wird ein Griff an der unteren rechten Ecke des RTE erscheinen, mit dem Sie die Größe anpassen können.

# rteMaxHeight.alttitle
source: Maximal height of resizable RTE in pixels
de: Maximale Höhe des in der Größe veränderbaren RTE in Pixel

# rteMaxHeight.description
source: The value you set should allow sufficient height for the tool bar, the editing area and the status bar of the RTE. Default value is 2000.
de: Die Höhe, die Sie angeben, sollte genügend Raum für die Menüleiste, den Editierbereich und die Statusleiste des RTE lassen. Standardwert ist 2000.
