Repository: rafu1987/t3bootstrap-project
Catalog: typo3conf/l10n/*/saltedpasswords/*.locallang.xlf
Languages: de

# ext.saltedpasswords.title.tx_saltedpasswords_salts_phpass
source: Portable PHP password hashing (phpass)
de: Portables PHP-Passwort-Hashing (phpass)

# ext.saltedpasswords.title.tx_saltedpasswords_salts_md5
source: MD5 salted hashing (secure)
de: MD5-salted Hashing (sicher)

# ext.saltedpasswords.title.tx_saltedpasswords_salts_blowfish
source: Blowfish salted hashing (advanced)
de: Blowfish-salted Hashing (erweitert)

# ext.saltedpasswords.tasks.bulkupdate.name
source: Convert user passwords to salted hashes
de: Benutzerpasswörter zu saltedpasswords konvertieren

# ext.saltedpasswords.tasks.bulkupdate.description
source: Update all frontend and backend user passwords to salted hashes. This task deactivates itself when completed.
de: Alle Frontend- und Backend-Benutzerpasswörter zu saltedpasswords aktualisieren. Dieser Task deaktiviert sich nach Beendigung selbst.

# ext.saltedpasswords.tasks.bulkupdate.label.numberOfRecords
source: The number of records to process on each run
de: Die Anzahl zu bearbeitender Datensätze pro Durchlauf

# ext.saltedpasswords.tasks.bulkupdate.invalidNumberOfRecords
source: The number of records to process on each run must be greater than zero and numeric.
de: Die Anzahl zu bearbeitender Datensätze pro Durchlauf muss größer Null und numerisch sein.

# ext.saltedpasswords.tasks.bulkupdate.label.canDeactivateSelf
source: Deactivate if all records are converted
de: Deaktivieren sobald alle Datensätze konvertiert wurden

# ext.saltedpasswords.tasks.bulkupdate.label.additionalinformation.deactivateself
source: Deactivate=
de: Deaktivieren=

# ext.saltedpasswords.tasks.bulkupdate.label.additionalinformation.numberofrecords
source: Number of records=
de: Anzahl Datensätze=
